{
  "totalUntagged": 212,
  "discoveredThemes": [
    {
      "theme": "landing-technique",
      "count": 51,
      "samples": [
        {
          "id": "ZMtfJEtEq1w-0",
          "text": "**Master the backside 360 by focusing on a smooth setup carve with light heel pressure, a controlled wind-up on your toe edge, and a committed upper body rotation, using counter-rotation to fine-tune ",
          "videoTitle": "Backside 360s Fully Explained!"
        },
        {
          "id": "ghyr9ohkY8M-0",
          "text": "**Pop fully before grabbing to maintain rotation and control, and avoid ollies onto rails to minimize unnecessary height and impact.**",
          "videoTitle": "10 Park Tips Every Snowboarder Should Know!"
        },
        {
          "id": "ggCtcSsjCRQ-1",
          "text": "**Keep your head looking forward over your front shoulder to maintain balance and control.** Avoid closing your front shoulder or spotting your hand, as this will hinder your ability to spot your land",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "Aytgnig-BZs-1",
          "text": "Maintain eye contact with your spotting point even after passing it, looking uphill to control your rotation and prevent over-rotation onto your heels for a clean landing.",
          "videoTitle": "Learn From The Pros - Hiroto Ogiwara Snowboarding Breakdown"
        },
        {
          "id": "nkwk__n1k10-0",
          "text": "To improve blind landings, hold the landing position longer than comfortable and approach features with a straight angle to minimize sideways momentum.",
          "videoTitle": "8 Simple Rail Tips That Make a Huge Difference!"
        }
      ],
      "allRecords": [
        {
          "id": "ZMtfJEtEq1w-0",
          "text": "**Master the backside 360 by focusing on a smooth setup carve with light heel pressure, a controlled wind-up on your toe edge, and a committed upper body rotation, using counter-rotation to fine-tune your spin and landing.**",
          "videoTitle": "Backside 360s Fully Explained!"
        },
        {
          "id": "ghyr9ohkY8M-0",
          "text": "**Pop fully before grabbing to maintain rotation and control, and avoid ollies onto rails to minimize unnecessary height and impact.**",
          "videoTitle": "10 Park Tips Every Snowboarder Should Know!"
        },
        {
          "id": "ggCtcSsjCRQ-1",
          "text": "**Keep your head looking forward over your front shoulder to maintain balance and control.** Avoid closing your front shoulder or spotting your hand, as this will hinder your ability to spot your landing.",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "Aytgnig-BZs-1",
          "text": "Maintain eye contact with your spotting point even after passing it, looking uphill to control your rotation and prevent over-rotation onto your heels for a clean landing.",
          "videoTitle": "Learn From The Pros - Hiroto Ogiwara Snowboarding Breakdown"
        },
        {
          "id": "nkwk__n1k10-0",
          "text": "To improve blind landings, hold the landing position longer than comfortable and approach features with a straight angle to minimize sideways momentum.",
          "videoTitle": "8 Simple Rail Tips That Make a Huge Difference!"
        },
        {
          "id": "1OTy5HD8aRo-2",
          "text": "Trust your training and visualize success, even when experiencing doubt or taking falls; intentionally over-rotate jumps for a safer landing.",
          "videoTitle": "The Best Training Day of My Life! (Banger Park)"
        },
        {
          "id": "1OTy5HD8aRo-1",
          "text": "**To improve jump landings, practice until hesitation is eliminated, focusing on faster rotation for controlled counter-rotation.**",
          "videoTitle": "The Best Training Day of My Life! (Banger Park)"
        },
        {
          "id": "9FSdrkfW8dM-0",
          "text": "**For tricks involving rotation, lead with your upper body and use counter-rotation to control your spin and spot your landing, especially when dealing with unpredictable air time.**",
          "videoTitle": "Analyzing Knuckle Huck 2025 To Learn How The Tricks Work!"
        },
        {
          "id": "Aytgnig-BZs-0",
          "text": "**Keep your head centered and vision down, looking through the spin, to maintain core engagement and absorb landings.**",
          "videoTitle": "Learn From The Pros - Hiroto Ogiwara Snowboarding Breakdown"
        },
        {
          "id": "hnQSgkb1-vI-1",
          "text": "Maintain a \"stacked\" riding position throughout your takeoff, flight, and landing on side hits to maximize board contact and control.",
          "videoTitle": "Side-Hits Explained"
        },
        {
          "id": "pBjsn8aX53Q-3",
          "text": "**Land and absorb impact by squatting low with weight slightly on your toe edge, then shift to a balanced, stacked position with weight over the balls of your feet to disperse momentum cleanly.**",
          "videoTitle": "How Liam Brearley Uses Counter-Rotation To \"DOMINATE\""
        },
        {
          "id": "mePZ-fCKCeQ-4",
          "text": "**Land tail-heavy with weight over the balls of your feet, upper body forward, to control rotation and absorb impact.**",
          "videoTitle": "How to Land Like a Pro"
        },
        {
          "id": "feDiAp39vx8-1",
          "text": "**Keep your chest facing downhill throughout the spin for improved visibility and control during landing, minimizing the risk of under/over-rotation.**",
          "videoTitle": "Why Pro Snowboarders Spin Frontside in Different Ways"
        },
        {
          "id": "mePZ-fCKCeQ-0",
          "text": "To land a spinning trick, slightly under-rotate and dig your heels in to absorb rotational energy, preventing toe-edge catches.",
          "videoTitle": "How to Land Like a Pro"
        },
        {
          "id": "YLn_vhY8LC4-0",
          "text": "**Land transitions with bent knees and a hinged hip to absorb impact and maintain a balanced, powerful stance.**",
          "videoTitle": "FUNDAMENTALS Pushed To The Max And what you can learn from it!"
        },
        {
          "id": "lk3d1PZv1lM-0",
          "text": "**Before attempting a trick, assess the jump's characteristics (kick, airtime, landing) and current conditions (snow consistency) to adjust your trick execution and minimize risk of injury.**",
          "videoTitle": "Breaking Down My Biggest SLAM"
        },
        {
          "id": "1dgmtcQeZfs-1",
          "text": "Here's a concise, actionable bullet point summarizing the snowboarding tip:\n\n*   Maintain a centered stance over the balls of your feet, using your body's forward momentum to initiate rotation rather than forcing it, and keep your legs bent to absorb landings.",
          "videoTitle": "This Is Why Rene Rinnekangas Is My Favourite Snowboarder!"
        },
        {
          "id": "WjdBqH7jA7o-3",
          "text": "Here's a bullet point summarizing the tip:\n\n*   On a flat trampoline surface, initiate frontside rotations with your weight centered or slightly over your toes, and avoid looking directly over your shoulder to prevent landing on your heels and flopping backward.",
          "videoTitle": "How To Train Frontside Spins On Tramp"
        },
        {
          "id": "mePZ-fCKCeQ-3",
          "text": "Avoid landing nose-heavy by aiming for a balanced landing with both feet simultaneously, shifting your hips and body slightly forward to absorb impact if needed.",
          "videoTitle": "How to Land Like a Pro"
        },
        {
          "id": "vavFASR0Cbc-1",
          "text": "To land bigger rotations, lead the spin with your back arm and utilize counter-rotation to slow your maximum spin velocity, ensuring a taller, flatter takeoff by reducing heel-edge pressure.",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "hnQSgkb1-vI-2",
          "text": "Maintain a balanced, stacked stance over your board throughout the in-run and takeoff to ensure a stable landing.",
          "videoTitle": "Side-Hits Explained"
        },
        {
          "id": "1rNRH5ZlPcc-3",
          "text": "**Identify and refine your technique:** Even after landing a difficult trick, review footage to identify areas for improvement and ensure proper technique for future attempts.",
          "videoTitle": "Snowboarding’s Dirty Secret (What the Pros Aren’t Telling You)"
        },
        {
          "id": "u_8U2RJ8aJs-4",
          "text": "Maintain your \"stacked position\" throughout jumps and rotations, aiming to land back in it for better balance and control.",
          "videoTitle": "This Off Snow Training Will Make You A Better Snowboarder!!! (No Gear Needed)"
        },
        {
          "id": "3JJz0slua-4-0",
          "text": "Here's a concise, actionable bullet point:\n\n*   Maintain a balanced stance, keeping your weight centered over your board with bent knees, rather than leaning excessively on your heel edge when launching off pow features to ensure a stable landing.",
          "videoTitle": "Why These Snowboarding Crashes Happened!"
        },
        {
          "id": "GiZkJNRDoCY-1",
          "text": "To make landings easier, counter-rotate during the trick to reduce rotational energy before impact.",
          "videoTitle": "Unlock Total Control with Counter Rotation – Tramp Like a Snowboarder Ep 2"
        },
        {
          "id": "KJlfus1m19I-0",
          "text": "Maintain a tall, extended body with a strong core off the takeoff, allowing your body to rotate around your spotting point for better control and safer landings.",
          "videoTitle": "I Made These Mistakes So You Don’t Have To! - EP 4 Bunus"
        },
        {
          "id": "mePZ-fCKCeQ-1",
          "text": "**Land tail-heavy by extending your legs and shifting your hips back while keeping your upper body forward and rotated open to absorb impact and maintain balance.**",
          "videoTitle": "How to Land Like a Pro"
        },
        {
          "id": "C9WmozVndGs-4",
          "text": "**Maintain a \"stacked\" body position over the balls of your feet throughout the takeoff, rail, and landing to ensure balance and control.**",
          "videoTitle": "The Technique Pros Use for Effortless Rails"
        },
        {
          "id": "juuQUxnez3U-0",
          "text": "**Scan and adapt:** Vigorously search for side hits, critically assessing their takeoff, transition, and landing to choose the right approach and speed, and be prepared to improvise.",
          "videoTitle": "Epic Side Hits at Whistler Blackcomb - Perfect Day on Crystal Chair! (RAW)"
        },
        {
          "id": "pBjsn8aX53Q-2",
          "text": "**Spot your landing:** Keep your eyes on the landing and let your body rotate naturally, creating an exaggerated twist that helps you see your landing and artificially increases your height over the board.",
          "videoTitle": "How Liam Brearley Uses Counter-Rotation To \"DOMINATE\""
        },
        {
          "id": "kPbuPdKFpO8-2",
          "text": "Open your hips slightly to make it easier to sink into your back leg, improving control for takeoffs, air time, and landings.",
          "videoTitle": "90% of Snowboarders Are Jumping Wrong (Here's Why)"
        },
        {
          "id": "u_8U2RJ8aJs-3",
          "text": "**Stay balanced and centered over your feet by keeping your knees bent and avoiding popping up too tall to ensure a stable landing.**",
          "videoTitle": "This Off Snow Training Will Make You A Better Snowboarder!!! (No Gear Needed)"
        },
        {
          "id": "1OTy5HD8aRo-0",
          "text": "To complete your final rotation, duck over your shoulder and intentionally over-rotate to land on your toes.",
          "videoTitle": "The Best Training Day of My Life! (Banger Park)"
        },
        {
          "id": "J5e7gehiepo-0",
          "text": "Angle your upper body before popping to naturally align your legs for a smoother, less toe-heavy landing.",
          "videoTitle": "How ZEB POWELL Does The IMPOSSIBLE!!!"
        },
        {
          "id": "J5e7gehiepo-3",
          "text": "Land jumps with an open chest to maximize your range of motion and continue momentum through the landing.",
          "videoTitle": "How ZEB POWELL Does The IMPOSSIBLE!!!"
        },
        {
          "id": "cJM9DLK7lvM-3",
          "text": "**Keep your head pointed forward and neutral during tricks like hand drags and flips to maintain balance and control, allowing for a controlled rotation and safe landing.**",
          "videoTitle": "How @truthdsmith Gets Massive POP – Snowboarding Breakdown"
        },
        {
          "id": "hnQSgkb1-vI-0",
          "text": "**Preemptively angle your upper body off the lip to align with your legs as they come up, and hinge your upper body forward while bringing your legs towards you to maintain a stable center of balance and absorb landings.**",
          "videoTitle": "Side-Hits Explained"
        },
        {
          "id": "3pOhNvSJJAc-4",
          "text": "Maintain a bent-leg, \"rock\" motion with your weight on the balls of your feet and your upper body leaning forward to improve straighter landings.",
          "videoTitle": "Improving Your Straight Airs"
        },
        {
          "id": "GQ-WOFDRK-c-0",
          "text": "To land complex tricks like a counter-rotated back five or a Miller flip, prioritize counter-rotating your upper body to lead the spin, then catch up with your legs for control and a smoother landing.",
          "videoTitle": "￼Trying To Understand WTF Happened at XGames Knuckle Huck 2025"
        },
        {
          "id": "YLn_vhY8LC4-3",
          "text": "**Hinge your upper body slightly and stay set back on your heels during take-off and landing to naturally bring your board up, absorb impact, and maintain control for a powerful, smooth ride.**",
          "videoTitle": "FUNDAMENTALS Pushed To The Max And what you can learn from it!"
        },
        {
          "id": "YLn_vhY8LC4-4",
          "text": "Maintain a consistent, slightly bent-knee, squat-like position with your upper body leaning forward over the balls of your feet to keep your weight centered and balanced throughout jumps and landings.",
          "videoTitle": "FUNDAMENTALS Pushed To The Max And what you can learn from it!"
        },
        {
          "id": "irebk8cBAiw-2",
          "text": "Maintain a slight forward lean with your body, allowing your feet to absorb impacts by pushing off the ground, and avoid pulling your legs up as you bounce.",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "GiZkJNRDoCY-4",
          "text": "**Build rotational tension in your core and lead with your upper body, then actively counter-rotate your arms to control your spin and land tricks more easily.**",
          "videoTitle": "Unlock Total Control with Counter Rotation – Tramp Like a Snowboarder Ep 2"
        },
        {
          "id": "dE1qxN1rEkU-0",
          "text": "Focus on mastering fundamental techniques like maintaining speed, keeping knees bent, and proper body positioning on smaller features before attempting advanced tricks on larger terrain to prevent injuries and mental blocks.",
          "videoTitle": "I Made These Mistakes So You Don’t Have To! - EP 2"
        },
        {
          "id": "ghyr9ohkY8M-2",
          "text": "**Apply tail pressure for a pop before hitting a rail to get extra height, minimize impact, and improve control.**",
          "videoTitle": "10 Park Tips Every Snowboarder Should Know!"
        },
        {
          "id": "rC7678uwQoQ-0",
          "text": "To successfully land new, complex tricks, commit fully to the takeoff, visualize the trick, and focus on a clean spin axis rather than just a flippy motion.",
          "videoTitle": "Today I Tried My Dream Trick - Japan Vlog 5"
        },
        {
          "id": "E2aEaj_AnHM-2",
          "text": "**Absorb landings by aligning your upper body with your board's momentum, rather than forcing an immediate rotation, to land cleanly and safely.**",
          "videoTitle": "Torstein Horgmo’s Spring Park Style – Breaking Down the Pros"
        },
        {
          "id": "J9AqhLkqSUw-1",
          "text": "**Ride rails with more speed** to avoid needing excessive board flex and landing tail-heavy, which makes tricks harder.",
          "videoTitle": "I Made These Mistakes So You Don't Have To! - EP 5"
        },
        {
          "id": "2T8gNytqD6w-0",
          "text": "**Maintain a stacked, upright body position with hands over knees and a slight toe edge pressure for balance, avoiding excessive forward lean and over-flexing the board during takeoff to improve control and landing.**",
          "videoTitle": "Improving your Straight Airs"
        },
        {
          "id": "twmwAoucAAI-0",
          "text": "**Spot the knuckle and keep your eyes locked on it throughout your rotation to control your spin and land smoothly, especially when your back is facing downhill.**",
          "videoTitle": "Learn To Constant Spot Unlock Total Air Control!"
        },
        {
          "id": "mePZ-fCKCeQ-2",
          "text": "Land tail-heavy with your weight over your toes as a safety net to avoid edge catches when unsure of your rotation or landing angle.",
          "videoTitle": "How to Land Like a Pro"
        }
      ]
    },
    {
      "theme": "rotation-spin",
      "count": 44,
      "samples": [
        {
          "id": "L98xaOkYlCQ-0",
          "text": "Keep your head stationary, locking your gaze on a fixed point (like the center of the trampoline) throughout your spin to maintain fluid rotation.",
          "videoTitle": "This Makes Snowboarding Tricks Work – Ep 3"
        },
        {
          "id": "gZM-czn3C7k-2",
          "text": "**Focus your rotation by picking a spot ahead and tracking it visually, while limiting your upper body rotation to 90 degrees to prevent overextension.**",
          "videoTitle": "Master Frontside Spins This Summer – Off-Season Secrets!"
        },
        {
          "id": "irebk8cBAiw-3",
          "text": "**Instead of bouncing, focus on a powerful push and snap with a slight hinge, strong spine, and chin forward for a stable base before attempting spins.**",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "IQzKyeopof8-1",
          "text": "Build pressure on your board by hinging at your hips and bending your knees, then delay your arm and body rotation to snap off the tail for powerful frontside spins.",
          "videoTitle": "Unlock Your Frontside Potential This Summer!—No Equipment Required"
        },
        {
          "id": "eYCFNjrryYM-2",
          "text": "**Initiate frontside spins by leading with your hips, then chest, and finally arms, to avoid over-rotation and nose dives.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        }
      ],
      "allRecords": [
        {
          "id": "L98xaOkYlCQ-0",
          "text": "Keep your head stationary, locking your gaze on a fixed point (like the center of the trampoline) throughout your spin to maintain fluid rotation.",
          "videoTitle": "This Makes Snowboarding Tricks Work – Ep 3"
        },
        {
          "id": "gZM-czn3C7k-2",
          "text": "**Focus your rotation by picking a spot ahead and tracking it visually, while limiting your upper body rotation to 90 degrees to prevent overextension.**",
          "videoTitle": "Master Frontside Spins This Summer – Off-Season Secrets!"
        },
        {
          "id": "irebk8cBAiw-3",
          "text": "**Instead of bouncing, focus on a powerful push and snap with a slight hinge, strong spine, and chin forward for a stable base before attempting spins.**",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "IQzKyeopof8-1",
          "text": "Build pressure on your board by hinging at your hips and bending your knees, then delay your arm and body rotation to snap off the tail for powerful frontside spins.",
          "videoTitle": "Unlock Your Frontside Potential This Summer!—No Equipment Required"
        },
        {
          "id": "eYCFNjrryYM-2",
          "text": "**Initiate frontside spins by leading with your hips, then chest, and finally arms, to avoid over-rotation and nose dives.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "Aytgnig-BZs-3",
          "text": "Maintain balance over the balls of your feet during spins by tucking your chin to your core, creating tension and a slight bend in your legs to counteract rotation.",
          "videoTitle": "Learn From The Pros - Hiroto Ogiwara Snowboarding Breakdown"
        },
        {
          "id": "u_8U2RJ8aJs-2",
          "text": "**Practice a \"stacked\" body position with controlled counter-rotation off-snow to improve aerial efficiency and build muscle memory for winter riding.**",
          "videoTitle": "This Off Snow Training Will Make You A Better Snowboarder!!! (No Gear Needed)"
        },
        {
          "id": "62zLmATvilw-4",
          "text": "Prioritize hip rotation for backside spins, using your core and extending your hips fully to generate power and increase range of motion for larger rotations.",
          "videoTitle": "This Discovery Changed Backside Spins Forever"
        },
        {
          "id": "fmuZHp81oo0-0",
          "text": "Focus on keeping your shoulders parallel and your head under your leading arm to maintain axis control during backside spins, avoiding excessive hip opening or closing for a clean rotation.",
          "videoTitle": "Backside Wind-Ups Explained"
        },
        {
          "id": "feDiAp39vx8-0",
          "text": "Avoid finishing frontside spins blind by rotating your chest more than 90 degrees during the initial throw and using your shoulders to guide the rest of the rotation, not just to drop.",
          "videoTitle": "Why Pro Snowboarders Spin Frontside in Different Ways"
        },
        {
          "id": "JNWqEZg1OBM-2",
          "text": "To achieve a powerful snowboarding stance, open your hips, hinge your hips back while leaning your torso slightly forward (not keeping your spine straight), and coordinate these movements to load your weight effectively over the board.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "qQDpPNw8MK8-0",
          "text": "Maintain a \"stack position\" with a slight bend in your legs and upper body, keeping your weight balanced over the balls of your feet to maximize control and power in all snowboarding movements.",
          "videoTitle": "The Foundation of All Snowboarding — Train This Off-Season!"
        },
        {
          "id": "62zLmATvilw-2",
          "text": "**Rotate around your front foot with an upward motion and stationary head to maintain a consistent axis, allowing for continuous spinning and easier rotation control.**",
          "videoTitle": "This Discovery Changed Backside Spins Forever"
        },
        {
          "id": "8EmOM3PDK4I-3",
          "text": "Practice rotating your hips, torso, and chest before your arms to create a smoother, more powerful frontside spin.",
          "videoTitle": "5 Snowboard Exercises I Do Every Day — Here's Why"
        },
        {
          "id": "gZM-czn3C7k-3",
          "text": "**Avoid over-rotating your upper body off the lip by keeping your maximum shoulder rotation to 90 degrees, and don't wind up too early to maintain stability.**",
          "videoTitle": "Master Frontside Spins This Summer – Off-Season Secrets!"
        },
        {
          "id": "u_8U2RJ8aJs-1",
          "text": "Maintain proper head positioning by keeping it under your armpit (not looking over your shoulder) to avoid disconnecting your body and maximize counter-rotation.",
          "videoTitle": "This Off Snow Training Will Make You A Better Snowboarder!!! (No Gear Needed)"
        },
        {
          "id": "IQzKyeopof8-0",
          "text": "To maximize a frontside spin's power and fluidity, rotate your chest with your chin slightly down, focusing your eyes on the knuckle for precise spotting and avoiding over-rotation.",
          "videoTitle": "Unlock Your Frontside Potential This Summer!—No Equipment Required"
        },
        {
          "id": "hzBczFRMT60-0",
          "text": "**Focus on timing and connecting your movements to store and release energy efficiently, rather than just twisting harder, to generate power for spins.**",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "w7Zg-hVrmp0-3",
          "text": "Practice switch frontside and backside rotations to improve your versatility on the board.",
          "videoTitle": "Is 100 Different Tricks In A Day Possible? (10K SUBSCRIBER SPECIAL!)"
        },
        {
          "id": "pBjsn8aX53Q-1",
          "text": "For flippy tricks, tuck your head into your shoulder to change axis of rotation and achieve unique spins.",
          "videoTitle": "How Liam Brearley Uses Counter-Rotation To \"DOMINATE\""
        },
        {
          "id": "NyLF2_Zqiq0-0",
          "text": "**To increase range of motion for fluid snowboarding, shift your hips back while hinging your upper body forward, keeping your center of balance over the board.**",
          "videoTitle": "Why Riding Centred Is Holding You Back (and How to Fix It)"
        },
        {
          "id": "vavFASR0Cbc-2",
          "text": "Delay pulling your upper body into the spin until after the board has caught up to generate more rotational power and a flatter axis.",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "1rNRH5ZlPcc-0",
          "text": "Re-evaluate your spin technique, practicing on smaller features to build confidence and attempt new tricks you've previously avoided.",
          "videoTitle": "Snowboarding’s Dirty Secret (What the Pros Aren’t Telling You)"
        },
        {
          "id": "YgnaInyE644-1",
          "text": "Maintain an upright, neutral body position with your chest up, avoiding dropping your shoulders downwards when initiating spins to prevent falling off balance.",
          "videoTitle": "The Secret To Spinning Like A Pro! – Core Moves Every Snowboarder Needs - EP 4"
        },
        {
          "id": "8EmOM3PDK4I-2",
          "text": "Initiate your spin by extending your legs and throwing your arms, followed by your chest and hips, to generate momentum and height for a larger rotation.",
          "videoTitle": "5 Snowboard Exercises I Do Every Day — Here's Why"
        },
        {
          "id": "BfJchS7Ue3Y-3",
          "text": "**Pre-position your arms low for the snap, then lift them while driving your shoulders to generate smooth, consistent power.**",
          "videoTitle": "Breaking Down Pro Snowboard Spins – What I’m Missing (29-Minute Study)"
        },
        {
          "id": "GiZkJNRDoCY-0",
          "text": "Initiate spins by hinging your hips and keeping your shoulders neutral and relaxed, avoiding arm-driven lifts to maintain core-body connection for smoother rotations.",
          "videoTitle": "Unlock Total Control with Counter Rotation – Tramp Like a Snowboarder Ep 2"
        },
        {
          "id": "eYCFNjrryYM-4",
          "text": "**Focus on a fluent, unhurried rotation, initiating with your hips and core before your arms, to generate consistent power and avoid getting stuck mid-spin.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "62zLmATvilw-0",
          "text": "**Stand tall and extend your legs over your board** to maximize snap and generate upward lift, avoiding a hunched-over stance that directs rotation downwards.",
          "videoTitle": "This Discovery Changed Backside Spins Forever"
        },
        {
          "id": "L98xaOkYlCQ-1",
          "text": "Practice spotting by pointing your finger at a fixed point in front of you, rotating your body while keeping your eyes locked on your finger, and using counter-rotation to maintain this visual connection for better trick execution.",
          "videoTitle": "This Makes Snowboarding Tricks Work – Ep 3"
        },
        {
          "id": "J9AqhLkqSUw-0",
          "text": "**Avoid squatting too low and reaching for grabs early; keep legs straighter and upper body engaged throughout the spin for a smoother, more powerful rotation.**",
          "videoTitle": "I Made These Mistakes So You Don't Have To! - EP 5"
        },
        {
          "id": "feDiAp39vx8-2",
          "text": "Here's the summary:\n\n*   Initiate spins by pulling your body up into your back leg, rotating over your back foot with your head down, allowing you to easily adjust or pull out of the rotation.",
          "videoTitle": "Why Pro Snowboarders Spin Frontside in Different Ways"
        },
        {
          "id": "NyLF2_Zqiq0-4",
          "text": "Practice a stacked, neutral body position off the board, then shift your weight to your back leg and twist your upper body forward to get lower and initiate dynamic movements.",
          "videoTitle": "Why Riding Centred Is Holding You Back (and How to Fix It)"
        },
        {
          "id": "feDiAp39vx8-4",
          "text": "**Master flat spins first:** They are a consistent, safe, and fun way to start spinning, ideal for casual riders.",
          "videoTitle": "Why Pro Snowboarders Spin Frontside in Different Ways"
        },
        {
          "id": "irebk8cBAiw-0",
          "text": "**Maintain balance over the balls of your feet with bent knees and a slightly hinged upper body for controlled rotation, using only a few controlled bounces (e.g., the 3-bounce system) to initiate your tricks.**",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "qQDpPNw8MK8-3",
          "text": "To maintain balance and power, bend your knees and allow your upper body to naturally come forward, aiming for a \"chest over knees\" position, rather than keeping your back straight.",
          "videoTitle": "The Foundation of All Snowboarding — Train This Off-Season!"
        },
        {
          "id": "J5e7gehiepo-4",
          "text": "**For a powerful rotation like a backflip, drive your hips forward and lift your chest, keeping your head naturally connected to your shoulder as it leads the upper body's movement.**",
          "videoTitle": "How ZEB POWELL Does The IMPOSSIBLE!!!"
        },
        {
          "id": "1OTy5HD8aRo-3",
          "text": "Master riding switch to improve your cat spins and other advanced tricks.",
          "videoTitle": "The Best Training Day of My Life! (Banger Park)"
        },
        {
          "id": "1dgmtcQeZfs-3",
          "text": "So, you've got to pull your upper body over to compensate. So, he's doing that while holding the bent down position. And you can see he's basically in",
          "videoTitle": "This Is Why Rene Rinnekangas Is My Favourite Snowboarder!"
        },
        {
          "id": "NyLF2_Zqiq0-2",
          "text": "Shift your weight slightly back over your rear foot, leaning your upper body forward to maintain balance, allowing for greater hip rotation and control.",
          "videoTitle": "Why Riding Centred Is Holding You Back (and How to Fix It)"
        },
        {
          "id": "WjdBqH7jA7o-4",
          "text": "**Apply controlled pressure on your snowboard; avoid stamping too hard to maintain a smooth, connected trick execution and prevent disruption.**",
          "videoTitle": "How To Train Frontside Spins On Tramp"
        },
        {
          "id": "ggCtcSsjCRQ-0",
          "text": "To execute this trick, squat low with a straight back, keeping your upper body forward and your hand naturally reaching straight down, aligned with your back foot.",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "ggCtcSsjCRQ-3",
          "text": "Squat down, keep shoulders squared, and extend your leading arm to your back foot for a balanced hand position that aids rotation close to the board.",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "feDiAp39vx8-3",
          "text": "Master the \"constant cork\" technique by setting over your back foot for efficient, controlled spins that simplify difficult tricks and open up advanced maneuvers.",
          "videoTitle": "Why Pro Snowboarders Spin Frontside in Different Ways"
        }
      ]
    },
    {
      "theme": "carving-edges",
      "count": 33,
      "samples": [
        {
          "id": "JNWqEZg1OBM-0",
          "text": "On icy, bumpy terrain, ride for the conditions by staying stacked, controlling speed with solid weight over your board, and leading turns with weight shifts instead of leaning away.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "gZM-czn3C7k-4",
          "text": "Initiate your frontside spin with a setup carve and a slight pre-spin (around 45 degrees) to help initiate the rotation.",
          "videoTitle": "Master Frontside Spins This Summer – Off-Season Secrets!"
        },
        {
          "id": "ooz5KRJNRVg-3",
          "text": "Pop up into your rotation before turning to maintain control, and use bent knees to minimize counter-rotation for smoother spins.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "JNWqEZg1OBM-1",
          "text": "To grip the edge, especially on ice, drop your upper body forward over your knees and shift your hips back slightly, allowing you to load pressure onto the edge while keeping your weight centered.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "GmaPVySigrQ-0",
          "text": "**Delay your edge change and keep your upper body closed for as long as possible to maximize rotational momentum and control during frontside spins.**",
          "videoTitle": "The #1 Mistake On Frontside Spins (And How to Fix It Fast)"
        }
      ],
      "allRecords": [
        {
          "id": "JNWqEZg1OBM-0",
          "text": "On icy, bumpy terrain, ride for the conditions by staying stacked, controlling speed with solid weight over your board, and leading turns with weight shifts instead of leaning away.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "gZM-czn3C7k-4",
          "text": "Initiate your frontside spin with a setup carve and a slight pre-spin (around 45 degrees) to help initiate the rotation.",
          "videoTitle": "Master Frontside Spins This Summer – Off-Season Secrets!"
        },
        {
          "id": "ooz5KRJNRVg-3",
          "text": "Pop up into your rotation before turning to maintain control, and use bent knees to minimize counter-rotation for smoother spins.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "JNWqEZg1OBM-1",
          "text": "To grip the edge, especially on ice, drop your upper body forward over your knees and shift your hips back slightly, allowing you to load pressure onto the edge while keeping your weight centered.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "GmaPVySigrQ-0",
          "text": "**Delay your edge change and keep your upper body closed for as long as possible to maximize rotational momentum and control during frontside spins.**",
          "videoTitle": "The #1 Mistake On Frontside Spins (And How to Fix It Fast)"
        },
        {
          "id": "xArsPSVoGdo-0",
          "text": "**Squat deeply into your turns to create more edge pressure through leg bend, mimicking a low carver, rather than relying on leaning your whole body.**",
          "videoTitle": "360s to 720s – Video Analysis: How We Took Ben’s Snowboarding to the Next Level"
        },
        {
          "id": "V0lAOGuqsr8-0",
          "text": "Maintain a slight bend in your knees to actively engage your edges for control and power throughout your turns, rather than riding too tall or too bent.",
          "videoTitle": "The 10 Most Common Riding Mistakes I See Everyday!!!"
        },
        {
          "id": "1dgmtcQeZfs-2",
          "text": "Maintain an exaggerated upper body hinge and shift weight subtly over your back foot to enable low, controlled edge-to-edge transitions and dynamic freestyle turns.",
          "videoTitle": "This Is Why Rene Rinnekangas Is My Favourite Snowboarder!"
        },
        {
          "id": "hnQSgkb1-vI-3",
          "text": "**Pre-angle your entire body (board, hips, upper body) towards the side hit takeoff, then extend your legs and reduce toe edge pressure just before takeoff to launch from a flat base.**",
          "videoTitle": "Side-Hits Explained"
        },
        {
          "id": "1rNRH5ZlPcc-2",
          "text": "Analyze local riders' carving techniques to identify and correct excessive drifting on jumps by comparing footage and formulating a plan.",
          "videoTitle": "Snowboarding’s Dirty Secret (What the Pros Aren’t Telling You)"
        },
        {
          "id": "1rNRH5ZlPcc-4",
          "text": "**Focus on fundamentals to build confidence:** When facing fatigue or difficult conditions, return to basic techniques to regain control and build momentum for more challenging maneuvers.",
          "videoTitle": "Snowboarding’s Dirty Secret (What the Pros Aren’t Telling You)"
        },
        {
          "id": "aSc5Q44Y3Zg-0",
          "text": "**Use preemptive movements like shifting to a flat base, opening your chest, and opening your hips before initiating a turn to ensure smooth transitions and prevent loss of traction.**",
          "videoTitle": "Stop Skidding Turns with This 1 Pro Trick Every Rider Should Know!"
        },
        {
          "id": "IQzKyeopof8-4",
          "text": "Shift your hips back to engage your heel edge, then gently rotate your shoulders by bringing your front hand towards your back leg for more power and range of motion in your spin.",
          "videoTitle": "Unlock Your Frontside Potential This Summer!—No Equipment Required"
        },
        {
          "id": "BfJchS7Ue3Y-2",
          "text": "Maintain a balanced stance by keeping your toe and heel edge positions as symmetrical as possible.",
          "videoTitle": "Breaking Down Pro Snowboard Spins – What I’m Missing (29-Minute Study)"
        },
        {
          "id": "NyLF2_Zqiq0-1",
          "text": "**Maintain a consistent body posture with hips back and upper body forward throughout the trick, ensuring your weight stays centered over your board and not shifting to your heels.**",
          "videoTitle": "Why Riding Centred Is Holding You Back (and How to Fix It)"
        },
        {
          "id": "RLlB8TMl1Dg-0",
          "text": "Maintain a tall, stacked posture over your board, allowing for a wider range of motion and powerful wind-up by exiting your heelside turn with your board pointed towards the corner of the jump.",
          "videoTitle": "Attempting To Understand The 2340 - Xgames Snowboarding Analysis"
        },
        {
          "id": "ZC4AGIqG0qU-0",
          "text": "Focus on a smooth, centered approach to jumps with minimal toe-edge pressure to prevent pre-spinning and ensure a straighter takeoff for improved rotation and control.",
          "videoTitle": "I Never Expected to Learn This Trick:) - Japan Vlog - 4"
        },
        {
          "id": "vavFASR0Cbc-3",
          "text": "**Focus on a tall, centered stance with minimal setup carve for smoother toe-edge transitions and increased wind-up for powerful rotations.**",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "3JJz0slua-4-4",
          "text": "On slushy or big jumps, ensure your form and confidence are solid before attempting tricks to avoid dangerous crashes due to under-rotation or heel catches.",
          "videoTitle": "Why These Snowboarding Crashes Happened!"
        },
        {
          "id": "QFjVq49lEJs-1",
          "text": "**For aggressive carving and better hip leverage, set both bindings angled downhill (positive-positive stance), but be aware this can hinder freestyle maneuvers like ollies.**",
          "videoTitle": "How To Choose Your Perfect Snowboard Stance! Every Stance in Action"
        },
        {
          "id": "aFXTSKWEpfk-0",
          "text": "**Focus on foundational techniques and gradual progression:** Instead of immediately attempting advanced tricks, build your frontside and cab takeoffs by staying more stacked over your board and relying less on edge pressure, mirroring successful backside spin techniques, to prepare for bigger airbags.",
          "videoTitle": "I learned 2 CRUCIAL things Today! - Vlog 2"
        },
        {
          "id": "3JJz0slua-4-1",
          "text": "Maintain a \"stacked\" riding position with bent knees and hips back, avoiding straight-legged leaning, to prevent edge catches and improve control.",
          "videoTitle": "Why These Snowboarding Crashes Happened!"
        },
        {
          "id": "8M1EPEs3Zl0-1",
          "text": "**Focus on staying upright, trusting your balance, and mastering edge engagement to progress beyond the beginner stage of snowboarding.**",
          "videoTitle": "Snowboard Levels EXPLAINED (You Might Be Better Than You Think)"
        },
        {
          "id": "JehebjfM_DA-0",
          "text": "To eliminate drift and create a strong snap for frontside spins, enter the jump with a light toe edge, transition to a flat base through the spoon of the jump, and then engage your heel edge for the wind-up and rotation.",
          "videoTitle": "The Key To Spinning Frontside"
        },
        {
          "id": "MGc-0XmRe0w-0",
          "text": "For park riding, choose a full camber board for superior snow grip, power, and responsiveness, especially for jumps.",
          "videoTitle": "Is The TEAM PRO Right For You? Honest Board Review"
        },
        {
          "id": "BfJchS7Ue3Y-0",
          "text": "Maintain a slight board angle towards the corner of the jump on your edge before the jump to increase your turn radius, prevent drifting, and smooth your transition onto the jump.",
          "videoTitle": "Breaking Down Pro Snowboard Spins – What I’m Missing (29-Minute Study)"
        },
        {
          "id": "8M1EPEs3Zl0-0",
          "text": "To improve your snowboarding, leverage expert knowledge and experiences that have been hard-earned over time.",
          "videoTitle": "Snowboard Levels EXPLAINED (You Might Be Better Than You Think)"
        },
        {
          "id": "egyYCMzpqu4-0",
          "text": "If your boots are size 10 or larger, opt for a wide snowboard to prevent toe and heel drag, which impedes deep carving and can cause your boots to hit the snow.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "pBjsn8aX53Q-4",
          "text": "**Rotate your upper body 90 degrees over your front foot to enable counter-rotation and clean up your turns.**",
          "videoTitle": "How Liam Brearley Uses Counter-Rotation To \"DOMINATE\""
        },
        {
          "id": "qQDpPNw8MK8-4",
          "text": "When turning to your heel edge, adjust your upper body to stay balanced over the board. When jumping, avoid fully extending your legs; instead, bend them to maintain your center of balance.",
          "videoTitle": "The Foundation of All Snowboarding — Train This Off-Season!"
        },
        {
          "id": "8EmOM3PDK4I-4",
          "text": "**Preemptively tilt your hips to your toe edge to initiate spins, then use your weight shift to your heels for a powerful pop and snap.**",
          "videoTitle": "5 Snowboard Exercises I Do Every Day — Here's Why"
        },
        {
          "id": "E2aEaj_AnHM-1",
          "text": "**Initiate spins with a \"dunking\" motion by extending your legs and driving your arms downward, while keeping your chest tall and over your toe edge to generate rotational speed and control.**",
          "videoTitle": "Torstein Horgmo’s Spring Park Style – Breaking Down the Pros"
        },
        {
          "id": "s86n54CfJfg-2",
          "text": "Master smooth transitions between your toe edge and heel edge stances.",
          "videoTitle": "Skiing vs Snowboarding – What’s REALLY Better?"
        }
      ]
    },
    {
      "theme": "jumping-air",
      "count": 30,
      "samples": [
        {
          "id": "eYCFNjrryYM-1",
          "text": "**Channel your rotational momentum off the jump by pushing your back hip closed, then opening your hips and upper body with your arms to maintain spin and control.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "kPbuPdKFpO8-1",
          "text": "Practice maintaining a strong, flexible stance with a wide range of motion, allowing for slight variations in your position without losing control or balance.",
          "videoTitle": "90% of Snowboarders Are Jumping Wrong (Here's Why)"
        },
        {
          "id": "rBkRQse_h8g-0",
          "text": "**Maintain tail pressure by shifting your weight back to your rear hip while pulling your upper body forward, ensuring your rotation pivots off the tail for a powerful takeoff.**",
          "videoTitle": "You’re Not Supposed to Jump or Ollie When Doing Tricks"
        },
        {
          "id": "eYCFNjrryYM-3",
          "text": "**Avoid early rotation on frontside spins by focusing on achieving maximum extension at takeoff, preventing premature rotation.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "m9mcgAfGeRk-0",
          "text": "Picking the right pair of boots is one of the most important things you can do as a snowboarder to the extent where if you pick the wrong pair of boot",
          "videoTitle": "Snowboard Boot Guide: How To Find The Perfect Fit!"
        }
      ],
      "allRecords": [
        {
          "id": "eYCFNjrryYM-1",
          "text": "**Channel your rotational momentum off the jump by pushing your back hip closed, then opening your hips and upper body with your arms to maintain spin and control.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "kPbuPdKFpO8-1",
          "text": "Practice maintaining a strong, flexible stance with a wide range of motion, allowing for slight variations in your position without losing control or balance.",
          "videoTitle": "90% of Snowboarders Are Jumping Wrong (Here's Why)"
        },
        {
          "id": "rBkRQse_h8g-0",
          "text": "**Maintain tail pressure by shifting your weight back to your rear hip while pulling your upper body forward, ensuring your rotation pivots off the tail for a powerful takeoff.**",
          "videoTitle": "You’re Not Supposed to Jump or Ollie When Doing Tricks"
        },
        {
          "id": "eYCFNjrryYM-3",
          "text": "**Avoid early rotation on frontside spins by focusing on achieving maximum extension at takeoff, preventing premature rotation.**",
          "videoTitle": "Unlock Better Frontside Spins This Summer! (No Snow/Gear Needed)"
        },
        {
          "id": "m9mcgAfGeRk-0",
          "text": "Picking the right pair of boots is one of the most important things you can do as a snowboarder to the extent where if you pick the wrong pair of boot",
          "videoTitle": "Snowboard Boot Guide: How To Find The Perfect Fit!"
        },
        {
          "id": "rBkRQse_h8g-1",
          "text": "For spins, leave the ground by pressing down on your tail throughout the lip, not by popping a large ollie, and maintain tail pressure for a stable rotation.",
          "videoTitle": "You’re Not Supposed to Jump or Ollie When Doing Tricks"
        },
        {
          "id": "u_8U2RJ8aJs-0",
          "text": "To effectively use counter-rotation for spins, lead your upper body rotation slightly before popping, ensuring your shoulders are not fully squared or overly rotated.",
          "videoTitle": "This Off Snow Training Will Make You A Better Snowboarder!!! (No Gear Needed)"
        },
        {
          "id": "r_Y2M1uMJ1c-0",
          "text": "**Master counter-rotation:** Utilize early upper body rotation to control spins, allowing for more precise grabs and preventing over-rotation, especially on larger jumps.",
          "videoTitle": "How Kevin Backstrom Makes Every Trick Look Effortless!"
        },
        {
          "id": "SL_bl8KC4HU-0",
          "text": "**Don't rush tricks on features you're not ready for, and ensure you have proper equipment and jump size before attempting advanced maneuvers.**",
          "videoTitle": "I Made These Mistakes So You Don’t Have To! - EP 4"
        },
        {
          "id": "GiZkJNRDoCY-2",
          "text": "**Adopt a stacked, counter-rotated body position with your head centered over the jump to achieve a fluid, \"balls of feet\" rotation.**",
          "videoTitle": "Unlock Total Control with Counter Rotation – Tramp Like a Snowboarder Ep 2"
        },
        {
          "id": "9MHtUPA_FME-0",
          "text": "**Avoid \"breaking at the waist\" by reaching for a grab before your board leaves the jump; instead, focus on proper body extension and hip shift for a powerful, controlled takeoff.**",
          "videoTitle": "I Made These Mistakes So You Don’t Have To! - EP 3"
        },
        {
          "id": "IQzKyeopof8-3",
          "text": "Focus on channeling energy through a smooth extension of your legs from bent to tall, rather than aggressively jumping, to maintain momentum and avoid losing potential height.",
          "videoTitle": "Unlock Your Frontside Potential This Summer!—No Equipment Required"
        },
        {
          "id": "rBkRQse_h8g-3",
          "text": "**Leave the jump off your tail to create a staggered leg bend and maintain air position, avoiding a time-delaying extension.**",
          "videoTitle": "You’re Not Supposed to Jump or Ollie When Doing Tricks"
        },
        {
          "id": "irebk8cBAiw-1",
          "text": "Practice consistent, controlled jumps on a trampoline with a slight bend in your knees and a forward upper body hinge to build a solid foundation for more advanced maneuvers.",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "LWsuXY5j9Sg-0",
          "text": "Use an airbag for a safe, low-cost environment to learn and practice new snowboarding tricks, allowing you to experiment with techniques and build confidence before taking them to snow.",
          "videoTitle": "I Learned 6 New Flips Today!!! - Japan Vlog 3"
        },
        {
          "id": "YLn_vhY8LC4-2",
          "text": "**Preemptively open your chest 90° away from your rotation direction before takeoff to allow your legs to catch up and facilitate a cleaner spin.**",
          "videoTitle": "FUNDAMENTALS Pushed To The Max And what you can learn from it!"
        },
        {
          "id": "3pOhNvSJJAc-3",
          "text": "Maintain an upright upper body and focus the bend in your back leg, keeping your weight over the balls of your feet, to stay within your effective range of motion for straight airs.",
          "videoTitle": "Improving Your Straight Airs"
        },
        {
          "id": "5sLK7M8x_bI-0",
          "text": "**For jumps, maintain an athletic stance with a slight bend in your legs, avoid excessive squatting, and flatten your base before popping for maximum control and power.**",
          "videoTitle": "Top Snowboarding Mistakes Holding You Back (And How to Fix Them!)"
        },
        {
          "id": "CZTkze4CFMc-4",
          "text": "Initiate your takeoff by dropping your shoulder in coordination with your lower body to set a downhill trajectory and facilitate a quicker grab.",
          "videoTitle": "Live Coaching: Backside Rotations Made Easy"
        },
        {
          "id": "rBkRQse_h8g-4",
          "text": "Maintain a flexible body position and core balance throughout your trick, rather than forcing rotation with your legs, to allow for minor form imperfections.",
          "videoTitle": "You’re Not Supposed to Jump or Ollie When Doing Tricks"
        },
        {
          "id": "BfJchS7Ue3Y-4",
          "text": "**Aggressively approach jumps with an open chest and hips angled towards the corner, bending early to facilitate a powerful wind-up and faster transition.**",
          "videoTitle": "Breaking Down Pro Snowboard Spins – What I’m Missing (29-Minute Study)"
        },
        {
          "id": "J5e7gehiepo-2",
          "text": "Maintain a bent-down front board position through the takeoff, utilizing counter-rotation of the hips for rotation rather than an ollie or leg extension.",
          "videoTitle": "How ZEB POWELL Does The IMPOSSIBLE!!!"
        },
        {
          "id": "cvYKy5GWKIo-0",
          "text": "Maintain a strong, centered body position with minimal movement, extending through your tail for powerful, controlled pops off side hits.",
          "videoTitle": "How Arthur Longo MASTERED Side Hits & How You Can Too!"
        },
        {
          "id": "1rNRH5ZlPcc-1",
          "text": "Reduce stress to improve focus and air awareness for better trick execution.",
          "videoTitle": "Snowboarding’s Dirty Secret (What the Pros Aren’t Telling You)"
        },
        {
          "id": "hnQSgkb1-vI-4",
          "text": "To pop and gain height off side hits, push your board into the snow and mold it to the feature's contours to maximize contact time, rather than just lifting your legs.",
          "videoTitle": "Side-Hits Explained"
        },
        {
          "id": "hzBczFRMT60-1",
          "text": "**Focus on what you *want* to do at takeoff, not what you want to avoid, to ensure your body executes the desired action.**",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "BfJchS7Ue3Y-1",
          "text": "**Minimize upper body rotation and maintain a gradual board angle on the takeoff to avoid excessive sideways momentum and pre-mature leaning.**",
          "videoTitle": "Breaking Down Pro Snowboard Spins – What I’m Missing (29-Minute Study)"
        },
        {
          "id": "w7Zg-hVrmp0-1",
          "text": "To maximize your trick count, perform variations of tricks (e.g., cab 5 vs. cab underfoot 5) and execute them on different features (e.g., jumps vs. hips).",
          "videoTitle": "Is 100 Different Tricks In A Day Possible? (10K SUBSCRIBER SPECIAL!)"
        },
        {
          "id": "3pOhNvSJJAc-0",
          "text": "**Maintain a strong, balanced base with your knees forward and upper body hinged to avoid popping out of your effective range of motion, which improves snap and consistency.**",
          "videoTitle": "Improving Your Straight Airs"
        },
        {
          "id": "3pOhNvSJJAc-1",
          "text": "**Adopt a balanced stance with slight backward weight shift and a more upright upper body, ensuring you have 20% more room to squat and extend while actively pushing your legs into the snow for maximum power.**",
          "videoTitle": "Improving Your Straight Airs"
        }
      ]
    },
    {
      "theme": "balance-stance",
      "count": 18,
      "samples": [
        {
          "id": "egyYCMzpqu4-4",
          "text": "Choose a snowboard length that balances weight requirements with proper pressure points and angles, avoiding boards that are excessively long or narrow to ensure optimal maneuverability.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "Q6Iy-cWr58M-0",
          "text": "Find your ideal stance width by performing hops and squatting into a stable, comfortable \"stack position\" with weight on the balls of your feet, allowing your knees to track naturally over your feet.",
          "videoTitle": "How to Set Up Your Snowboard & Find Your Natural Stance – Pro Tips!"
        },
        {
          "id": "vavFASR0Cbc-0",
          "text": "**Maintain natural front arm positioning:** Keep your front arm extended slightly away from your body and avoid pulling it in too early to ensure balanced weight distribution.",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "JNWqEZg1OBM-4",
          "text": "Maintain a balanced, centered stance directly over your snowboard to navigate early season's unpredictable conditions.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "JNWqEZg1OBM-3",
          "text": "Maintain a balanced, over-the-board stance and look for softer snow to navigate icy patches without leaning, preventing falls.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        }
      ],
      "allRecords": [
        {
          "id": "egyYCMzpqu4-4",
          "text": "Choose a snowboard length that balances weight requirements with proper pressure points and angles, avoiding boards that are excessively long or narrow to ensure optimal maneuverability.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "Q6Iy-cWr58M-0",
          "text": "Find your ideal stance width by performing hops and squatting into a stable, comfortable \"stack position\" with weight on the balls of your feet, allowing your knees to track naturally over your feet.",
          "videoTitle": "How to Set Up Your Snowboard & Find Your Natural Stance – Pro Tips!"
        },
        {
          "id": "vavFASR0Cbc-0",
          "text": "**Maintain natural front arm positioning:** Keep your front arm extended slightly away from your body and avoid pulling it in too early to ensure balanced weight distribution.",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "JNWqEZg1OBM-4",
          "text": "Maintain a balanced, centered stance directly over your snowboard to navigate early season's unpredictable conditions.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "JNWqEZg1OBM-3",
          "text": "Maintain a balanced, over-the-board stance and look for softer snow to navigate icy patches without leaning, preventing falls.",
          "videoTitle": "Stop Slipping Out: How To Ride ICE With Confidence"
        },
        {
          "id": "3JJz0slua-4-2",
          "text": "**Avoid shifting all your weight to your back foot, especially on kicky features, as this can cause you to get bucked and slam face-first.**",
          "videoTitle": "Why These Snowboarding Crashes Happened!"
        },
        {
          "id": "8EmOM3PDK4I-0",
          "text": "**Strengthen your hips and lower back with \"good mornings\":** Stand with your front foot angled slightly in, back foot at 10% weight, then hinge at your hips while keeping your torso tall and extending your glute to feel a burn.",
          "videoTitle": "5 Snowboard Exercises I Do Every Day — Here's Why"
        },
        {
          "id": "L98xaOkYlCQ-3",
          "text": "**Maintain a strong, balanced stance with bent knees and a slight hip hinge, allowing your chin to naturally drop for optimal vision and control.**",
          "videoTitle": "This Makes Snowboarding Tricks Work – Ep 3"
        },
        {
          "id": "3JJz0slua-4-3",
          "text": "**After a pow slash, re-enter over your board with proper angle to maintain balance and ride away successfully.**",
          "videoTitle": "Why These Snowboarding Crashes Happened!"
        },
        {
          "id": "egyYCMzpqu4-2",
          "text": "**Dial in your stance:** Start with the reference stance and make minor adjustments; avoid extremes.\n*   **Wax your new board:** Apply 1-3 full wax jobs and scrapes before riding for better base protection and longevity.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "OhLO3H9oLy8-0",
          "text": "For this, I want you to enter your stack position a little bit more bent down. And then practice going and pushing your knees followed by your hips fo",
          "videoTitle": "10-Minute Snowboard Workout | 7 Key Exercises for Winter Strength"
        },
        {
          "id": "Q6Iy-cWr58M-1",
          "text": "Ensure your snowboard bindings are securely tightened with a good screwdriver from the start to prevent \"wishy-washy\" movement, stripped bolts, and the need for constant re-tightening.",
          "videoTitle": "How to Set Up Your Snowboard & Find Your Natural Stance – Pro Tips!"
        },
        {
          "id": "8EmOM3PDK4I-1",
          "text": "**Maintain a tight, activated core and stable posture throughout your range of motion exercises to improve control and balance on your snowboard.**",
          "videoTitle": "5 Snowboard Exercises I Do Every Day — Here's Why"
        },
        {
          "id": "QFjVq49lEJs-0",
          "text": "Avoid extremely narrow or wide stances and aggressive forward lean to maintain a full range of motion, protect your knees, and build foundational skills for larger tricks.",
          "videoTitle": "How To Choose Your Perfect Snowboard Stance! Every Stance in Action"
        },
        {
          "id": "vavFASR0Cbc-4",
          "text": "Ride with a more upright stance and adjust your setup to stay centered over your board for better control.",
          "videoTitle": "How I Self-Coach Snowboarding: Real-Time Study Sesh That Actually Worked"
        },
        {
          "id": "L98xaOkYlCQ-2",
          "text": "**Maintain a balanced stance on the balls of your feet throughout the descent, mirroring the leg action of a bounce.**",
          "videoTitle": "This Makes Snowboarding Tricks Work – Ep 3"
        },
        {
          "id": "qQDpPNw8MK8-1",
          "text": "Maintain a consistent center of balance while practicing full up-and-down movements, focusing on controlled, powerful, and confident execution.",
          "videoTitle": "The Foundation of All Snowboarding — Train This Off-Season!"
        },
        {
          "id": "Q6Iy-cWr58M-2",
          "text": "Determine your dominant foot for snowboarding by having a friend push you; the foot you step forward with is usually your natural stance.",
          "videoTitle": "How to Set Up Your Snowboard & Find Your Natural Stance – Pro Tips!"
        }
      ]
    },
    {
      "theme": "equipment-setup",
      "count": 16,
      "samples": [
        {
          "id": "WLq-Za-nDPU-0",
          "text": "Even after a break, you likely still know how to snowboard, but expect it to take a little time to get back into the rhythm.",
          "videoTitle": "POV: Whistler Opening Day - Is It Worth Riding Opening Week?"
        },
        {
          "id": "egyYCMzpqu4-3",
          "text": "For a versatile board that performs well in most conditions, opt for full camber; consider directional with some rocker for big mountain riding.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "UhQs6N2PzL0-0",
          "text": "Simplify complex tricks by mastering prerequisite movements and focusing on the unique challenges of the new trick, rather than worrying about fundamental skills you've already perfected.",
          "videoTitle": "My Snowboard Mental Training Advice!"
        },
        {
          "id": "hzBczFRMT60-3",
          "text": "Practice athletic movements and core principles from other sports like disc golf, tennis, or basketball in the off-season to improve your snowboarding.",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "hzBczFRMT60-2",
          "text": "**Practice disc golf throws to develop snowboarding timing, snap, and power with zero risk, and train your focus by concentrating on only two elements at a time.**",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        }
      ],
      "allRecords": [
        {
          "id": "WLq-Za-nDPU-0",
          "text": "Even after a break, you likely still know how to snowboard, but expect it to take a little time to get back into the rhythm.",
          "videoTitle": "POV: Whistler Opening Day - Is It Worth Riding Opening Week?"
        },
        {
          "id": "egyYCMzpqu4-3",
          "text": "For a versatile board that performs well in most conditions, opt for full camber; consider directional with some rocker for big mountain riding.",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "UhQs6N2PzL0-0",
          "text": "Simplify complex tricks by mastering prerequisite movements and focusing on the unique challenges of the new trick, rather than worrying about fundamental skills you've already perfected.",
          "videoTitle": "My Snowboard Mental Training Advice!"
        },
        {
          "id": "hzBczFRMT60-3",
          "text": "Practice athletic movements and core principles from other sports like disc golf, tennis, or basketball in the off-season to improve your snowboarding.",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "hzBczFRMT60-2",
          "text": "**Practice disc golf throws to develop snowboarding timing, snap, and power with zero risk, and train your focus by concentrating on only two elements at a time.**",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "8M1EPEs3Zl0-2",
          "text": "Focus on advanced rider fundamentals rather than simply riding down the mountain to progress beyond the intermediate plateau.",
          "videoTitle": "Snowboard Levels EXPLAINED (You Might Be Better Than You Think)"
        },
        {
          "id": "s86n54CfJfg-1",
          "text": "When falling, go with the momentum and avoid catching yourself with your hands to prevent wrist injuries.",
          "videoTitle": "Skiing vs Snowboarding – What’s REALLY Better?"
        },
        {
          "id": "irebk8cBAiw-4",
          "text": "**Practice falling safely by rolling onto your back, not by sticking out your limbs, and master controlled bounces, avoiding overextension, as these are crucial foundations for trampoline snowboarding training.**",
          "videoTitle": "Trampoline Basics for Snowboarders | Learn to Tramp Like a Pro – Ep. 1"
        },
        {
          "id": "jmEhkaCK_EY-2",
          "text": "Here I make the connection and just snap it a little bit slower. Like uh notice how I'm not throwing back. I'm not over snapping. It's just up in a re",
          "videoTitle": "Breaking Down My Snowboarding🏂"
        },
        {
          "id": "m9mcgAfGeRk-1",
          "text": "Something like an ion is too stiff for me to enjoy. Anything like riding powder or just having a fun time on a mountain, I'm in too much pain to do so",
          "videoTitle": "Snowboard Boot Guide: How To Find The Perfect Fit!"
        },
        {
          "id": "m9mcgAfGeRk-3",
          "text": "Then personally, I keep my liners pretty loose. If I tighten these max, my feet fall asleep pretty quick. So, I like that a little bit looser. And the",
          "videoTitle": "Snowboard Boot Guide: How To Find The Perfect Fit!"
        },
        {
          "id": "egyYCMzpqu4-1",
          "text": "**Choose the narrow version of your snowboard if you wear boot sizes 7-10.**",
          "videoTitle": "The Simplest Snowboard Buying Guide (No BS, No Sponsers)"
        },
        {
          "id": "hzBczFRMT60-4",
          "text": "To accelerate snowboarding progress, practice the sport year-round by engaging in \"disco\" (a low-risk activity that mirrors snowboarding's core principles) during the off-season.",
          "videoTitle": "Why Playing DiscGolf Can Improve Your Snowboarding"
        },
        {
          "id": "s86n54CfJfg-0",
          "text": "Focus on mastering fundamental snowboarding principles, as dedicated practice can lead to rapid improvement comparable to skiing, with upcoming video resources designed to accelerate this learning process.",
          "videoTitle": "Skiing vs Snowboarding – What’s REALLY Better?"
        },
        {
          "id": "qQDpPNw8MK8-2",
          "text": "Maintain pressure on the balls of your feet for better control and responsiveness, allowing for quick, explosive movements.",
          "videoTitle": "The Foundation of All Snowboarding — Train This Off-Season!"
        },
        {
          "id": "UhQs6N2PzL0-4",
          "text": "Visualize the trick's motion from different perspectives to understand the mechanics and the feeling of the movement before practicing it.",
          "videoTitle": "My Snowboard Mental Training Advice!"
        }
      ]
    },
    {
      "theme": "rails-boxes",
      "count": 13,
      "samples": [
        {
          "id": "ooz5KRJNRVg-2",
          "text": "Square your shoulders to the rail and practice stepping onto the feature by riding off your tail, like taking a single step onto a staircase.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "jmEhkaCK_EY-0",
          "text": "This makes it so I can go and get onto the rail with very minimal movement. And see how my upper body is hardly changing in angle at all. And then sin",
          "videoTitle": "Breaking Down My Snowboarding🏂"
        },
        {
          "id": "C9WmozVndGs-2",
          "text": "Focus on a stable takeoff position and maintaining it throughout your approach and contact with the rail; avoid readjusting balance mid-air or on the rail.",
          "videoTitle": "The Technique Pros Use for Effortless Rails"
        },
        {
          "id": "DKdb2AhopaE-0",
          "text": "**For spins, keep your spotting point under your armpit for better rotation and control, and for rails, maintain a stacked, bent-leg position for stability and shock absorption.**",
          "videoTitle": "10 Park Tips I Wish I Knew Sooner!"
        },
        {
          "id": "C9WmozVndGs-1",
          "text": "Initiate rail transfers with a small, calf-driven \"micro pop\" and a slight shift of weight to your back foot for an athletic stance that allows independent leg movement.",
          "videoTitle": "The Technique Pros Use for Effortless Rails"
        }
      ],
      "allRecords": [
        {
          "id": "ooz5KRJNRVg-2",
          "text": "Square your shoulders to the rail and practice stepping onto the feature by riding off your tail, like taking a single step onto a staircase.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "jmEhkaCK_EY-0",
          "text": "This makes it so I can go and get onto the rail with very minimal movement. And see how my upper body is hardly changing in angle at all. And then sin",
          "videoTitle": "Breaking Down My Snowboarding🏂"
        },
        {
          "id": "C9WmozVndGs-2",
          "text": "Focus on a stable takeoff position and maintaining it throughout your approach and contact with the rail; avoid readjusting balance mid-air or on the rail.",
          "videoTitle": "The Technique Pros Use for Effortless Rails"
        },
        {
          "id": "DKdb2AhopaE-0",
          "text": "**For spins, keep your spotting point under your armpit for better rotation and control, and for rails, maintain a stacked, bent-leg position for stability and shock absorption.**",
          "videoTitle": "10 Park Tips I Wish I Knew Sooner!"
        },
        {
          "id": "C9WmozVndGs-1",
          "text": "Initiate rail transfers with a small, calf-driven \"micro pop\" and a slight shift of weight to your back foot for an athletic stance that allows independent leg movement.",
          "videoTitle": "The Technique Pros Use for Effortless Rails"
        },
        {
          "id": "8qMKoqKxKOQ-0",
          "text": "**Maintain a \"stack position\" over your board by keeping your weight balanced over the balls of your feet, allowing for controlled movement and stability on rails.**",
          "videoTitle": "The “CRUCIAL” Techniques Pros Use On Every Rail In The Park"
        },
        {
          "id": "ghyr9ohkY8M-3",
          "text": "**Minimize body movement on rails:** Stay low and in a consistent, stable position to maintain control and maximize your rail potential.",
          "videoTitle": "10 Park Tips Every Snowboarder Should Know!"
        },
        {
          "id": "ooz5KRJNRVg-1",
          "text": "Maintain a stationary head and look towards the end of the rail, keeping your upper body hinged forward to stay balanced and avoid rounding your spine.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "XL8wJf62tCc-0",
          "text": "Improve rail riding by increasing speed and focusing on comfort with features rather than attempting advanced tricks prematurely.",
          "videoTitle": "I Made These Mistakes So You Don’t Have To! - EP 1"
        },
        {
          "id": "ghyr9ohkY8M-4",
          "text": "**Look through the end of the rail, not just at it, to maintain control and power through your exit.**",
          "videoTitle": "10 Park Tips Every Snowboarder Should Know!"
        },
        {
          "id": "J5e7gehiepo-1",
          "text": "**Pop and extend your upper body tall to get onto and over the rail.**",
          "videoTitle": "How ZEB POWELL Does The IMPOSSIBLE!!!"
        },
        {
          "id": "ooz5KRJNRVg-0",
          "text": "Maintain a strong, tall back by keeping your \"nipples over your knees\" to center your balance over your feet during slides, avoiding a rounded spine and heeling out.",
          "videoTitle": "The Key Principles Behind FS-BS And How To Train Them! (No Snow Or Gear Needed)"
        },
        {
          "id": "nkwk__n1k10-1",
          "text": "**Maintain a stable, stationary head position, like a steadycam, to stay connected and in control while on rails or boxes.**",
          "videoTitle": "8 Simple Rail Tips That Make a Huge Difference!"
        }
      ]
    },
    {
      "theme": "mental-progression",
      "count": 5,
      "samples": [
        {
          "id": "ggCtcSsjCRQ-2",
          "text": "**Maintain a forward head position throughout the trick, rotating your head with your body, not independently, to improve stability and execution, especially in slushy conditions.**",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "PY-evSBr4Zo-0",
          "text": "**Focus on progression and learning:** The transcript highlights the importance of effort, practice, and celebrating small wins, even when attempts aren't perfect, to build confidence and improve skil",
          "videoTitle": "This Is What Progression Really Looks Like!"
        },
        {
          "id": "w7Zg-hVrmp0-2",
          "text": "**Master progressive tricks:** Successfully execute a challenging front three nose butter trick 17 switch and a hardway cow on, then attempt a cab fiverr and bat seven, followed by a cat one, swap one",
          "videoTitle": "Is 100 Different Tricks In A Day Possible? (10K SUBSCRIBER SPECIAL!)"
        },
        {
          "id": "QzLIvay6lcs-0",
          "text": "**Embrace risk and seize opportunities:** Don't let fear hold you back; take chances to achieve your dreams and explore new possibilities.",
          "videoTitle": "What 14 Years Of Freestyle Progression Looks Like!"
        },
        {
          "id": "ggCtcSsjCRQ-4",
          "text": "Maintain forward momentum and keep your eyes on your intended path, looking ahead towards where you want to go, until your hand naturally releases from the feature.",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        }
      ],
      "allRecords": [
        {
          "id": "ggCtcSsjCRQ-2",
          "text": "**Maintain a forward head position throughout the trick, rotating your head with your body, not independently, to improve stability and execution, especially in slushy conditions.**",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        },
        {
          "id": "PY-evSBr4Zo-0",
          "text": "**Focus on progression and learning:** The transcript highlights the importance of effort, practice, and celebrating small wins, even when attempts aren't perfect, to build confidence and improve skills over time.",
          "videoTitle": "This Is What Progression Really Looks Like!"
        },
        {
          "id": "w7Zg-hVrmp0-2",
          "text": "**Master progressive tricks:** Successfully execute a challenging front three nose butter trick 17 switch and a hardway cow on, then attempt a cab fiverr and bat seven, followed by a cat one, swap one.",
          "videoTitle": "Is 100 Different Tricks In A Day Possible? (10K SUBSCRIBER SPECIAL!)"
        },
        {
          "id": "QzLIvay6lcs-0",
          "text": "**Embrace risk and seize opportunities:** Don't let fear hold you back; take chances to achieve your dreams and explore new possibilities.",
          "videoTitle": "What 14 Years Of Freestyle Progression Looks Like!"
        },
        {
          "id": "ggCtcSsjCRQ-4",
          "text": "Maintain forward momentum and keep your eyes on your intended path, looking ahead towards where you want to go, until your hand naturally releases from the feature.",
          "videoTitle": "The 1# Trick You Should Learn This Spring!"
        }
      ]
    },
    {
      "theme": "general-tips",
      "count": 1,
      "samples": [
        {
          "id": "WLq-Za-nDPU-2",
          "text": "**Be cautious when venturing off-piste as snow cover is currently thin.**",
          "videoTitle": "POV: Whistler Opening Day - Is It Worth Riding Opening Week?"
        }
      ],
      "allRecords": [
        {
          "id": "WLq-Za-nDPU-2",
          "text": "**Be cautious when venturing off-piste as snow cover is currently thin.**",
          "videoTitle": "POV: Whistler Opening Day - Is It Worth Riding Opening Week?"
        }
      ]
    },
    {
      "theme": "common-problems",
      "count": 1,
      "samples": [
        {
          "id": "J9AqhLkqSUw-3",
          "text": "For a wild cat, jam your hips forward and lift your chest while keeping your head connected to your shoulder, avoiding a neck crunch.",
          "videoTitle": "I Made These Mistakes So You Don't Have To! - EP 5"
        }
      ],
      "allRecords": [
        {
          "id": "J9AqhLkqSUw-3",
          "text": "For a wild cat, jam your hips forward and lift your chest while keeping your head connected to your shoulder, avoiding a neck crunch.",
          "videoTitle": "I Made These Mistakes So You Don't Have To! - EP 5"
        }
      ]
    }
  ]
}