[
  {
    "id": "test-001_0",
    "videoId": "test-001",
    "videoTitle": "How to Backside 180",
    "text": "Hey everyone, today we're going to learn the backside 180. This is one of the most fundamental tricks in snowboarding. First, you want to make sure you're comfortable riding switch. Approach the jump with a medium speed, not too fast. As you hit the lip, start winding up your shoulders. Pop off the jump and rotate your upper body. Your lower body will follow naturally. Spot your landing early, this is crucial. Land with your knees bent to absorb the impact. And ride away switch! That's the backside 180.",
    "timestamp": 0,
    "duration": 31.5,
    "topics": []
  },
  {
    "id": "test-002_0",
    "videoId": "test-002",
    "videoTitle": "Carving Fundamentals",
    "text": "Carving is the foundation of good snowboarding. It's all about edge control and weight distribution. Start on a gentle slope to practice. Shift your weight to your toes for a toeside carve. You should feel the edge biting into the snow. Keep your body aligned over the board. For heelside, shift your weight back to your heels. Practice linking these turns together smoothly. The key is to be patient and let the board do the work.",
    "timestamp": 0,
    "duration": 28,
    "topics": []
  },
  {
    "id": "test-003_0",
    "videoId": "test-003",
    "videoTitle": "Frontside 360 Tutorial",
    "text": "The frontside 360 is a progression from the frontside 180. Make sure you're comfortable with 180s first. You'll need a bit more speed for this trick. Wind up your shoulders even more than a 180. Pop hard off the lip and commit to the rotation. Keep your head turning to spot the landing. You'll be blind for a moment, that's normal. As you come around, spot your landing. Stomp it and ride away! Practice makes perfect.",
    "timestamp": 0,
    "duration": 29,
    "topics": []
  },
  {
    "id": "test-004_0",
    "videoId": "test-004",
    "videoTitle": "Edge Control Basics",
    "text": "Edge control is everything in snowboarding. Without good edge control, you can't progress. Start by practicing on flat ground. Rock back and forth between your edges. Feel how the board responds to your weight shifts. Now try it while moving slowly. Make small adjustments with your ankles and knees. This muscle memory will help with everything else.",
    "timestamp": 0,
    "duration": 24.5,
    "topics": []
  },
  {
    "id": "test-005_0",
    "videoId": "test-005",
    "videoTitle": "Common Mistakes When Learning Tricks",
    "text": "Let's talk about common mistakes beginners make. The biggest one is not committing to the rotation. If you hesitate mid-air, you'll land off-balance. Another mistake is looking down at your board. Always look where you want to go, not at your feet. Also, don't forget to pop! Many people just ride off the jump. You need that upward momentum to complete rotations. And finally, practice on smaller features first.",
    "timestamp": 0,
    "duration": 27.5,
    "topics": []
  }
]