{
  "videoId": "JNWqEZg1OBM",
  "title": "Stop Slipping Out: How To Ride ICE With Confidence",
  "transcript": [
    {
      "text": "It's a beautiful early season day, but because \nit's early season, there's some pretty sketchy",
      "offset": 0,
      "duration": 0,
      "timestamp": "0:00"
    },
    {
      "text": "conditions and sketchy sessions. So, in this \nvideo, I'm I'm going to teach you how to ride",
      "offset": 5,
      "duration": 0,
      "timestamp": "0:05"
    },
    {
      "text": "early season conditions, how to deal with the \nsketch, and what to look out for. I'm going to",
      "offset": 11,
      "duration": 0,
      "timestamp": "0:11"
    },
    {
      "text": "use this run to explain the three principles I \nbase my early season riding around. And that's",
      "offset": 16,
      "duration": 0,
      "timestamp": "0:16"
    },
    {
      "text": "bean stack over top of a snowboard. Making sure \nI'm not leaning in one direction or the other.",
      "offset": 21,
      "duration": 0,
      "timestamp": "0:21"
    },
    {
      "text": "Because there's a lot of warm weather, there's \na bunch of chunks. There's going to be sections",
      "offset": 28,
      "duration": 0,
      "timestamp": "0:28"
    },
    {
      "text": "of ice that no matter how good your form is, no \nmatter how good of a snowboarder you are, you're",
      "offset": 32,
      "duration": 0,
      "timestamp": "0:32"
    },
    {
      "text": "not going to be able to hold an edge through \nthem. Right now, it's a decent top section,",
      "offset": 36,
      "duration": 0,
      "timestamp": "0:36"
    },
    {
      "text": "but as we get lower where it's been more melted, \nit's going to get harder and harder. So, the most",
      "offset": 40,
      "duration": 0,
      "timestamp": "0:40"
    },
    {
      "text": "important thing is to go and keep ourselves \ncompressed over top of our snowboards. And",
      "offset": 45,
      "duration": 0,
      "timestamp": "0:45"
    },
    {
      "text": "this is going to make us more stable and able to \nhandle little icy sections if they come at us. And",
      "offset": 51,
      "duration": 0,
      "timestamp": "0:51"
    },
    {
      "text": "then the next thing we want to do is really look \nwhere we're going. Watching where we're going is",
      "offset": 57,
      "duration": 0,
      "timestamp": "0:57"
    },
    {
      "text": "so key because there's going to be good sections \nof snow and bad sections of snow. So like here",
      "offset": 63,
      "duration": 0,
      "timestamp": "1:03"
    },
    {
      "text": "there's a little bit of fluff. It's decent. Not \ntoo bad. So like this actually looks pretty sick.",
      "offset": 68,
      "duration": 0,
      "timestamp": "1:08"
    },
    {
      "text": "and we can launch it. Knowing that there's some \nbumps afterwards. So, planning out your turns,",
      "offset": 73,
      "duration": 0,
      "timestamp": "1:13"
    },
    {
      "text": "where to carve, where to slow down, where you \ncan set an edge is so important during this time",
      "offset": 79,
      "duration": 0,
      "timestamp": "1:19"
    },
    {
      "text": "of season. So, like now that we're in a mogul \nfield, planning is going to be so important.",
      "offset": 85,
      "duration": 0,
      "timestamp": "1:25"
    },
    {
      "text": "And you're going to see a lot of mogul fields \nlike this at the start of the year. And you'll",
      "offset": 91,
      "duration": 0,
      "timestamp": "1:31"
    },
    {
      "text": "notice through the actual mogul themselves, it's \nso icy. I can't hold an edge. Even traversing,",
      "offset": 95,
      "duration": 0,
      "timestamp": "1:35"
    },
    {
      "text": "I'm absolutely getting wrecked. But when I look \nat these, I can see that there's more snow to the",
      "offset": 101,
      "duration": 0,
      "timestamp": "1:41"
    },
    {
      "text": "left and there's more snow on top. Like that's \na very normal fall. Like here, I'm just going",
      "offset": 107,
      "duration": 0,
      "timestamp": "1:47"
    },
    {
      "text": "to want to go across actually sliding across the \ntops of a mobile field because there's a little",
      "offset": 114,
      "duration": 0,
      "timestamp": "1:54"
    },
    {
      "text": "less ice while keeping myself stacked over top of \na board, planning and looking for a good section",
      "offset": 120,
      "duration": 0,
      "timestamp": "2:00"
    },
    {
      "text": "to go and slow down. No matter how good you are, \nthis is going to be hard to ride through. And now",
      "offset": 126,
      "duration": 0,
      "timestamp": "2:06"
    },
    {
      "text": "that I see it's clear, there's good snow ahead. \nI can just bomb and charge through. Stay flat",
      "offset": 133,
      "duration": 0,
      "timestamp": "2:13"
    },
    {
      "text": "face. And now I'm looking for a soft patch of \nsnow. I'm going to go and slow down using it.",
      "offset": 138,
      "duration": 0,
      "timestamp": "2:18"
    },
    {
      "text": "And the last thing is we want to keep oursel low \nin our snowboard, but with proper body mechanics.",
      "offset": 145,
      "duration": 0,
      "timestamp": "2:25"
    },
    {
      "text": "A lot of people when they hear, \"Oh, belowing a \nsnowboard,\" they think, \"Get down. Get completely",
      "offset": 152,
      "duration": 0,
      "timestamp": "2:32"
    },
    {
      "text": "squared.\" Well, demo in the deck. This is just \nsome rocky terrain. I took decide to come on here.",
      "offset": 158,
      "duration": 0,
      "timestamp": "2:38"
    },
    {
      "text": "This is going to be a little bonus section just on \nthe importance of good form and how you actually",
      "offset": 163,
      "duration": 0,
      "timestamp": "2:43"
    },
    {
      "text": "want to use this position to load powerful because \nit's going to make things so much easier. So,",
      "offset": 171,
      "duration": 0,
      "timestamp": "2:51"
    },
    {
      "text": "first of all, I want to say this form is what \nI use for pretty much everything. jumping,",
      "offset": 177,
      "duration": 0,
      "timestamp": "2:57"
    },
    {
      "text": "it naturally sets you up. Carving, it lets \nyou get you lower and it's just going to be a",
      "offset": 181,
      "duration": 0,
      "timestamp": "3:01"
    },
    {
      "text": "really powerful building block that will actually \ntake you to the next level of snowboarding. It's",
      "offset": 186,
      "duration": 0,
      "timestamp": "3:06"
    },
    {
      "text": "flexible and best done with other movements, but \nwoohoo, it's really what you want to think about",
      "offset": 191,
      "duration": 0,
      "timestamp": "3:11"
    },
    {
      "text": "and ground yourself over. A lot of people think \nthat this is the strong position, squared in the",
      "offset": 197,
      "duration": 0,
      "timestamp": "3:17"
    },
    {
      "text": "board, and when I squat, I keep my chest up and \nsquat down, but this is going to make me fall",
      "offset": 202,
      "duration": 0,
      "timestamp": "3:22"
    },
    {
      "text": "back because it relies on leaning. And when it's \nicy, we really don't want to be leaning. There's",
      "offset": 207,
      "duration": 0,
      "timestamp": "3:27"
    },
    {
      "text": "actually three motions that go into doing a proper \nlow down squat position that will let you utilize",
      "offset": 212,
      "duration": 0,
      "timestamp": "3:32"
    },
    {
      "text": "your turn. First is a little bit of opening of \nthe hips. When we're squared, it's going to be",
      "offset": 217,
      "duration": 0,
      "timestamp": "3:37"
    },
    {
      "text": "restricted and it's going to be tough to expand \nour body. But as soon as we open our hips a bit,",
      "offset": 221,
      "duration": 0,
      "timestamp": "3:41"
    },
    {
      "text": "it now lets us drop our weight. We'll stay \nin more over top of our snowboard. The next",
      "offset": 225,
      "duration": 0,
      "timestamp": "3:45"
    },
    {
      "text": "part is instead of keeping the spine straight, \nwhat's going to make it so as we squat down,",
      "offset": 229,
      "duration": 0,
      "timestamp": "3:49"
    },
    {
      "text": "our weight shifts more and more to the heels, \nwhat will make us lean. Instead, we want to have",
      "offset": 233,
      "duration": 0,
      "timestamp": "3:53"
    },
    {
      "text": "our hips back and a little bit of hinge forward. \nSo that way now when we squat down, we're really",
      "offset": 237,
      "duration": 0,
      "timestamp": "3:57"
    },
    {
      "text": "loading our weight onto it. And then the last \nthing is doing all these motions in correlation.",
      "offset": 242,
      "duration": 0,
      "timestamp": "4:02"
    },
    {
      "text": "So the more I want to get onto that edge, the more \nI can open my hips, the more I can drop my body,",
      "offset": 248,
      "duration": 0,
      "timestamp": "4:08"
    },
    {
      "text": "the more I need to pull out my hips. That's moving \nwith all three of these movements in correlation.",
      "offset": 252,
      "duration": 0,
      "timestamp": "4:12"
    },
    {
      "text": "That's let you really load an edge and lock in. \nAnd that's going to be really important when",
      "offset": 257,
      "duration": 0,
      "timestamp": "4:17"
    },
    {
      "text": "carving in these really icy conditions because \nif we try to push out and lean, as soon as we",
      "offset": 262,
      "duration": 0,
      "timestamp": "4:22"
    },
    {
      "text": "hit ice, we're going to slip out. So, open the \nhips, pull them back, drop the upper body forward,",
      "offset": 266,
      "duration": 0,
      "timestamp": "4:26"
    },
    {
      "text": "chest over the knees, and that way when you squat \ndown, it will expand into this motion, loading so",
      "offset": 272,
      "duration": 0,
      "timestamp": "4:32"
    },
    {
      "text": "much pressure onto that edge while keeping your \nweight still over set your board. And I personally",
      "offset": 277,
      "duration": 0,
      "timestamp": "4:37"
    },
    {
      "text": "like letting my hips shift back a little bit. You \ncan have your hips forward if you want to do like",
      "offset": 281,
      "duration": 0,
      "timestamp": "4:41"
    },
    {
      "text": "faster turns, but I like a little bit of set back \nweight because I do a lot of jumping and a lot of",
      "offset": 285,
      "duration": 0,
      "timestamp": "4:45"
    },
    {
      "text": "alling. And when you're like back centered and \nyou do a jump, both feet. But when you do this",
      "offset": 290,
      "duration": 0,
      "timestamp": "4:50"
    },
    {
      "text": "position, upper body forward, hits back, and you \ndo a jump, it naturally is you off the tail and",
      "offset": 295,
      "duration": 0,
      "timestamp": "4:55"
    },
    {
      "text": "pulls you to the nose. So, I just like it as the \nbase of all my snowboarding. I'm going to make",
      "offset": 300,
      "duration": 0,
      "timestamp": "5:00"
    },
    {
      "text": "more videos on this, but I just figured it's \nimportant context for the rest of this video.",
      "offset": 304,
      "duration": 0,
      "timestamp": "5:04"
    },
    {
      "text": "So, that's what I'm talking about. Some ice \nis just too icy to stand on. There I was just",
      "offset": 311,
      "duration": 0,
      "timestamp": "5:11"
    },
    {
      "text": "putting on my mitt and got taken out. So it can \nget you if you're not aware for it. And that's",
      "offset": 316,
      "duration": 0,
      "timestamp": "5:16"
    },
    {
      "text": "where like early season like people are getting \nbiffed on this ice patch. So that's why we want to",
      "offset": 321,
      "duration": 0,
      "timestamp": "5:21"
    },
    {
      "text": "make sure our stance is like over so we can like \ntackle it without relying on leaning. As soon as",
      "offset": 328,
      "duration": 0,
      "timestamp": "5:28"
    },
    {
      "text": "you're leaning back on one of these slopes, you're \ngoing to be boned. So last lap I explained the",
      "offset": 332,
      "duration": 0,
      "timestamp": "5:32"
    },
    {
      "text": "three principles. We want to be over top of our \nboard. We don't want to be setting our edge by",
      "offset": 337,
      "duration": 0,
      "timestamp": "5:37"
    },
    {
      "text": "leaning. And we want to be watching where we're \ngoing and planning our turns. And in this run,",
      "offset": 341,
      "duration": 0,
      "timestamp": "5:41"
    },
    {
      "text": "I'm going to go and demonstrate how I use them. \nSo Alli's vigilant, Allie's watching. Here,",
      "offset": 346,
      "duration": 0,
      "timestamp": "5:46"
    },
    {
      "text": "there's a little more snow, less traction, so \nwe're able to go and hold an edge and actually",
      "offset": 351,
      "duration": 0,
      "timestamp": "5:51"
    },
    {
      "text": "feel more comfortable on our board. The sideburn, \nnot going to be nearly as queued out. When we're",
      "offset": 357,
      "duration": 0,
      "timestamp": "5:57"
    },
    {
      "text": "going through here, we want to go and look for \nthose soft patches of snow while keeping stack.",
      "offset": 362,
      "duration": 0,
      "timestamp": "6:02"
    },
    {
      "text": "And the thing that makes this position work is \nshifting your hips slightly to the back foot and",
      "offset": 367,
      "duration": 0,
      "timestamp": "6:07"
    },
    {
      "text": "the upper body over. This lets me go and get \na lot lower. And from here, if I do slip out,",
      "offset": 371,
      "duration": 0,
      "timestamp": "6:11"
    },
    {
      "text": "I'm going to slip out onto my bum instead of \nlike falling. When we get into the mogul field,",
      "offset": 377,
      "duration": 0,
      "timestamp": "6:17"
    },
    {
      "text": "this is going to be more important. And because \nwe're shifted back, it's going to let us move",
      "offset": 383,
      "duration": 0,
      "timestamp": "6:23"
    },
    {
      "text": "our legs really independently to our upper \nbody. And this is going to give us that micro",
      "offset": 386,
      "duration": 0,
      "timestamp": "6:26"
    },
    {
      "text": "control. So if we feel like we're slipping \nout here, we can adjust it really easily.",
      "offset": 390,
      "duration": 0,
      "timestamp": "6:30"
    },
    {
      "text": "So, notice how my upper body's forward, hips \nback, and now I'm able to squat low while",
      "offset": 395,
      "duration": 0,
      "timestamp": "6:35"
    },
    {
      "text": "keeping myself over top of my board. Holding \nthat forever is going to be really tiring. So,",
      "offset": 401,
      "duration": 0,
      "timestamp": "6:41"
    },
    {
      "text": "we want to go and fluctuate in the good snow, we \ncan relax it, calm it, and then as it gets worse,",
      "offset": 407,
      "duration": 0,
      "timestamp": "6:47"
    },
    {
      "text": "we want to crouch it down. And this is \nactually the same position we want for jumping.",
      "offset": 414,
      "duration": 0,
      "timestamp": "6:54"
    },
    {
      "text": "Now we're getting to a little bit of a steeper \nsection and so it's going to be more icy like here",
      "offset": 421,
      "duration": 0,
      "timestamp": "7:01"
    },
    {
      "text": "completely sheer ice and it's bumpy afterwards. \nSo planning is going to be really important. I'm",
      "offset": 426,
      "duration": 0,
      "timestamp": "7:06"
    },
    {
      "text": "going plan going to a right side ice match here \nflat base. Slow down. And now I can straight bomb",
      "offset": 431,
      "duration": 0,
      "timestamp": "7:11"
    },
    {
      "text": "through here because I see the smells good. \nDepending on the lighting, this is going to",
      "offset": 437,
      "duration": 0,
      "timestamp": "7:17"
    },
    {
      "text": "be a lot harder. And that's why bad lighting \nand bad ice are the double combo that really",
      "offset": 441,
      "duration": 0,
      "timestamp": "7:21"
    },
    {
      "text": "makes snowboarding tricky, no matter how good you \nare. We're getting into a mogul field and this is",
      "offset": 446,
      "duration": 0,
      "timestamp": "7:26"
    },
    {
      "text": "perfect for what I'm trying to demonstrate. Way \ntoo icy throughout the sections. I can't hold an",
      "offset": 453,
      "duration": 0,
      "timestamp": "7:33"
    },
    {
      "text": "edge at all. This is a sketchy situation. Let me \ngo and demonstrate first how to get up if you fall",
      "offset": 458,
      "duration": 0,
      "timestamp": "7:38"
    },
    {
      "text": "because falling is going to happen when you're on \nice like this. So, if I fall here and get slipping",
      "offset": 464,
      "duration": 0,
      "timestamp": "7:44"
    },
    {
      "text": "on my bum, I don't want to try jar my legs forward \nto stop it. Here, it's working because it's not so",
      "offset": 471,
      "duration": 0,
      "timestamp": "7:51"
    },
    {
      "text": "steep. I actually want to pull my legs into me \nlike this. So, I'm on my back and I'm pulling",
      "offset": 476,
      "duration": 0,
      "timestamp": "7:56"
    },
    {
      "text": "my legs into me. So, I'm in this strong position \nhere. And that's going to let me absorb it. Like",
      "offset": 482,
      "duration": 0,
      "timestamp": "8:02"
    },
    {
      "text": "here, I can really dig in my foot. I can use my \nhands. That's going to let me control it. And",
      "offset": 487,
      "duration": 0,
      "timestamp": "8:07"
    },
    {
      "text": "that's why we want to be a little more crouched \ndown when we think we could be falling so we don't",
      "offset": 493,
      "duration": 0,
      "timestamp": "8:13"
    },
    {
      "text": "get the wind shook out of us and slam and need to \nnavigate. Now just keeping my board, keeping over",
      "offset": 497,
      "duration": 0,
      "timestamp": "8:17"
    },
    {
      "text": "top of my board, watching where I'm going. And \nthe important thing here is like ride for what",
      "offset": 504,
      "duration": 0,
      "timestamp": "8:24"
    },
    {
      "text": "the conditions offer. I'd love to lay some really \nlong turns, but instead I got to stay stacked,",
      "offset": 513,
      "duration": 0,
      "timestamp": "8:33"
    },
    {
      "text": "control speed, put my weight really solid over \ntop of my board by pulling my upper body forward,",
      "offset": 519,
      "duration": 0,
      "timestamp": "8:39"
    },
    {
      "text": "shifting the hips back, and that's going to \nlet me navigate this terrain a lot easier",
      "offset": 526,
      "duration": 0,
      "timestamp": "8:46"
    },
    {
      "text": "and being safe this early season. That's \nthe most important thing. This is the time",
      "offset": 534,
      "duration": 0,
      "timestamp": "8:54"
    },
    {
      "text": "of year where you can get hurt and get \nbucked for absolutely no good reason. So,",
      "offset": 538,
      "duration": 0,
      "timestamp": "8:58"
    },
    {
      "text": "you want to go live by these same principles. \nLook where you're going. Don't lean away from",
      "offset": 543,
      "duration": 0,
      "timestamp": "9:03"
    },
    {
      "text": "your snowboard. And lead the turns through weight \nshifting instead of going and putting yourself in",
      "offset": 549,
      "duration": 0,
      "timestamp": "9:09"
    },
    {
      "text": "a compromised space. Oh my god. And don't lower \nyour guard. If you do that, you should be able",
      "offset": 555,
      "duration": 0,
      "timestamp": "9:15"
    },
    {
      "text": "to navigate bad terrain and the early season \nwith relative ease. Relative is a key word",
      "offset": 562,
      "duration": 0,
      "timestamp": "9:22"
    }
  ],
  "fullText": "It's a beautiful early season day, but because \nit's early season, there's some pretty sketchy conditions and sketchy sessions. So, in this \nvideo, I'm I'm going to teach you how to ride early season conditions, how to deal with the \nsketch, and what to look out for. I'm going to use this run to explain the three principles I \nbase my early season riding around. And that's bean stack over top of a snowboard. Making sure \nI'm not leaning in one direction or the other. Because there's a lot of warm weather, there's \na bunch of chunks. There's going to be sections of ice that no matter how good your form is, no \nmatter how good of a snowboarder you are, you're not going to be able to hold an edge through \nthem. Right now, it's a decent top section, but as we get lower where it's been more melted, \nit's going to get harder and harder. So, the most important thing is to go and keep ourselves \ncompressed over top of our snowboards. And this is going to make us more stable and able to \nhandle little icy sections if they come at us. And then the next thing we want to do is really look \nwhere we're going. Watching where we're going is so key because there's going to be good sections \nof snow and bad sections of snow. So like here there's a little bit of fluff. It's decent. Not \ntoo bad. So like this actually looks pretty sick. and we can launch it. Knowing that there's some \nbumps afterwards. So, planning out your turns, where to carve, where to slow down, where you \ncan set an edge is so important during this time of season. So, like now that we're in a mogul \nfield, planning is going to be so important. And you're going to see a lot of mogul fields \nlike this at the start of the year. And you'll notice through the actual mogul themselves, it's \nso icy. I can't hold an edge. Even traversing, I'm absolutely getting wrecked. But when I look \nat these, I can see that there's more snow to the left and there's more snow on top. Like that's \na very normal fall. Like here, I'm just going to want to go across actually sliding across the \ntops of a mobile field because there's a little less ice while keeping myself stacked over top of \na board, planning and looking for a good section to go and slow down. No matter how good you are, \nthis is going to be hard to ride through. And now that I see it's clear, there's good snow ahead. \nI can just bomb and charge through. Stay flat face. And now I'm looking for a soft patch of \nsnow. I'm going to go and slow down using it. And the last thing is we want to keep oursel low \nin our snowboard, but with proper body mechanics. A lot of people when they hear, \"Oh, belowing a \nsnowboard,\" they think, \"Get down. Get completely squared.\" Well, demo in the deck. This is just \nsome rocky terrain. I took decide to come on here. This is going to be a little bonus section just on \nthe importance of good form and how you actually want to use this position to load powerful because \nit's going to make things so much easier. So, first of all, I want to say this form is what \nI use for pretty much everything. jumping, it naturally sets you up. Carving, it lets \nyou get you lower and it's just going to be a really powerful building block that will actually \ntake you to the next level of snowboarding. It's flexible and best done with other movements, but \nwoohoo, it's really what you want to think about and ground yourself over. A lot of people think \nthat this is the strong position, squared in the board, and when I squat, I keep my chest up and \nsquat down, but this is going to make me fall back because it relies on leaning. And when it's \nicy, we really don't want to be leaning. There's actually three motions that go into doing a proper \nlow down squat position that will let you utilize your turn. First is a little bit of opening of \nthe hips. When we're squared, it's going to be restricted and it's going to be tough to expand \nour body. But as soon as we open our hips a bit, it now lets us drop our weight. We'll stay \nin more over top of our snowboard. The next part is instead of keeping the spine straight, \nwhat's going to make it so as we squat down, our weight shifts more and more to the heels, \nwhat will make us lean. Instead, we want to have our hips back and a little bit of hinge forward. \nSo that way now when we squat down, we're really loading our weight onto it. And then the last \nthing is doing all these motions in correlation. So the more I want to get onto that edge, the more \nI can open my hips, the more I can drop my body, the more I need to pull out my hips. That's moving \nwith all three of these movements in correlation. That's let you really load an edge and lock in. \nAnd that's going to be really important when carving in these really icy conditions because \nif we try to push out and lean, as soon as we hit ice, we're going to slip out. So, open the \nhips, pull them back, drop the upper body forward, chest over the knees, and that way when you squat \ndown, it will expand into this motion, loading so much pressure onto that edge while keeping your \nweight still over set your board. And I personally like letting my hips shift back a little bit. You \ncan have your hips forward if you want to do like faster turns, but I like a little bit of set back \nweight because I do a lot of jumping and a lot of alling. And when you're like back centered and \nyou do a jump, both feet. But when you do this position, upper body forward, hits back, and you \ndo a jump, it naturally is you off the tail and pulls you to the nose. So, I just like it as the \nbase of all my snowboarding. I'm going to make more videos on this, but I just figured it's \nimportant context for the rest of this video. So, that's what I'm talking about. Some ice \nis just too icy to stand on. There I was just putting on my mitt and got taken out. So it can \nget you if you're not aware for it. And that's where like early season like people are getting \nbiffed on this ice patch. So that's why we want to make sure our stance is like over so we can like \ntackle it without relying on leaning. As soon as you're leaning back on one of these slopes, you're \ngoing to be boned. So last lap I explained the three principles. We want to be over top of our \nboard. We don't want to be setting our edge by leaning. And we want to be watching where we're \ngoing and planning our turns. And in this run, I'm going to go and demonstrate how I use them. \nSo Alli's vigilant, Allie's watching. Here, there's a little more snow, less traction, so \nwe're able to go and hold an edge and actually feel more comfortable on our board. The sideburn, \nnot going to be nearly as queued out. When we're going through here, we want to go and look for \nthose soft patches of snow while keeping stack. And the thing that makes this position work is \nshifting your hips slightly to the back foot and the upper body over. This lets me go and get \na lot lower. And from here, if I do slip out, I'm going to slip out onto my bum instead of \nlike falling. When we get into the mogul field, this is going to be more important. And because \nwe're shifted back, it's going to let us move our legs really independently to our upper \nbody. And this is going to give us that micro control. So if we feel like we're slipping \nout here, we can adjust it really easily. So, notice how my upper body's forward, hips \nback, and now I'm able to squat low while keeping myself over top of my board. Holding \nthat forever is going to be really tiring. So, we want to go and fluctuate in the good snow, we \ncan relax it, calm it, and then as it gets worse, we want to crouch it down. And this is \nactually the same position we want for jumping. Now we're getting to a little bit of a steeper \nsection and so it's going to be more icy like here completely sheer ice and it's bumpy afterwards. \nSo planning is going to be really important. I'm going plan going to a right side ice match here \nflat base. Slow down. And now I can straight bomb through here because I see the smells good. \nDepending on the lighting, this is going to be a lot harder. And that's why bad lighting \nand bad ice are the double combo that really makes snowboarding tricky, no matter how good you \nare. We're getting into a mogul field and this is perfect for what I'm trying to demonstrate. Way \ntoo icy throughout the sections. I can't hold an edge at all. This is a sketchy situation. Let me \ngo and demonstrate first how to get up if you fall because falling is going to happen when you're on \nice like this. So, if I fall here and get slipping on my bum, I don't want to try jar my legs forward \nto stop it. Here, it's working because it's not so steep. I actually want to pull my legs into me \nlike this. So, I'm on my back and I'm pulling my legs into me. So, I'm in this strong position \nhere. And that's going to let me absorb it. Like here, I can really dig in my foot. I can use my \nhands. That's going to let me control it. And that's why we want to be a little more crouched \ndown when we think we could be falling so we don't get the wind shook out of us and slam and need to \nnavigate. Now just keeping my board, keeping over top of my board, watching where I'm going. And \nthe important thing here is like ride for what the conditions offer. I'd love to lay some really \nlong turns, but instead I got to stay stacked, control speed, put my weight really solid over \ntop of my board by pulling my upper body forward, shifting the hips back, and that's going to \nlet me navigate this terrain a lot easier and being safe this early season. That's \nthe most important thing. This is the time of year where you can get hurt and get \nbucked for absolutely no good reason. So, you want to go live by these same principles. \nLook where you're going. Don't lean away from your snowboard. And lead the turns through weight \nshifting instead of going and putting yourself in a compromised space. Oh my god. And don't lower \nyour guard. If you do that, you should be able to navigate bad terrain and the early season \nwith relative ease. Relative is a key word"
}