{
  "videoId": "WLq-Za-nDPU",
  "title": "POV: Whistler Opening Day - Is It Worth Riding Opening Week?",
  "transcript": [
    {
      "text": "10:14 a.m.",
      "offset": 0,
      "duration": 0,
      "timestamp": "0:00"
    },
    {
      "text": "Thanks, man. Okay, so because of \ncurrent conditions and lack of snowfall,",
      "offset": 6,
      "duration": 0,
      "timestamp": "0:06"
    },
    {
      "text": "it's only Blackout Mountain that's open and it's \nonly this one run. So, everyone's going to be",
      "offset": 13,
      "duration": 0,
      "timestamp": "0:13"
    },
    {
      "text": "going up Jersey and taking this one run down. I \ndon't think it matters how good you get. If you",
      "offset": 18,
      "duration": 0,
      "timestamp": "0:18"
    },
    {
      "text": "take six months off riding, there's always going \nto be a part of your head that's like, \"Fuck, do",
      "offset": 24,
      "duration": 0,
      "timestamp": "0:24"
    },
    {
      "text": "I still know how to snowboard?\" Uh, the answer is \nusually yes, but sometimes it takes a little bit",
      "offset": 28,
      "duration": 0,
      "timestamp": "0:28"
    },
    {
      "text": "to get into. New boots that maybe are the hardest \npart of a new ski season. Oh, but we're ripping.",
      "offset": 34,
      "duration": 0,
      "timestamp": "0:34"
    },
    {
      "text": "Oh, yeah. Snow's pretty off. Good crunch layer. \nIt's a little bit crunchy. So, I always find",
      "offset": 47,
      "duration": 0,
      "timestamp": "0:47"
    },
    {
      "text": "that my edges ripple a lot harder. Like, I feel \na lot more sensitive at the start of the season.",
      "offset": 54,
      "duration": 0,
      "timestamp": "0:54"
    },
    {
      "text": "We'll go hold the side. It's bumpy,",
      "offset": 68,
      "duration": 0,
      "timestamp": "1:08"
    },
    {
      "text": "but not so bumpy that you can't go and \ntime up your turn. Ice patch there.",
      "offset": 70,
      "duration": 0,
      "timestamp": "1:10"
    },
    {
      "text": "Feels good to be back.",
      "offset": 81,
      "duration": 0,
      "timestamp": "1:21"
    },
    {
      "text": "Oo, that's a bad spot to be \nsitting right under the hill.",
      "offset": 86,
      "duration": 0,
      "timestamp": "1:26"
    },
    {
      "text": "Not really anything for sidehill so far. A \nlittle something here. Going to have to be",
      "offset": 94,
      "duration": 0,
      "timestamp": "1:34"
    },
    {
      "text": "extremely careful on everything you ride right \nnow though, just because there's so many people.",
      "offset": 100,
      "duration": 0,
      "timestamp": "1:40"
    },
    {
      "text": "So, you just have to be really careful \nthese ridges because we're so shallow and",
      "offset": 109,
      "duration": 0,
      "timestamp": "1:49"
    },
    {
      "text": "there's so many rocks that some are looking \na lot more tempting than they actually are.",
      "offset": 113,
      "duration": 0,
      "timestamp": "1:53"
    },
    {
      "text": "Oh, it feels good to be back, man.",
      "offset": 127,
      "duration": 0,
      "timestamp": "2:07"
    },
    {
      "text": "So, you need to be really careful venturing \noff because there really isn't the snow.",
      "offset": 130,
      "duration": 0,
      "timestamp": "2:10"
    },
    {
      "text": "Okay, we'll have to get over through these people.",
      "offset": 146,
      "duration": 0,
      "timestamp": "2:26"
    },
    {
      "text": "That is disgusting. Honestly, just so \nbrutal. We can get up a little bit,",
      "offset": 154,
      "duration": 0,
      "timestamp": "2:34"
    },
    {
      "text": "try to get to people aren't making a \nfourack, but it's pretty condensed.",
      "offset": 162,
      "duration": 0,
      "timestamp": "2:42"
    },
    {
      "text": "Yeah, no worries. I'll kick up my foot. Whoa, \nthat's tight. That's a lot of people. That's a",
      "offset": 175,
      "duration": 0,
      "timestamp": "2:55"
    },
    {
      "text": "lot of people. That's discouraging thinking about \ndoing another run. Yeah. That was long. That was",
      "offset": 182,
      "duration": 0,
      "timestamp": "3:02"
    },
    {
      "text": "like almost 30 minutes, I think. Yeah, I think \nso, too. They're not joking about being careful",
      "offset": 188,
      "duration": 0,
      "timestamp": "3:08"
    },
    {
      "text": "about venturing off trails today. Yeah. Like, and \nthen they made announcement that like if if you",
      "offset": 192,
      "duration": 0,
      "timestamp": "3:12"
    },
    {
      "text": "go across the I don't know, across the like sign. \nYeah. They're not going to help you. They're going",
      "offset": 197,
      "duration": 0,
      "timestamp": "3:17"
    },
    {
      "text": "to not going to save you. That's fair. Yeah. \nI heard some people are hiking to seventh,",
      "offset": 203,
      "duration": 0,
      "timestamp": "3:23"
    },
    {
      "text": "but if you go all the way to seventh, but like \nseven heavens. Yeah. But it seems risky right",
      "offset": 206,
      "duration": 0,
      "timestamp": "3:26"
    },
    {
      "text": "now. It is pretty risky. Legs are starting to feel \na bit better. Boots are warming up a little bit,",
      "offset": 212,
      "duration": 0,
      "timestamp": "3:32"
    },
    {
      "text": "but egg still feels very sensitive. \nOh, this is pretty sick bridge.",
      "offset": 217,
      "duration": 0,
      "timestamp": "3:37"
    },
    {
      "text": "Oh, sick.",
      "offset": 227,
      "duration": 0,
      "timestamp": "3:47"
    },
    {
      "text": "A little something. There's always fun to be",
      "offset": 233,
      "duration": 0,
      "timestamp": "3:53"
    },
    {
      "text": "had across the mountain. You know \nwhich you look. Okay, ice cookies.",
      "offset": 235,
      "duration": 0,
      "timestamp": "3:55"
    },
    {
      "text": "Oh. Oh, what's this?",
      "offset": 244,
      "duration": 0,
      "timestamp": "4:04"
    },
    {
      "text": "Oh my god, I am sketchy on the board \nfor first day. That's to be expected.",
      "offset": 250,
      "duration": 0,
      "timestamp": "4:10"
    },
    {
      "text": "Oh, that's a little fin for my blood.",
      "offset": 266,
      "duration": 0,
      "timestamp": "4:26"
    },
    {
      "text": "It's like really crunchy rolly ball ice \nunderneath a little bit of sticky soft",
      "offset": 269,
      "duration": 0,
      "timestamp": "4:29"
    },
    {
      "text": "snow. Not the worst snow conditions, but I \nwould not trust a serious hard carb right now.",
      "offset": 276,
      "duration": 0,
      "timestamp": "4:36"
    },
    {
      "text": "All right, let's take this with some speed.",
      "offset": 298,
      "duration": 0,
      "timestamp": "4:58"
    },
    {
      "text": "I am sketchy on my board right now.",
      "offset": 311,
      "duration": 0,
      "timestamp": "5:11"
    },
    {
      "text": "Popping too hard. I always \nfind that start of a season,",
      "offset": 318,
      "duration": 0,
      "timestamp": "5:18"
    },
    {
      "text": "you just feel like you need to do so \nmuch to try to get that height where",
      "offset": 321,
      "duration": 0,
      "timestamp": "5:21"
    },
    {
      "text": "really less is usually more. Nothing \nover here. Let's check out to the left.",
      "offset": 325,
      "duration": 0,
      "timestamp": "5:25"
    },
    {
      "text": "Uh man, this run feels so \nshort. So short for that weight.",
      "offset": 335,
      "duration": 0,
      "timestamp": "5:35"
    },
    {
      "text": "Little triple pop. Nothing here to really get \nany serious juice off of. Be a little careful.",
      "offset": 353,
      "duration": 0,
      "timestamp": "5:53"
    },
    {
      "text": "We'll get a little cheeky with it.",
      "offset": 370,
      "duration": 0,
      "timestamp": "6:10"
    },
    {
      "text": "Oh man, it's just so slushy, so grippy. There's \na singles line. Absolutely humongo. Consensus",
      "offset": 376,
      "duration": 0,
      "timestamp": "6:16"
    },
    {
      "text": "on opening day. And this is what it's going to \nbe like into the open war list. It's around 40",
      "offset": 384,
      "duration": 0,
      "timestamp": "6:24"
    },
    {
      "text": "minutes for a lap, 5 minutes riding, 30 minutes \nin line conditions. It's a little warm. There's",
      "offset": 388,
      "duration": 0,
      "timestamp": "6:28"
    },
    {
      "text": "a bit of snow. You do not want to venture too \nfar off trail. Some people have been doing it,",
      "offset": 397,
      "duration": 0,
      "timestamp": "6:37"
    },
    {
      "text": "but honestly, it is a pretty crappy opening day. \nThere's always fun to be had on the mountain,",
      "offset": 403,
      "duration": 0,
      "timestamp": "6:43"
    },
    {
      "text": "but just the amount of work and time it \ntakes to wait is making it sort of not",
      "offset": 410,
      "duration": 0,
      "timestamp": "6:50"
    },
    {
      "text": "too ideal. That said, let's try to get \nsome redemption on this hit. Boost it.",
      "offset": 415,
      "duration": 0,
      "timestamp": "6:55"
    },
    {
      "text": "But there's still fun to be had. I'm \ngonna go home. Wait for a better day.",
      "offset": 422,
      "duration": 0,
      "timestamp": "7:02"
    }
  ],
  "fullText": "10:14 a.m. Thanks, man. Okay, so because of \ncurrent conditions and lack of snowfall, it's only Blackout Mountain that's open and it's \nonly this one run. So, everyone's going to be going up Jersey and taking this one run down. I \ndon't think it matters how good you get. If you take six months off riding, there's always going \nto be a part of your head that's like, \"Fuck, do I still know how to snowboard?\" Uh, the answer is \nusually yes, but sometimes it takes a little bit to get into. New boots that maybe are the hardest \npart of a new ski season. Oh, but we're ripping. Oh, yeah. Snow's pretty off. Good crunch layer. \nIt's a little bit crunchy. So, I always find that my edges ripple a lot harder. Like, I feel \na lot more sensitive at the start of the season. We'll go hold the side. It's bumpy, but not so bumpy that you can't go and \ntime up your turn. Ice patch there. Feels good to be back. Oo, that's a bad spot to be \nsitting right under the hill. Not really anything for sidehill so far. A \nlittle something here. Going to have to be extremely careful on everything you ride right \nnow though, just because there's so many people. So, you just have to be really careful \nthese ridges because we're so shallow and there's so many rocks that some are looking \na lot more tempting than they actually are. Oh, it feels good to be back, man. So, you need to be really careful venturing \noff because there really isn't the snow. Okay, we'll have to get over through these people. That is disgusting. Honestly, just so \nbrutal. We can get up a little bit, try to get to people aren't making a \nfourack, but it's pretty condensed. Yeah, no worries. I'll kick up my foot. Whoa, \nthat's tight. That's a lot of people. That's a lot of people. That's discouraging thinking about \ndoing another run. Yeah. That was long. That was like almost 30 minutes, I think. Yeah, I think \nso, too. They're not joking about being careful about venturing off trails today. Yeah. Like, and \nthen they made announcement that like if if you go across the I don't know, across the like sign. \nYeah. They're not going to help you. They're going to not going to save you. That's fair. Yeah. \nI heard some people are hiking to seventh, but if you go all the way to seventh, but like \nseven heavens. Yeah. But it seems risky right now. It is pretty risky. Legs are starting to feel \na bit better. Boots are warming up a little bit, but egg still feels very sensitive. \nOh, this is pretty sick bridge. Oh, sick. A little something. There's always fun to be had across the mountain. You know \nwhich you look. Okay, ice cookies. Oh. Oh, what's this? Oh my god, I am sketchy on the board \nfor first day. That's to be expected. Oh, that's a little fin for my blood. It's like really crunchy rolly ball ice \nunderneath a little bit of sticky soft snow. Not the worst snow conditions, but I \nwould not trust a serious hard carb right now. All right, let's take this with some speed. I am sketchy on my board right now. Popping too hard. I always \nfind that start of a season, you just feel like you need to do so \nmuch to try to get that height where really less is usually more. Nothing \nover here. Let's check out to the left. Uh man, this run feels so \nshort. So short for that weight. Little triple pop. Nothing here to really get \nany serious juice off of. Be a little careful. We'll get a little cheeky with it. Oh man, it's just so slushy, so grippy. There's \na singles line. Absolutely humongo. Consensus on opening day. And this is what it's going to \nbe like into the open war list. It's around 40 minutes for a lap, 5 minutes riding, 30 minutes \nin line conditions. It's a little warm. There's a bit of snow. You do not want to venture too \nfar off trail. Some people have been doing it, but honestly, it is a pretty crappy opening day. \nThere's always fun to be had on the mountain, but just the amount of work and time it \ntakes to wait is making it sort of not too ideal. That said, let's try to get \nsome redemption on this hit. Boost it. But there's still fun to be had. I'm \ngonna go home. Wait for a better day."
}