[
  {
    "trickId": "jump",
    "trickName": "Jump",
    "aliases": [
      "jump",
      "hitting a jump",
      "air",
      "taking flight"
    ],
    "videoId": "sf3_cVRWatQ",
    "videoTitle": "How To Hit Your Jumps Snowboarding",
    "totalDuration": 441,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To maximize air time, match the arc of the jump by taking off with a good, consistent pop. Aim to land with both feet simultaneously.",
        "rawText": "to spend less time on the ground and more time in the air when hitting a jump you have two main goals the first being matching The Arc of the jump this is done for your takeoff with a good takeoff you can pop off a lip and it will naturally sink you up to go up Arc over and come into a landing hitting both feet at the same time this is the ideal flight path you want to be trying to hit on every jump second is hitting",
        "timestamp": 21,
        "endTime": 42,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "Focus your landing on the \"sweet spot\" of the jump. This is the area about 30% of the way down the landing hill, where the impact will be the softest.",
        "rawText": "The Sweet Spot of a landing all jumps have something called the knuckle the knuckle is the flat section after the lip of the takeoff it goes takeoff knuckle then landing and The Sweet Spot refers to the part of the landing that has the least amount of impact this is generally around 30% of the way down the jump past halfway down the landing you start getting into what we call going",
        "timestamp": 45,
        "endTime": 65,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "Aim to land in the \"sweet spot\" of the jump to create a cushion and avoid landing on the knuckle (the most impactful part) or overshooting. This increases safety when hitting any jump.",
        "rawText": "aim to land in The Sweet Spot because it gives that little bit of cushion of going too small and too big making sure we don't land on the knuckle what is the most impactful part of the jump and making sure we don't overshoot the jump Landing down in the lower spoon by aiming for The Sweet Spot you will drastically increase the safety of hitting any jump everyone always says Alles are needed to learn how to jump",
        "timestamp": 89,
        "endTime": 109,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "When jumping, shift your weight from your front foot to your back foot. This keeps the board in contact with the snow longer, allowing you to fully utilize the board's tail for the jump.",
        "rawText": "but why is this this is because when we're jumping we want to shift our weight from our front foot to our back foot in order to keep our board in contact with the snow as long as possible allowing us to go and snap off our tail fully utiliz it in the shape of your snowboard and all the potential energy it can generate when we're jumping we're going to eliminate that big movement and just keep the weight",
        "timestamp": 111,
        "endTime": 131,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "To practice the weight shift needed for jumps, do \"micro ollies\": slightly bend your knees and shift your weight to your back foot, then pop off the board. This small movement helps train the technique for taking off jumps.",
        "rawText": "transfer of shifting from a stack position to our back foot this will let us go and fly off a jump while maintaining board pressure for Lift as long as possible to train this weight shifting technique practice micro allies micro allies are when you go into a slight Bend in your legs and just shift your weight to your back foot and pop off it's a very small motion but this is very accurate to what we want to be",
        "timestamp": 133,
        "endTime": 155,
        "duration": 22
      },
      {
        "stepNumber": 6,
        "summary": "To practice for jumps, shift your weight from your front foot to your back foot with a slight extension. This helps maintain board contact with the snow.",
        "rawText": "doing off an actual jump you can train this going down the hill or just on flat just try to get used to the feeling of Shifting your weight from your front foot to your back foot with slight extension that'll help keep your board in contact with the snow as long as possible the other way to generate height on a snowboard is jumping a lot of people think to generate height on a snowboard while jumping you need to",
        "timestamp": 157,
        "endTime": 177,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "When approaching the jump, slightly bend your legs, putting pressure on the balls of your feet. Maintain this \"coasting\" position throughout the jump.",
        "rawText": "squat all the way down and try Push Up full extension the actual motion you want to be using is much smaller than this take a slight bend your legs that puts pressure onto the balls of your feet this is the exact position you want to be in when going off the jumps you can actually hold this position the whole time you're hitting the jump we call this coasting when you go and Coast",
        "timestamp": 178,
        "endTime": 198,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "Keep your body stacked over the center of your snowboard when going off a jump, avoiding any extending with your legs to control your airtime. This stable position helps with a safer and easier first jump experience.",
        "rawText": "off a jump you're not going into extending so you're not getting extra height out of your legs what this does is it makes it so the first time you hit a jump you have less air making it safer and more easy to navigate the most important thing for this is that you're holding this position and not getting thrown forward or backwards going off the lifp or getting pushed down you want to be stacked over the center of your snowboard with your slight athletic",
        "timestamp": 201,
        "endTime": 222,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "Square your body over the center of your board, facing the end of the takeoff, with your shoulders stacked and knees slightly bent. Maintain contact with the ground as long as possible on the approach.",
        "rawText": "stance riding up and getting off the end maintaining contact with your board on the ground as long as possible there is a lot of positions you can have when snowboarding but when jumping there is only one position you want and that is completely squared over the center of your snowboard head turned facing the end of the takeoff shoulders stacked with your slight bend your knees pting",
        "timestamp": 224,
        "endTime": 245,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "Keep your weight balanced on the balls of your feet in a \"power position\" when approaching and launching off the jump. Avoid shifting your hips forward or compromising your body position to maximize power and control.",
        "rawText": "the weight on your balls of your feet this is our power position that we want to be using every time we hit a jump if you go and start opening your hip shifting forward or compromising your body in any way it's going to drastically limit the power you can get off the lip while also adding a bunch of unforeseen Funk and the possibilities for Funk are endless as soon as you start dipping forward or back so make",
        "timestamp": 247,
        "endTime": 267,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "When approaching a jump, maintain a strong, stable riding position (stacked). Your goal is to ride straight off the jump, from the bottom to the top, without adjusting your stance.",
        "rawText": "sure to practice and train riding in this strong stable position I'd recommend trying to ride down the mountain just holding this position for as long as you can seeing if you can go and do a straight line well stay in this position stack because that's what you'll be doing when going off of a jump When approaching a jump your goal is to ride off straight all the way from the bottom of the jump to the top of the",
        "timestamp": 269,
        "endTime": 290,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "To prepare for a jump, maintain slight pressure on the balls of your feet to grip the snow and stay in control. Avoid any last-second speed checks right before the jump.",
        "rawText": "jump you want to have slight pressure on the balls of your feet not enough that you start getting on your Edge and turning into the jump but just enough that you're not going flat base this will just help you grip the snow and keep control a big thing that messes this up is last second speed checks if you're going and doing a speed check right before the bottom for jump when you come into the jump you're going to have to reshift your weight making it",
        "timestamp": 292,
        "endTime": 312,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "Watch experienced riders hit the jump and pay attention to their speed, the number of turns they take before the jump, and where they perform their speed checks. This will help you gauge the correct speed and timing for your own jump.",
        "rawText": "harder to go and hold your stack position and lock it in the main cause to last minute speed checks is being unsure about the speed of a jump in order to remedy this what you want to do is a few things first of all watch people hit see how many turns we taking inch of a jump where we're doing your speed checks try to watch for the person who looks most confident going in and is",
        "timestamp": 314,
        "endTime": 334,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "Watch experienced riders hitting the jump, paying attention to how they manage their speed and where they land. Then, imitate the person who takes the fewest speed checks to ensure you have the right speed for the jump.",
        "rawText": "the most still in the air next you can go up to the knuckle the jump from here you'll be able to watch people's in runs and then also watch River Landing watch a bunch of people hit the jump this way and keep in mind how many speed checks we're taking where we're taking those speed checks and where we're landing on the landing you want to be trying to imitate the person who's taking the least amount of speed checks looks in",
        "timestamp": 336,
        "endTime": 357,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Focus on maintaining a strong, stacked body position, and build confidence by starting with small, \"micro\" jumps that don't overextend your body.",
        "rawText": "sure you're ready to be hitting a jump or you want help getting your body ready to perform bigger jumps or just hit your first ever jump come join addiction plus first month is free and it's going to really help you get to the next level of riding jumping is all about keeping this strong long simple stacked body position and getting really confident with doing these micro jumps that don't overextend",
        "timestamp": 404,
        "endTime": 424,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "pop",
    "trickName": "Pop",
    "aliases": [
      "popping",
      "olliing",
      "ollie"
    ],
    "videoId": "-bCYIDG_2wg",
    "videoTitle": "The Secrets Of Popping On A Snowboard",
    "totalDuration": 773,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To prepare for a pop, get into your \"stack position\": slightly bend your legs, put your weight on the balls of your feet, and keep your knees and shoulders square, avoiding any inward or outward knee movement or hip opening.",
        "rawText": "you what is popping how to pop and the different ways you can use that pop to maximize your air time and increase your plug on the mountain the first step to doing any pop is finding your stack position a stack position is a slight bending of the legs putting the weight onto the balls of your feet having squared knees and shoulders making sure that your knees aren't coming in or out and you're not opening your hips just a",
        "timestamp": 23,
        "endTime": 44,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "When you squat down to pop, keep your back straight to maintain a stacked position. This allows for a powerful and full extension when you launch, preventing loss of power.",
        "rawText": "straight line stacked making sure your back is straight when you hold this position and you squat down your back will maintain a straight line making it so when you pop up everything will fully extend without losing any any power whenever you lose the stack position be it too much Edge pressure bending forward we call this breaking at the waist and breaking up the waist is the",
        "timestamp": 46,
        "endTime": 67,
        "duration": 21
      },
      {
        "stepNumber": 3,
        "summary": "To \"pop\" on your snowboard, start with a two-foot jump. Squat down and then jump upwards off both feet as you leave the feature.",
        "rawText": "or pop for short we'll start with the two foot a jump a two foot a jump is when you squat down and jump off off both feet off the feature this is a very entrylevel way of generating height on a snowboard and one of the most common mistakes you'll see on the mountain if you ever see anyone out of control or looking like they don't know how to hit a jump it's probably because we're using",
        "timestamp": 92,
        "endTime": 112,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "To get the best \"pop,\" utilize your snowboard fully by letting your tail leave the takeoff before you jump. This maximizes the board's potential and the feature's kick.",
        "rawText": "the two-footed jump there's two main reasons it's so damaging to your airs first of all it doesn't fully utilize your snowboard allowing you to go and pop off before having your board fully leave the takeoff that also brings us to a second reason it doesn't fully utilize the feature jumps have something called Kick and your board has a tail when you do a two foot a jump you're not",
        "timestamp": 114,
        "endTime": 135,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "To maximize your \"Pop\" on side hits, avoid putting too much pressure on your toes, as this can negatively impact your technique. Focus on proper technique to achieve maximum height and distance, especially on smaller takeoffs.",
        "rawText": "maximizing the use of either of those things limiting the amount of air you can get overall this is even more true on side hits because on side hits the takeoff is way smaller so that extra board length of distance will go in really the amount of maximum height and distance traveled you can achieve on your snowboard two- footed jumping also messes up your Technique this can be by putting too much pressure on your toes",
        "timestamp": 136,
        "endTime": 158,
        "duration": 22
      },
      {
        "stepNumber": 6,
        "summary": "Focus on shifting your weight from your nose to generate the most height when attempting a jump (ollie). This utilizes the biggest portion of your snowboard for maximum lift.",
        "rawText": "breaking out the waist just a whole bunch of things that can Co and get messed up when trying to perform a two-footed jump and that's why we really want to avoid it in our snowboarding let's break down the Allie allies are how you generate the most height off your snowboard this is because it's the biggest motion that utilizes the biggest portion of your snowboard going over from your nose shifting your weight over",
        "timestamp": 159,
        "endTime": 180,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "Combine a small, quick two-foot jump motion with the weight shift of an Ollie to generate \"pop.\" This technique is a fundamental element of professional snowboarding.",
        "rawText": "that is why we don't generally use the Alli in park riding unless it's for a style Factor this is why the best thing to do is to combine the two fo of jump and the OE taking the quick small motion of a two- footer jump and combining it with the weight shift of the OE resulting in what we're calling popping this is something that all pro snowboarders will be doing",
        "timestamp": 228,
        "endTime": 248,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "Instead of lifting off the jump, focus on pushing down on the tail of your board as you leave the jump. This will utilize the board's flex and the jump's kick for more air and control.",
        "rawText": "subconsciously if you ever heard of a term snapping off a tail it's referring to this by making sure you snap off your tail when leaving the jump you'll be fully utilizing the flex of your snowboard and the kick of the jump helping you get more control and air now let's break down how to do the most effective paw the best way to visual realze this is instead of trying to lift your jumps to you think about pushing",
        "timestamp": 250,
        "endTime": 271,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "To get \"Pop\" off the jump, drive your legs down onto the takeoff, keeping your board at a constant angle to the jump's lip, and maintain your weight centered over the board. This maximizes contact and prepares you for lift-off.",
        "rawText": "your legs down onto the jump so that way you're trying to make contact with your board and the lip of a takeoff as long as possible when doing this you want to try to keep your board keeping the constant angle of the jump not letting your the front of your board dip down or dip up maintaining that strong straight angle as you go and push over and make sure you're getting your weight set over",
        "timestamp": 273,
        "endTime": 294,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "As you approach the takeoff, fully extend your body. Aim to jump off the lip of the takeoff with your body fully extended to set yourself up to bring your legs up and control your air.",
        "rawText": "your tail snapping off the end so even though what you're doing is is jumping what it feels like is pushing off the Jump the ideal timing for this has you going and leaving off the lip of a takeoff as your body is fully extended setting you up to bring up your legs and fully control your air something that I can't overstate is you don't want your jump should be flattening out while going off the takeoff you should be",
        "timestamp": 296,
        "endTime": 317,
        "duration": 21
      },
      {
        "stepNumber": 11,
        "summary": "Shift your weight slightly over your back foot just before the lip of the jump. This subtle shift allows your board's tail to snap off the end of the jump for maximum \"pop.\"",
        "rawText": "holding the line of the takeoff until your tail snaps off the end this is where the highest skill cap of popping comes into play because the goal is to have your weight going from stacked and the center your board just shifted slightly over your back foot allowing you to make contact with the lip as long as possible this motion is very subtle and complex so it's not something that",
        "timestamp": 318,
        "endTime": 339,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "Maintain board pressure on the lip of the jump takeoff as long as possible while keeping your board aligned with the angle of the takeoff. Focus on a smooth motion.",
        "rawText": "you're going to master in one day instead it's something to always be aiming for and working on every time you pop off a jump to recap that what you're trying to achieve is maintaining board pressure on the lip of a takeoff as long as possible well having your board match the angle of the takeoff for as long as possible and another really important step to this is the smoothness of your paw you don't want to be going and",
        "timestamp": 341,
        "endTime": 362,
        "duration": 21
      },
      {
        "stepNumber": 13,
        "summary": "When popping off a jump, generate a smooth, constant power throughout the entire motion. Avoid sudden changes in your extension or power to maintain control and a clean takeoff.",
        "rawText": "extending up and then rushing the last little bit the smoother you can make this motion the more consistent and fluent it will be so whenever you're popping off a jump make sure that you're going up and just one constant set of power to leave the takeoff as soon as you start trying to lessen this power or increase the power you'll be adding Jank to your takeoff increasing the chances of you going wild and losing control so",
        "timestamp": 365,
        "endTime": 386,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "After fully extending for your jump, bring your legs up towards your body in the air to maintain control. Avoid bringing your legs up too early, as this can negatively affect your jump.",
        "rawText": "really focus in on these three steps the pressure off the Jump the angle of your board and the smoothness of your paw now that you're in the air you need to control it and the best way to control any air is by bringing your legs up to your body this should only be done after the full extension if you go and cut your extension short you'll be at risk of doing the two footed jump this is a",
        "timestamp": 389,
        "endTime": 409,
        "duration": 20
      },
      {
        "stepNumber": 15,
        "summary": "Focus on popping off your tail for the jump to initiate the lift and bring your legs up to you naturally, which will allow you to grab the board more easily.",
        "rawText": "super common mistake especially when people start grabbing because we'll go in instead of focusing on pushing off a jump focus on on bringing your legs up to her body so we can reach that grab but when you go and perform a successful pop the momentum of your pop up and the snap off your tail will actually bring your legs up to you as well as setting up on the natural Arc of the jump allowing you to hit any grab you want",
        "timestamp": 412,
        "endTime": 433,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "Don't lock your legs straight or bend them too much when approaching a jump lip. Find a balanced leg position that allows you to absorb the g-force of the jump.",
        "rawText": "with much greater ease than trying to rush and reach for a grab when hitting and jump you don't want to have your legs too straight because Val make it so you can't absorb the gForce going up the lip and if there's any bumps in the snow you'll get thrown off balance you also don't want your legs too bent because it will also make it so you don't have the platform to go and absorb the gForce of going up the lip and then",
        "timestamp": 435,
        "endTime": 456,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "Maintain a slight bend in your legs in your stack position to generate the power needed for your pop. This subtle weight shift, utilizing your snowboard, is key, rather than a big jumping motion.",
        "rawText": "you'll need more energy to pop up and extend the power zone is in your stack position maintaining that slight Bend in your legs this is all the bend you need to generate power off your snowboard because power of your snowboard doesn't come from this big over exaggerated jump motion instead it comes from that subtle shift of weight making sure you're fully utilizing the feature and and your snowboard a good way to tell if you have",
        "timestamp": 458,
        "endTime": 479,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "Keep your weight over the balls of your feet when you squat down. If you're hinging forward or feeling weight on your heels, adjust your leg bend.",
        "rawText": "the right amount of Bend in your legs is if your weight is set over the balls of your feet if your squat down has you starting to hinge forward or break at the waist that means you're adding too much Bend in your legs and you need to straighten it out you can tell if your legs are too straight if you don't feel the weight on the balls of your feet and you start to feel it more centered around your heels or the soles of your foot you also need to make sure you're",
        "timestamp": 481,
        "endTime": 502,
        "duration": 21
      },
      {
        "stepNumber": 19,
        "summary": "Keep your body aligned and avoid opening your hips as you approach the takeoff. This will help you maintain control in the air.",
        "rawText": "not opening your hips to the takeoff opening your hips will go and throw off your Center C balance making it much harder to control your airs so you need to make sure you're staying stacked and keeping your body aligned next up is practicing keeping your board stable when riding off the features I like to practice this when riding off of a box going on the box and trying to keep my",
        "timestamp": 504,
        "endTime": 524,
        "duration": 20
      },
      {
        "stepNumber": 20,
        "summary": "To pop off a feature, keep your board flat and shift your weight from your front foot to your back foot at the last moment. This subtle motion helps you generate lift without leaning back too much.",
        "rawText": "board completely flat from the time on the box to leaving the feature Landing with a two-footed stack position remember this is a small subtle motion you don't want to be leaning back like you would for a tail press if your nose starts dipping up that's too much your goal is to suddenly shift your weight from your front foot to your back foot allowing your board to stay completely",
        "timestamp": 526,
        "endTime": 546,
        "duration": 20
      },
      {
        "stepNumber": 21,
        "summary": "Your summarized tip here:\nTo successfully \"Pop\", ensure your board remains completely flat and level as you ride off any feature. If your board lifts up or dips down, adjust your weight transfer to maintain a flat board.",
        "rawText": "flat as you ride off a feature resulting in landing at both feet at the same time if your board starts to lift up or dip down you know you aren't successfully transing your weight in a way that keeps your board completely flat and level this is a great skill to get in place because it's the same fundamental body principles that you'll be using off of the jumps when hitting a jump you will",
        "timestamp": 547,
        "endTime": 567,
        "duration": 20
      },
      {
        "stepNumber": 22,
        "summary": "Maintain a stacked, balanced position while shifting your weight slightly to your back foot as you approach the jump. Avoid leaning too far forward or back, and make small, subtle adjustments to your technique based on the jump's specific characteristics.",
        "rawText": "need to adjust this form slightly to match the angle of the takeoff you're still trying to hold that stacked position while shifting your weight to your back foot but you need to make sure you're not going in leaning forward or leaning back to overcompensate for the take off of the jump the motion you want to be using off the Jump is very small and subtle and every jump rides slightly differently with more kick or less kick",
        "timestamp": 569,
        "endTime": 589,
        "duration": 20
      },
      {
        "stepNumber": 23,
        "summary": "Start by adding a small pop to your jumps, gradually increasing the extension. Aim for a pop where you can perform the motion without needing to make adjustments in the air.",
        "rawText": "so it's going to be down to you to figure out the ideal body position to fully pop off that specific jump start to add a small small pop into your jumps slowly building your way up into you're getting the maximum extension you feel comfortable with as a rider you know you hit it right with the right amount of Pop if you can do this motion without making any adjustments in the air",
        "timestamp": 591,
        "endTime": 611,
        "duration": 20
      },
      {
        "stepNumber": 24,
        "summary": "As you pop off the jump, bring your legs up towards you naturally. Maintain a stacked, neutral position in the air to ensure a smooth landing.",
        "rawText": "adjustments in the air refer to arm flails shifting of the hips counterbalancing basically you want to pop off a jump and as soon as you pop off your legs want to come to you naturally and then you can just hold that stacked neutral position throating through the air coasting all the way to the landing Landing both feet the more still you can do this motion the better",
        "timestamp": 613,
        "endTime": 633,
        "duration": 20
      },
      {
        "stepNumber": 25,
        "summary": "Focus on relaxing and \"chilling\" in your straight airs off the jump to build confidence, which will then improve your \"pop\" and overall trick progression.",
        "rawText": "your pop was off the take off by getting your straight airs to this point of just relax chilling you'll really build your confidence on the jump allowing you to then go and add more tricks and add more technicality to your riding in a natural line and progression the base to every trick is this good foundation of a pop so by doing this not only will you become better at doing straight airs but",
        "timestamp": 635,
        "endTime": 655,
        "duration": 20
      },
      {
        "stepNumber": 26,
        "summary": "Bend your legs slightly and get into a stacked position, then apply pressure to the board for a good pop. This will help you get air and land smoothly.",
        "rawText": "you'll become a better more confident Rider overall so I highly recommend going out working on your pops and getting to a point where you can pop up get big air and just chill resulting in a smooth two-footed Landing that will feel absolutely amazing and that's how you pop a snowboard to recap you want to slight bending your legs a completely stacked position applying the pressure",
        "timestamp": 657,
        "endTime": 678,
        "duration": 21
      },
      {
        "stepNumber": 27,
        "summary": "As you hit the lip of a jump, fully extend and snap your tail upwards, letting your legs naturally come up to you as you match the jump's arc. Land with a two-footed stomp.",
        "rawText": "of your snowboard on the lip of a takeoff all the way into your tail snaps up with your full extension lining up with that moment having your legs naturally come up to you chilling in the air matching The Arc of the jump Landing with that two-footed stomp once you can do that you'll know that you fully have your pops locked in and you're ready to move on to bigger features and bigger",
        "timestamp": 680,
        "endTime": 700,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "backside-180",
    "trickName": "Backside 180",
    "aliases": [
      "bs 180",
      "back 180",
      "backside one eighty"
    ],
    "videoId": "ln03njzMzuk",
    "videoTitle": "Master The Backside 180 On Your Snowboard",
    "totalDuration": 464,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Backside 180, focus on two key elements: the pop and the spot. Master these to execute the trick successfully.",
        "rawText": "oh my God P white out hey guys Tavis here and in this video I'm going to teach you how to Backside [Music] [Applause] 180 backside 180s have two main components the pop and the spot we're",
        "timestamp": 6,
        "endTime": 28,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "Focus on a forward spot on the snow and rotate around it while maintaining contact with the ground. Keep your eyes locked on that spot throughout the rotation.",
        "rawText": "going to be starting with training the spot so we can go and dial it in and really Crush these back ones backside 180s use something called the constant spot the best way to train this is by picking a forward point in the snow and rotating around that point maintaining contact with the ground and keeping your eyes locked on that point as you pass it this will result in you finishing in",
        "timestamp": 31,
        "endTime": 51,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "When practicing a Backside 180, focus on tracking the knuckle and rotating around it as you approach the landing. This helps you land with your back to the landing, which is crucial for this trick.",
        "rawText": "that blind landing position blind Landings are referring to when you land looking back uphill and it's used on back ones back FS front freeze any trick that you're finishing your trick with your back to The Landing you use the blind Landing while you're doing the spawning trick you're going to be training the ability to track the knuckle and rotate around it in order to do this effectively make sure that as",
        "timestamp": 53,
        "endTime": 75,
        "duration": 22
      },
      {
        "stepNumber": 4,
        "summary": "To land a backside 180, maintain pressure on your toe edge throughout the rotation. This will help prevent catching your heels and ensure a clean spin.",
        "rawText": "you pass the knuckle your head tracks uphill an important thing to note for this is you need to keep the pressure on your toe Edge if you have your pressure on your heel Edge you'll be at risk of catching heels so whenever you're rotating about last bit for a blind rotation make sure you keep the pressure onto your toe Edge slightly you don't want it to be leaning over into your spot instead make sure you're",
        "timestamp": 77,
        "endTime": 97,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "Keep your body stacked (board, upper and lower body aligned, slight bend in legs), tilt your chin down and pull this stacked position as you rotate.",
        "rawText": "maintaining your stacked position a stacked position refers to having your board in line with your upper and lower body with a slight Bend in your legs this is a base position you'll be using for every trick on a snowboard by tilting your chin down and pulling the stack position as you rotate you'll be accurately emulating what it's like to actually do the back one off and jump a key Point here is making sure you're",
        "timestamp": 99,
        "endTime": 121,
        "duration": 22
      },
      {
        "stepNumber": 6,
        "summary": "Hold your blind landing position until your rotation stops completely. While holding the landing, use your toe edge to rotate back uphill and stop your rotation.",
        "rawText": "holding your blind Landing if you start to look up from your blind Landing too soon it will result in you scrub to your heels washing out continuing rotation what you want to do is make sure you hold your blind Landing until your rotation is fully stopped while you do this you're taking your toe Edge these two things of rotated back uphill with your upper body and digging your tow",
        "timestamp": 122,
        "endTime": 143,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "Hold the landing of your backside 180 a bit longer than you think you need to. This will help you land cleanly and is important for building good habits for bigger spins.",
        "rawText": "Edge will let you dispers your rotational power allowing you to right away cleanly without washing out it's important to really build the habit of holding that blind Landing a little bit longer than you think because it's going to be extra crucial once you start moving on to bigger spins your goal on a backside 180 is to use the spot trick and apply it to the knuckle making it so",
        "timestamp": 145,
        "endTime": 165,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "As you approach the landing, pop up, spot the knuckle, and smoothly rotate your body around, keeping your eyes on the knuckle. This will help you land with your back to the direction you came from, ready to hold your edge and ride away.",
        "rawText": "you pop up see the knuckle as soon as possible and rotate your rotation smoothly around keeping your eyes locked on the knuckle as you pass it this will result in you looking uphill back up the knuckle as you hit the Landing then you just hold the blind Landing dig in your tow Edge and ride away practice this step on snow until you feel comfortable withing motion after that it's time to",
        "timestamp": 167,
        "endTime": 187,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Ride a side hit to practice your backside 180s. The side hit will help you maintain your toe edge, require less rotation, and let you focus on your pop.",
        "rawText": "take your backside 180 to a side hit side hits make backside 180s easier to do because hitting them you naturally hold your toe Edge going all the way up it making it so you don't need to worry about a setup C they also make it so you only need to rotate around 90 letting you focus more on your pop and more on your spot you don't need to generate much rotation for a backside 180",
        "timestamp": 190,
        "endTime": 210,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "To land a backside 180, pop up lightly off the side hit while slightly closing your shoulder on takeoff. Focus on your spot to initiate the rotation with minimal extra power.",
        "rawText": "especially off the side hit so focus on getting a good pop up lightly closing your shoulder off the takeoff and focusing on your spot a good popup with a good spot will let you go and rotating backside 180 without adding much power once you have your backside 180s on side hits locked in it's time to bring them to a park jump there's two things you're",
        "timestamp": 212,
        "endTime": 232,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "To land a backside 180 on a jump, approach on your heel edge and start swapping to your toe edge at the bottom of the takeoff. Finish the rotation as your tail leaves the jump, looking toward where you'll land.",
        "rawText": "going to need to change for a park jump first of all you need to add slightly more rotation going from 90 to 180 next you need to add something called a setup carb a textbook setup carb has you approaching on your heel Edge starting to swap to the toe edge of your snowboard at the bottom of the takeoff finishing your throw as your tail leaves the takeoff looking towards the end of a",
        "timestamp": 234,
        "endTime": 254,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "Maintain your stacked position and ride off the jump in a straight line. As you leave the jump, start looking away from the takeoff to initiate the spin.",
        "rawText": "takeoff serves two purposes keeping your carve straight and letting you time your snap you want your aim to start looking away from the takeoff as your board starts to leave the lift of a jump setup cars are not very important on backside 180s so it become covering them more in depth in our backside 360 tutorial what is important is making sure you're maintaining your stack position and riding off a jump in a straight line a",
        "timestamp": 256,
        "endTime": 276,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "Focus on a straight-line takeoff to minimize drift. Use counter-rotation to initiate and control the backside 180, and prioritize a good pop off the takeoff.",
        "rawText": "stack position with a straight line up for takeoff will eliminate a lot of drift allowing you to pop up track the knuckle and maintain a more constant rotation on backside 180 you can actually rotate it completely with counter rotation this is why you don't need to worry about snapping too hard and instead focus on getting a good pop off a takeoff having your",
        "timestamp": 278,
        "endTime": 298,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "To get a good pop for your backside 180, focus your eyes and upper body on the direction of rotation while letting your legs follow. Make sure your tail of the board makes full contact with the lip of the jump until the very end for a clean pop.",
        "rawText": "eyes and upper body leave rotation because you can always have your legs play catchup afterwards the best way to achieve a good takeoff is through a proper pop a proper pot as you leaving off and jump making sure your Tail's making contact with a lip until it snaps off the end this fully utilizes your snowboard allowing you to get a clean pop up will help you match for Arc of a",
        "timestamp": 300,
        "endTime": 321,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Match your jump's arc to your rotation for a smoother backside 180. This helps you focus on the spin and minimizes adjustments needed for landing.",
        "rawText": "jump when you match the Arc of a jump you'll be able to focus more of a rotation because you won't need make adjustments to try line up your body with the landing this is one of the most important steps of getting a smooth clean backside 180 if you want more help getting a clean paw we made a great video earlier in this series so go back and watch it and understand those fundamentals because it's really going",
        "timestamp": 324,
        "endTime": 344,
        "duration": 20
      },
      {
        "stepNumber": 16,
        "summary": "To land a backside 180, avoid throwing your shoulders too aggressively; instead, focus on a good pop. Also, maintain a stacked position and avoid breaking at the waist to maintain control.",
        "rawText": "to be a massive game changer for your back ones and every trick to come there are three main mistakes made on backside 180s first is throwing too hard you don't need that much rotation on a backside 180 so focus on getting a good pop second is breaking at the waist when you break at the waist you won't be able to hold your stack position not letting you fully utilize your board as well as",
        "timestamp": 345,
        "endTime": 366,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "To land a backside 180, ensure a clean pop off the takeoff, and don't look up before completing your rotation. Avoid slipping to your heels by holding your landing.",
        "rawText": "making it so you can't fully push through the takeoff getting a clean pop and lastly is not holding the blind Landing if you go and look up from a backside 180 without having your rotation fully killed you're going to slip to your heels resulting in a not make those are the three main mistakes that you need to watch out for on any backside 180 try to hit the five key",
        "timestamp": 368,
        "endTime": 389,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "Focus on these key points for a Backside 180: Use slight toe pressure for takeoff, close your front shoulder slightly, rotate smoothly while spotting your landing, and land on your switch toe edge.",
        "rawText": "points a takeoff with slight toe pressure a slightly closed off front shoulder a smooth rotation as you perform the spotting trick a switch toe Edge Landing then hold the blind Landing until your rotation is completely stopped and ride away there's so many Possible little things that could be messing up your backside 180 that we can't cover in this video that's why we made an addiction plus addiction plus is",
        "timestamp": 391,
        "endTime": 412,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "frontside-180",
    "trickName": "Frontside 180",
    "aliases": [
      "fs 180",
      "front 180",
      "frontside one eighty",
      "frontside 1",
      "fs one eighty"
    ],
    "videoId": "sBbL8FsRvXc",
    "videoTitle": "Master The Frontside 180 On Your Snowboard",
    "totalDuration": 516,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "Focus on practicing your frontside 180s off your heel edge to build a strong foundation for your future spins. This will help you dial in the fundamentals of frontside spins.",
        "rawText": "hey snow addiction cavis here and in this video I'm going to teach you how to do a profer front side 180 off your heel Edge you can do front runes off your toe Edge but we're going to use this as a base for getting all of our front side spin fundamentals going so that's why we'll be training it off our heel Edge so we can really get it dialed in and lock the future spins to [Music]",
        "timestamp": 0,
        "endTime": 21,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "To prepare for a frontside 180, get into a \"stacked\" position: square your body to the board, bend your knees slightly, keep weight over the balls of your feet, and keep both your upper and lower body closed off. This stance provides the power you'll need for the spin.",
        "rawText": "come there are a few fundamental skills you're going to need for every front side spin but first off being finding your stacked position a stacked position refers to having your body squared off with your snowboard a slight Bend in your legs having your weight set over the balls of your feet and keeping your upper and lower body closed off to the jump this is a powerful position that",
        "timestamp": 28,
        "endTime": 48,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "When approaching the jump for a frontside 180, carve on your toe edge then switch to your heel edge *after* you've gone through the \"spoon\" of the jump while maintaining your stacked body position.",
        "rawText": "you'll be using for every front side spin with only slight variations the second skill you need for your front side spins is your setup carve a setup carve refers to switching from your tow Edge to your heel Edge When approaching the jump with a textbook setup carve being coming to the jump on your toe Edge switching to your heel Edge after you go through the spoon of a jump while holding your stack position keeping your",
        "timestamp": 50,
        "endTime": 71,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "Focus your eyes on where you want to land and snap off the tail of your board in a straight line for a clean 180. Hold a straight line as you approach the takeoff, making sure your tail is the last part of your board to leave the snow.",
        "rawText": "eyes at the end and snapping off the end in a straight line with as little pre- rotation as possible getting a clean snap off your tail your approach for a setup carve can be super flexible but the goal is to hold a straight line off a takeoff making sure that the last thing to leave leaf and jump is the tail of your snowboard giving you a little bit of extra snap and power the next",
        "timestamp": 73,
        "endTime": 93,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "To prepare for a frontside 180, square up to the jump, close your front shoulder, and bend your legs. This creates a strong base for generating a smooth spin.",
        "rawText": "skill you need to get in place is your windup a proper wind up for a front side spin has you square it off to a jump closing your front shoulder and adding a little bit of Bend to your legs this will give you a powerful platforms to generate snth off of you don't need much rotational power for front side 180 but it's going to be a form that you use for future spins so we're still going to",
        "timestamp": 95,
        "endTime": 115,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "Focus on landing with both feet at the same time, in a stacked position, and with a flat base or slight toe pressure. This will help you achieve a stable switch frontside 180 landing.",
        "rawText": "focus in on getting it dialed in in this video after that you're going to have to deal with the landing and the switch front side Landing is one of the hardest Landings in snowboarding a perfect front side 1880 Landing as you taking off and Landing with both feet at the same time in your stacked position with a flat base or a slight bit of toe pressure the most common Landing you'll see",
        "timestamp": 117,
        "endTime": 137,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "To land a clean frontside 180, ensure you fully rotate in the air. This will allow you to land with both feet and absorb the impact for a clean exit.",
        "rawText": "especially when learning the front one has you Landing a little bit on your heels this is happening because of under rotation or mistake in your AIS rotation but once you fully learn how to do your front side 180 you'll be able to pop up and get that clean two-footed Landing consistently what will profly help you absorb the impact of the landing and kill your rotation allowing you to ride away clean with both skills in place",
        "timestamp": 139,
        "endTime": 159,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "Focus on your heel edge and practice frontside 180s without your snowboard on, landing \"stacked\" (balanced). Then, repeat the motion with your board, popping up and landing balanced.",
        "rawText": "it's time to go and learn the front side 180 to start this set your weight onto your heel arge and just practice doing some front side 180s offing off Landing completely stacked this is the first step to learning most spins and it's really crucial for just getting used to the motion next do the same step but with your snowboard on trying to pop up and land stacked if your board tries to",
        "timestamp": 161,
        "endTime": 181,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Focus on your heel edge as you approach the slope. Shift your weight and \"scuff\" your board around to initiate the frontside 180 rotation.",
        "rawText": "keep rotating after you hit those snow that means he has too much power do a step until you can pop up and stomp your Landings now it's time to add speed into the equation get on your heel Edge and as you're going down the slope shift your weight scuffing around a front side 180 to do this you need to make sure you have pressure in your heel Edge and you want to keep doing it and you can go and",
        "timestamp": 183,
        "endTime": 203,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "To improve your Frontside 180, focus on a smooth, flowing motion to rotate. Once you're comfortable, add height by extending your legs and jumping forward as you rotate, using a bump or small feature for extra air.",
        "rawText": "eliminate the amount of scuff making the motion as smooth as possible resulting in a fluent 180 into your stacked position after that start adding some height into your 180s do the same motion but with extending your legs jumping forward into the 180 this is easier if there a little bump or Nook that you can go and catch a little bit of extra air off going down the slope what's",
        "timestamp": 205,
        "endTime": 226,
        "duration": 21
      },
      {
        "stepNumber": 11,
        "summary": "Focus on maintaining heel edge pressure as you pop, and make sure your tail is the last part of your board to leave the takeoff to generate power and height for your frontside 180.",
        "rawText": "important here is making sure you're maintaining your heel pressure while popping up and rotating after that in order to elevate your front side 180s to the next level go and put an emphasis on having your tail being the last part of your board to leave the takeoff this will go and help you get a naap fully utilizing your snowboard to generate power and height it's not too noticeable on flat ground but once you do it off a",
        "timestamp": 227,
        "endTime": 248,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "Find a side hit where you can approach on your heels to practice the frontside 180. This approach will help with control and rotation.",
        "rawText": "jump it will be a massive Game Changer that will give you more control in the air and more control over your rotation the end result of hitting all these steps is a completed 180 Landing fully stacked with good flat based pressure letting you ride away switch clean once you have these steps in place your next stage is a side hit try to find a side hit that lets you approach on your heel",
        "timestamp": 250,
        "endTime": 270,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "As you ride off the jump, keep your shoulders closed off until the moment of takeoff, then open your upper body to face the jump as your tail leaves the edge. Focus on timing the opening of your upper body with your jump.",
        "rawText": "Edge the only thing you're going to need to change for this is your timing now since you're riding off a jump you need to make sure your timing is in line with your takeoff When approaching the side hit keep your shoulder squared and closed off to the jump and as you ride off the Jump open your upper body having your upper body forward facing the jump as your tail snaps off the Ed keep doing",
        "timestamp": 272,
        "endTime": 292,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "If you're ready to learn a frontside 180 and have the fundamentals down, the only adjustment you need to make when hitting a jump is adding a setup carve. Match the carve to the rotation.",
        "rawText": "but are almost impossible to notice in yourself so come sign up for snow addiction you can get a one Monon free trial and we can give you the coaching you need to improve your riding today if you're feeling good and have all the previous steps for a front side 180 in place it's time to take it to a park jump when hitting a jump the only thing you need to change is adding in a setup C when doing your setup carve you want to make sure that you're matching the",
        "timestamp": 340,
        "endTime": 361,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "When approaching the takeoff, stay centered on your board to maintain balance. Time your rotation so you initiate the throw just as your tail leaves the lip.",
        "rawText": "angle of the takeoff making sure you're not leaning forward or back instead staying stack in the center of your snowboards when riding up the lip this centered Position will help you maintain balance giving you a lot more control when in the air next is timing you want to finish your throw as your tail leaves the takeoff front side 180s don't require much rotation this means you want to limit the range of motion of",
        "timestamp": 362,
        "endTime": 383,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "Focus on an upward motion as you release your wind-up. This centers your weight over the balls of your feet, helping you stay light on your edge and delaying the snap for better control during the frontside 180.",
        "rawText": "your snap a good way to do this is by making your momentum go up while releasing your wind up you've been doing this subconsciously during the other steps by putting emphasis on this motion you'll achieve two things your weight will be more centered over the balls of your feet helping you stay lighter on your Edge it will also delay your snap helping you make sure your board is in",
        "timestamp": 385,
        "endTime": 405,
        "duration": 20
      },
      {
        "stepNumber": 17,
        "summary": "To get a controlled Frontside 180, add upward momentum to your rotation as your tail leaves the lip of the jump. This will help you maintain control in the air and land smoothly on both feet.",
        "rawText": "contact with the jump up until your tail leaves the lip of a takeoff plus by adding upward momentum to your rotation you'll have more control in the air allowing you to get more steezy and even add a grab if you want a proper takeoff will set you up perfectly for that two footed stomped Landing what is going to be really crucial in feeling confident with your front side 180s there are a",
        "timestamp": 406,
        "endTime": 426,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "To improve your Frontside 180 landings, actively finish the rotation of your upper body throughout the spin. This helps ensure a complete 180, preventing you from landing on your heel edge.",
        "rawText": "few things you can do outside of Pop to improve your Landings first upper body positioning by making sure you finish rotation of your upper body you'll be able to increase the chance of Landing in a complete 180 when you under rotate a front side 180 you'll have to do what's called a heal Edge Landing this means you're landing on your heel edge meaning you won't be able to catch your toe Edge on the Landing the downside to",
        "timestamp": 428,
        "endTime": 448,
        "duration": 20
      },
      {
        "stepNumber": 19,
        "summary": "Focus on landing in a two-footed, stacked position after your frontside 180 to control the impact. This will help you land more cleanly.",
        "rawText": "landing on your heel Edge is it makes it so you can't control the impact of the landing nearly as cleanly so your goal should always be to fully rotate your spin Landing in your two-footed stacked position this will help you go and disperse the impact of a jump really cleaning up your Landings easier said been done but that is what you're aiming for on every front side 180 for recap do a setup carve switching to your heel",
        "timestamp": 451,
        "endTime": 473,
        "duration": 22
      },
      {
        "stepNumber": 20,
        "summary": "As you take off, stay centered over your board with edge pressure. Rotate your frontside 180 as your tail leaves the takeoff, land flat-based, and look up to ride away.",
        "rawText": "Edge as you start to go up the takeoff stay centered over your board with a bit of edge pressure finishing your snap as your tail leaves for take off rotate your front side 180 land flat-based fully rotated look up and ride away I hope this video gave you a better understanding of how to front side 180 because we will be using this as a building block to handle every future front side trick starting with 360 540",
        "timestamp": 475,
        "endTime": 496,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "backside-360",
    "trickName": "Backside 360",
    "aliases": [
      "bs 360",
      "back 360",
      "backside three sixty",
      "back one"
    ],
    "videoId": "wcz_QMCy2-s",
    "videoTitle": "How To Backside 360 On A Snowboard",
    "totalDuration": 927,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To set up for a backside 360, get into a \"stacked\" position: align your body over your legs with a straight back and powerful, engaged knees (don't let your knees bow in or out).",
        "rawText": "you [Music] the first place to start with any backside spin is with finding your stacked position being stacked is a term we use a lot in snowboarding and it's referring to this having the sight under your legs your body aligned a straight back and a powerful knee position not having your knees come in Bowie out",
        "timestamp": 28,
        "endTime": 49,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "To wind up for a backside 360, start with a straight back and slightly bent legs, opening your hips towards the takeoff. Keep your back knee straight and arms open while maintaining a strong, stacked posture.",
        "rawText": "in a very specific way for it to translate to snowboarding the basketball we're going to go over here starting with the windup the ideal backside windup has a straight back slight bending of the legs open hips towards the end of the takeoff while keeping your back knee straight letting your arms open up will keeping this straight stacked strong posture the better you",
        "timestamp": 72,
        "endTime": 92,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "Focus on training the fundamental \"wind up\" motion with a straight back, avoiding bending forward or leaning back, to increase your range of motion and the power available for your backside 360.",
        "rawText": "get at this motion the more you'll be able to increase the range of motion used increasing the power that you can use off the lip backside 360s don't take very much power they're not going need to go and make this motion very exaggerated but you want to train it and get the fundamentals of having the straight back and having the wind up without compromising bending forward or leaning back uh awesome tip that Pro",
        "timestamp": 94,
        "endTime": 114,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "To maintain a strong and stable base for your backside 360, focus on flexing your glutes during your wind-up. This will help keep your core tight and stacked, improving your control throughout the spin.",
        "rawText": "snowber Darcy sharp gave me is use your glutes for this it's really hard to break up a waist if you tighten your glutes so whenever you're doing your wind ups focus on flexing your glutes a little bit helping to keep your core tight and stacked in that strong position this is going to be the base for every backside spin so go and keep working on it and keep dialing in on and off the slopes next up is snap you're",
        "timestamp": 118,
        "endTime": 139,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "Focus on keeping your spin on a level plane, avoiding throwing your body up or down. Time your rotation so you hit a neutral position as your board's nose reaches the end of the takeoff.",
        "rawText": "trying to go and keep your snap on a consistent plane of rotation making sure that you're not throwing down or up continuing your spot in a smooth constant line next is timing you want to be going and hitting a neutral position as your nose reaches the end of a takeoff the bigger your backside spins the more you'll then go and extend that",
        "timestamp": 141,
        "endTime": 162,
        "duration": 21
      },
      {
        "stepNumber": 6,
        "summary": "To keep your balance and see your landing, avoid looking over your shoulder. Instead, focus your spot elsewhere to maintain stability and prevent your body from over-rotating.",
        "rawText": "motion but for a back free you'll just be going and holding that position and popping off that last little bit another super important step for your backside spins is your spot it can feel really natural to spot looking over your shoulder but this will go and make you you extend your Coro throwing you off balance and losing your stability it also makes it so you don't see a knuckle",
        "timestamp": 164,
        "endTime": 184,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "When spinning a backside 360, spot your landing by looking under your back arm. This helps you control the rotation and land with your body stacked in a tight position.",
        "rawText": "as soon but by shifting your gaze to underneath your arm you're going to be able to beef your body stacked in a tight position SP the knuckle sooner allowing you should go and control the rotation and know what's going on sooner than an over the shoulder spot on any backside spin make sure your spot is underneath your back arm lastly is Landings you always want to be landing",
        "timestamp": 186,
        "endTime": 206,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "Practice the \"wind up, snap, spot, and landing\" key points of the Backside 360 on a trampoline to build the necessary muscle memory and technique before attempting it on snow. Focus on these points to improve your rotation control.",
        "rawText": "sure you have good controlled bounces before going and adding rotation after that try to hit the same four key points your wind up your snap your spot and your Landing by practicing these four points on trampoline you'll have a lot more success when bringing them back over to snow with B skills in place the next stage to improve this is",
        "timestamp": 229,
        "endTime": 249,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "After fully extending your body for the trick, focus on bringing your legs up towards your body to maintain control and power. Avoid cutting your extension short, as this will reduce your control.",
        "rawText": "bringing your leg to your body bringing your legs up is an important part of every trick on a snowboard you're aiming to start bringing your legs up after your full extension if you cut your extension short you'll lose control and power for right extension will bring your legs off right to you but too little or too much will disconnect your body making it so you have to use your",
        "timestamp": 251,
        "endTime": 271,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "When practicing your backside 360s, avoid grabbing your board too early, as it can hinder your leg extension. If you do grab, use a mute or method grab.",
        "rawText": "muscles instead of the momentum of a jump to bring your legs up I'd recommend not grabbing your snowboard when practicing your backside 360s because reaching to grab your snowboard early can make it so you don't do your full extension making it so it's harder to bring your legs up in the long run if you decide you need to grab your snowboard I recommend using the mute / wetle grab this is the best grab for practicing your backside Spin and will",
        "timestamp": 272,
        "endTime": 293,
        "duration": 21
      },
      {
        "stepNumber": 11,
        "summary": "As you approach the jump, setup carve on your heel edge. Then, transition to your toe edge as you pass the lip, maintaining a straight line off the takeoff.",
        "rawText": "be super useful once we move on to Backside 720s later on in the series with both skills in place it's time to start bringing this trick to the slopes starting with your setup carve a textbook setup carve as you approaching the jump on your Keel Edge transitioning to your tow Edge as you pass a spoon of the jump holding a straight line off the takeoff until your tail snaps off the",
        "timestamp": 295,
        "endTime": 315,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "To set up for your backside 360, maintain a stacked body position and ensure a straight takeoff to eliminate drifting and maintain control. Perfect your edge pressure and timing as you prepare to rotate.",
        "rawText": "end setup carvs are a super flexible motion but there is a few things you're trying to achieve with every setup car first a stacked body position second a straight takeoff third Edge pressure four timing your stacked body position is the base for all tricks a straight takeoff removes drifting giving you better control and less chance to hit",
        "timestamp": 318,
        "endTime": 338,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "To avoid breaking at the waist and losing your stack, focus on maintaining your body position and don't get on your toe edge too early during your setup carve. This ensures you maintain power and proper form for the 360.",
        "rawText": "the knuckle Edge pressure lets you not catch an edge timing lets you leave off your tail getting maximum power the main mistake you can make on your setup carb is breaking at the waist breaking at the waist refers to losing your stack position and crumpling at the hips this can be caused by a few thing most commonly getting on your toe Edge much too soon the longer you hold your tow",
        "timestamp": 340,
        "endTime": 360,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "Find a mellow slope (like a cat track or green run) and practice your setup carve. Maintaining a strong, tall body position will help you avoid leaning forward and breaking at the waist when you eventually hit the jump.",
        "rawText": "Edge the harder it will be to hold your strong tall body position making it more likely you start to lean forward resulting in Breaking at the waist setup cars are one of the things you really want to get in place before going off the Jump a great way to practice this is just on the slope find a super mellow pitch slope VI a cat track or a green run and practice your setup car trying",
        "timestamp": 362,
        "endTime": 383,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "To learn a backside 360, focus on these four key points: stacked body position, straight takeoff, edge pressure, and timing. Start by traversing across the slope on your toe edge to get a feel for the rotation.",
        "rawText": "to hit the four key points your stacked body position a straight takeoff Edge pressure and timing both are the four main points you're trying to improve when doing this training exercise with those in place it's time to get spinning the first backside 360 you can do is just traversing across the slope to do this get on your tow Edge going along the",
        "timestamp": 386,
        "endTime": 406,
        "duration": 20
      },
      {
        "stepNumber": 16,
        "summary": "When popping your backside 360, maintain a stacked position throughout the rotation. Aim to land smoothly and continue traversing across the slope without carving back up the hill.",
        "rawText": "slope then pop a 360 you're trying to hold your stack position and hit before key Point wind up snap spot Landing you want to get these 360s to a point where you can land stacked and continue with Traverse along the slope when doing this Traverse it's important to not be putting too much pressure into your Edge causing you to carve back up the hill",
        "timestamp": 407,
        "endTime": 428,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "Practice maintaining consistent edge pressure on a downward slope while on your toe edge to get a feel for the balance needed before attempting the backside 360. Focus on holding the edge without turning upwards.",
        "rawText": "you want slight Edge pressure that lets you grip the snow but doesn't start turning you upwards if you're struggling with maintaining that constant Edge pressure and you're digging in and going up the hill practice holding your Edge pressure just on a downward slope find a run where you feel comfortable holding a straight line and this practice getting on your tow edge trying to hold that little bit of edge pressure but without",
        "timestamp": 430,
        "endTime": 451,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "Focus on backside 360s *downhill* to build edge pressure, wind-up, and snap in an awkward position. This will greatly improve your ability to do backside 360s off a jump.",
        "rawText": "digging in and starting to turn the next stage is doing your backside 360s going downhill this is actually way harder than doing a backside 360 off a jump but it will teach you how to maintain your Edge pressure well generating your wind up and snap in an uncomfortable position what going to pay massive dividends when you go to take your backside 360s off a park jump you're trying to hit with five key points setup wind up snap spot",
        "timestamp": 453,
        "endTime": 474,
        "duration": 21
      },
      {
        "stepNumber": 19,
        "summary": "To increase your snap and torque for a backside 360, focus on letting your tail be the last part of your board to touch the snow upon landing. Practice these steps gradually throughout the season.",
        "rawText": "Landing you want your tail to be the last part of your board making contact on the snow actively making sure that you're leaving off your tail will drastically increase the amount of snap and torque if you can get off your snowboard these steps will take a little bit of time to master so i' recommend just spreading them out through with season of riding instead of just going up on the mountain and spending all day grinding it just do a few free 60s when",
        "timestamp": 478,
        "endTime": 498,
        "duration": 20
      },
      {
        "stepNumber": 20,
        "summary": "If you're feeling nervous about a backside spin, revisit the fundamental skills by practicing backside 360s. Use this to dial in your form and build confidence.",
        "rawText": "getting off a chair heading to the park just adding them in where you can these are the fundamental skills you'll be using on every backside spin even now I like to use these backside 360s when I'm feeling nervous about doing like a dum back p a back seven you name it if I'm feeling nervous about my backside form I go back to these steps and dial them in because I'm confident if I can perform",
        "timestamp": 501,
        "endTime": 521,
        "duration": 20
      },
      {
        "stepNumber": 21,
        "summary": "Take your backside 360 to a small jump, like a rail takeoff. When practicing off a rail, be mindful of others and avoid taking off at spots primarily used for rails.",
        "rawText": "well as well I'll be able to translate that to off the Jump now that we have all those in place it's time to take your backside 360 to a jump the ideal jump is the smallest jump you can find rail takeoffs work great for this but if you're utilizing a rail takeoff in your training make sure that you're not getting in anyone's way ra rail takeoffs are primarily used for ra rails so do not be taking off at a spot that would",
        "timestamp": 522,
        "endTime": 544,
        "duration": 22
      },
      {
        "stepNumber": 22,
        "summary": "To land a backside 360 smoothly, focus on spotting over your shoulder to maintain a constant rotation, and aim to land fully rotated with your upper and lower body stacked on the balls of your feet. This completes the spin.",
        "rawText": "spin off it you're trying to avoid drifting breaking at the waist and spotting over your shoulder with the end goal being a constant smooth rotation Landing you in your stacked position that means Landing in on the balls of your feet completely rotated with your lower and upper body we call this finishing the trip and you'll want to be able to just finish your backside 360 before moving on to bigger features or",
        "timestamp": 568,
        "endTime": 590,
        "duration": 22
      },
      {
        "stepNumber": 23,
        "summary": "To avoid landing on your heels and under-rotating a backside 360, maintain your balance throughout the spin. Be confident with your approach speed and don't break at the waist during takeoff.",
        "rawText": "indication that something went slightly wrong at some point during the rotation a few things that commonly cause heel Edge Landings are breaking at the waste off a takeoff this sets you unbalanced and makes your spins harder to control not being confident with the speed of the the jump this can lead to under rotating and whenever you under rotate a back threee 7 10 Etc you need to land on your heels to not catch your tow Edge",
        "timestamp": 614,
        "endTime": 636,
        "duration": 22
      },
      {
        "stepNumber": 24,
        "summary": "To land a backside 360, make sure your takeoff is solid and that you have a strong, stacked position. Find a jump that's the right size for you, ideally between 5 and 10 feet.",
        "rawText": "these mistakes all have the trend of being dictated by your takeoff and that's why it's so important to build up your fundamentals and get a strong stack position off your takeoff and with your snaps after you have all view sets in place it's time to find a proper size jump I'd recommend anywhere from 5 ft to 10 ft but it really depends on what jumps you have at your local Resort one of the most important things you're",
        "timestamp": 639,
        "endTime": 660,
        "duration": 21
      },
      {
        "stepNumber": 25,
        "summary": "Look for a jump with a moderate amount of \"kick\" at the lip  enough to help you rotate, but not so much that it throws your body off balance. Avoid jumps with excessive kick to prevent spinning out and losing control during your backside 360.",
        "rawText": "looking for is making sure the jump doesn't have too much kick kick on a jump refers to that last bit of um at the lip a little bit of kick is nice because it'll help row your legs up to you and give you more power of your rotation but too much kick will want to break you out the waist causing you to go and spin out and cause these mistakes that we've been going over that's why a kicky jump is one of the number one",
        "timestamp": 661,
        "endTime": 682,
        "duration": 21
      },
      {
        "stepNumber": 26,
        "summary": "Get comfortable with straight airs and the jump itself before attempting a backside 360. This helps avoid hitting the knuckle or going too deep, setting you up for a successful spin.",
        "rawText": "enemies of learning backside spins the two biggest risks you're taking when hitting a jump are hitting the knuckle and going too deep that's why it's super crucial to lock in your straight airs and get really comfortable with a jump you're hitting before trying to spin it after getting a feel for the jump all you need to do is apply the skills we've been working on this video to the jump itself the bigger the jump the more you",
        "timestamp": 683,
        "endTime": 704,
        "duration": 21
      },
      {
        "stepNumber": 27,
        "summary": "As you're transitioning from your heel edge to toe edge at the bottom of the jump, keep your eyes on the takeoff and finish your snap as your board leaves the lip. This will help you control the rotation in the air.",
        "rawText": "will need to slow down your motion and snap because you'll have more air time you need to control but other than that the fundamental principles are exactly the same for your setup carve you want to switch from your heel Edge to your toe Edge at the bottom of the jump holding your eyes on the takeoff as your board starts to leave a lip your upper body should be close to a stacked position finishing your snap as your",
        "timestamp": 706,
        "endTime": 727,
        "duration": 21
      },
      {
        "stepNumber": 28,
        "summary": "To learn a backside 360, focus on a strong takeoff and a powerful snap from the board, as these are the foundation for all backside spins. Practice perfecting the backside 360, as it will improve all other backside spins.",
        "rawText": "tail leaves the take off hopefully resulting in your first proper backside 360 backside 360s are the base for every single backside spin so it's really important to take the time and dial them in making sure you got your strong takeoff your strong snap and just overall the complete package because if you can lock in a perfect backside fre it's going to make every single backside",
        "timestamp": 728,
        "endTime": 749,
        "duration": 21
      },
      {
        "stepNumber": 29,
        "summary": "To improve your backside 360, focus on a straight takeoff, maintaining a stacked body position as you leave the lip, and landing in a stacked position. Practicing this will refine your form for bigger spins.",
        "rawText": "spin so much easier in the future this is the trick I go and practice the most and use to refine my form and I highly suggest you do the same if you have Ambitions of doing 540s and Beyond what to look for you want you have a straight line off the takeoff a stacked body position leaving the lip at under theh shoulder spot finish with a trick with your stacked landing position you might",
        "timestamp": 751,
        "endTime": 772,
        "duration": 21
      },
      {
        "stepNumber": 30,
        "summary": "Focus on solidifying your backside fundamentals: ensure good takeoffs, controlled airtime, and clean landings in a stacked position before attempting a backside 360.",
        "rawText": "but confident is my vibe what I like to do is break it down are my takeoffs good am I feeling in controlling the air am I Landing clean and in my stacked position once you get all the fundamentals be covering this video in place and have a strong backside 360 it's going to be time to start pushing yourself and expanding because with the backside 360 your backside fundamentals will be",
        "timestamp": 886,
        "endTime": 907,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "frontside-360",
    "trickName": "Frontside 360",
    "aliases": [
      "fs 360",
      "front 360",
      "frontside three sixty"
    ],
    "videoId": "dLZwlLgohFw",
    "videoTitle": "How To Frontside 360 On A Snowboard",
    "totalDuration": 585,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To land a frontside 360, you'll need a good setup carve, a consistent spot to look at, and the ability to ride blind. Practice these three essential skills to master the trick.",
        "rawText": "hey snow addiction Tavis here and in this video I'm going to teach you how to front side [Music] [Applause] [Music] [Applause] [Music] [Applause] 360 for a front side 360 you will need three essential skills your setup carve your constant spot and your blind",
        "timestamp": 0,
        "endTime": 22,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "When approaching the jump for a frontside 360, keep your body \"closed off\" by keeping your shoulders facing towards the jump. This will set you up for a stronger rotation.",
        "rawText": "Landing it's combining these free skills that will give you a powerful strong front free to build off of in this video I'll be showing you what these free techniques are and how to train them starting with your setup carve there is two things you're trying to dial in on every setup carve first you're trying to keep your body closed off to the jump this means when you're approaching the jump you want you have your shoulder",
        "timestamp": 25,
        "endTime": 46,
        "duration": 21
      },
      {
        "stepNumber": 3,
        "summary": "To generate rotation for a frontside 360, wind up by turning your hips slightly towards your snowboard's tail before the takeoff. Avoid opening your body towards the takeoff, as this limits rotation and shifts your weight to your heels.",
        "rawText": "rotated behind you and have your hips slightly turned towards your tail this is what's called wind up and it's how you generate rotation on a front side spin a common mistake on front spins is opening your body towards the takeoff this opened hip position limits your range of motion making it harder to generate your spins it also shifts your weight onto your heels making it harder",
        "timestamp": 48,
        "endTime": 69,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "To land a frontside 360, stay stacked and aligned over your board, focusing on keeping your shoulders closed rather than opening your hips towards the jump. This will help you maintain balance and generate the necessary power.",
        "rawText": "to keep centered over your board a front side 360 doesn't take much power so you don't need to make this motion super exaggerated instead just focus on keeping stacked and aligned you want to avoid having your hips open towards the jump so by consciously going and shifting your shoulders closed and keeping stacked over your board you'll be in the ideal position to generate power on your front side free second you",
        "timestamp": 71,
        "endTime": 91,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "Minimize scrubbing (rotating your board before leaving the jump) as you approach the takeoff. Aim for a straighter line to maximize your power and airtime for a better frontside 360.",
        "rawText": "are trying to leave off a takeoff in as straight of a line as possible you can do a little bit of scrub but you don't want too much scrubbing is when you preent rotate off a jump having your board rotate the way you're spinning while leaving off the lip a little bit of this is okay but too much is going to go and limit the amount of power you can get off the board making you get less air and less rotation wear a straighter",
        "timestamp": 94,
        "endTime": 114,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "When taking off for your frontside 360, focus on snapping off your tail to gain height and set the correct arc. Keep light on your heels to aid in this.",
        "rawText": "takeoff where you're really snapping off your tail is going to give you way more height and set you on the proper Arc of a jump making the whole trick come together so a little bit of scrub is okay but you're trying to limit it as much as physically possible and the better you get at this the better your front freeze and front side takeoffs will be overall a good way to help with this is by keeping light on your heel",
        "timestamp": 117,
        "endTime": 137,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "To prepare for a frontside 360, maintain heel edge pressure on the approach to the jump, but avoid overdoing it, which can cause unwanted rotation. Instead, hold toe pressure until you reach the bottom of your carve.",
        "rawText": "Edge you want a little bit of heel Edge pressure the whole time you're going up the takeoff of a jump but too much heel pressure will make you start digging in and turning off a jump causing drift and making your board rotate before you're snapping your spin this lessens the amount of power and height you get off a jump making your rotation harder to control on an Ideal setup carve you hold tow pressure until you reach the bottom",
        "timestamp": 139,
        "endTime": 160,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "As you approach the takeoff, swap to your heel edge, keep your body closed off, and begin your spin. Finish the snap as your tail leaves the lip of the slope.",
        "rawText": "of a takeoff then you swap to your heel Edge keeping your body closed off start to frill your spin as you reach around halfway up the takeoff finishing your snap as your tail leaves the lip you don't need to be hitting jumps in order to train your setup card just going down a mellow pit slope if you go in practice switching from your toe Edge to your heel Edge winding up and snapping off of",
        "timestamp": 162,
        "endTime": 182,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Focus on a \"closed off\" takeoff with light heel pressure and a snap that centers you over your tail. This helps with timing and edge pressure for a controlled spin.",
        "rawText": "the imaginary takeoff would do a lot to help you figure out your timing and Edge pressure what you're trying to achieve with this is that closed off takeoff that light heel pressure and a snap that has you centered over your tail making it so you'd leave off in a stack position once you have your setup carve it's time to learn how to control your spin in the air the most crucial step",
        "timestamp": 185,
        "endTime": 205,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "Focus on a constant spot: lock your eyes on the knuckle of the jump as soon as possible and maintain your gaze as you rotate. This constant focus will help guide your rotation.",
        "rawText": "for this is figuring out your spot spotting refers to spotting your Landing for a front side 360 you want to do what's called a constant spot this is when you lock your eyes on a point in the snow and your body rotates around as you keep your eyes locked on that point to do this you want to spot the knuckle of the jump as soon as possible the best way to go about this is spotting under",
        "timestamp": 208,
        "endTime": 229,
        "duration": 21
      },
      {
        "stepNumber": 11,
        "summary": "Your summarized tip here: Keep your vision focused downwards, spotting the knuckle of the jump under your arm throughout the rotation to maintain control and visualize your landing.",
        "rawText": "your arm spotting under your arm keeps your vision pointed downwards letting you go and spot the knuckle of the jump what's going to be really crucial for knowing where you are in the air and controlling your rotation and seeing your Landing versus when you try to spot over your shoulder you need to spot and try look around throwing your body out of whack and not letting you go and get",
        "timestamp": 232,
        "endTime": 252,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "Focus on a spot on the snow ahead of you and rotate a frontside 360 while keeping your eyes locked on that spot for as long as possible. This will help you learn the proper spotting technique and initiate the spin smoothly.",
        "rawText": "that constant one motion spot that is really crucial for smooth front side 360s the best way to practice this is just on the snow pick a point on the snow ahead of you and rotate a front side 360 as you hold your vision on that point you're trying to see this point as long as possible without needing to move your head this teaches you how to spot downwards as well as training the",
        "timestamp": 254,
        "endTime": 274,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "When landing a frontside 360, finish your spin with your back facing the landing. This \"blind landing\" requires you to prepare for landing without seeing the landing spot.",
        "rawText": "ability to rotate around your spot as well as having the added advantage of setting up perfect for a blind landing on front side 360s you go and finish your spin with your back to the landing of the jump this is what we call Landing blind and whenever you land blind you want to utilize What's called the blind Landing blind Landings are when you land",
        "timestamp": 276,
        "endTime": 296,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "Look uphill towards the landing spot as you spin. This allows you to slow your rotation and land in a stable position, preventing a heel edge slip.",
        "rawText": "looking uphill to towards the knuckle this helps you stop your Rotation by letting you slow down your rotational energy through the landing if you land looking forward on a front side 360 and haven't fully stopped your rotation in the air you are likely to slide to your heel Edge slipping out from your spin your constant spot will actually set you up perfect in that blind landing position because your eyes will be",
        "timestamp": 298,
        "endTime": 319,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "As you pass the knuckle during your frontside 360, shift your vision uphill to prepare for a blind landing. To stick the landing, dig in your toe edge to grip the snow and stop your rotation.",
        "rawText": "locked on the knuckle the whole time as you pass the knuckle your vision will shift uphill making you land in this blind landing position last thing you need to do to finish a blind Landing is to dig in your tow Edge digging in your Edge will make it so you grip the snow helping you stop your rotation and ride away clean there is a lot of little mistakes that can happen on front side 360 that we can't cover in this video",
        "timestamp": 321,
        "endTime": 342,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "To control your rotation at the end of a frontside 360, use counter-rotation: rotate your upper body in the opposite direction of your spin, and then center your core to stop the spin. This will help you slow down and land your trick.",
        "rawText": "counter rotation counter rotation is when you have your upper body rotate separately from your lower body and then you tighten your core bring everything back centered at the same time you stop your constant Rotation by counter rotating you slow down your constant speed of rotation and this is why using counter rotation should be saved into the end of your spins since it will be",
        "timestamp": 411,
        "endTime": 432,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "When in the air, bring your legs up towards your body to maintain balance and give yourself more room to control your rotation. This helps you stomp your spins.",
        "rawText": "very hard to keep rotating after using counter rotation using it to rotate and kill your rotation is a great way to help stomp your spins whenever you're hitting a jump on a snowboard it's really important to bring your legs up to your body this helps you go and maintain your balance in the air and gives you more room to play with for actual rotation in order to bring your legs up you need to make sure you're",
        "timestamp": 434,
        "endTime": 454,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "To get your legs up for a frontside 360, focus on getting a strong \"pop\" off the jump, which will naturally bring your legs up towards your body as you spin. Avoid actively trying to lift your legs before you've fully launched off the jump.",
        "rawText": "getting a good full pop off a jump because it's visible pop that will go and bring your legs up to your body as you set your spin you want to avoid the feeling of actually trying to lift your legs up to you before fully snapping off a takeoff when you get a good pop up a takeoff it'll naturally throw your legs up to your body helping you bring your legs up when spinning your front side",
        "timestamp": 456,
        "endTime": 476,
        "duration": 20
      },
      {
        "stepNumber": 19,
        "summary": "Keep your arms slightly away from your body and use your front arm to lead the rotation, following through with your back arm. This allows for a more fluid spin.",
        "rawText": "spins you want to watch for a few Cru body position mistakes the main one being letting your arms get caught up on your rotation this goes and restricts you and makes it so you can't use your shoulders to lead your rotation you always want to have your arms slightly away from your body letting you go and lead with your front arm and follow through with your back arm it's also",
        "timestamp": 477,
        "endTime": 497,
        "duration": 20
      },
      {
        "stepNumber": 20,
        "summary": "Keep your knees in a stacked, straight line and arms away from your body to maintain stability and control while spinning and landing a frontside 360. This position allows for better flexibility in the air.",
        "rawText": "important to make sure your knees aren't coming together you want your knees to be in your stacked straight line position because this will just give you a much more stable and balanced position to spin in and land in by making sure your knees aren't coming together and your arms are away from your body you'll have a lot more control and flexibility when in the air you can do front side 360s anywhere on the mountain or anywhere off the mountain we highly",
        "timestamp": 499,
        "endTime": 521,
        "duration": 22
      },
      {
        "stepNumber": 21,
        "summary": "Practice the frontside 360 motion on a trampoline or flat ground at home to get the feel of the rotation before attempting it on snow. This will help you understand the movement pattern.",
        "rawText": "recommend before try it on snow going to a trampoline and playing around with it the motion for a front side 360 is very similar on trampoline to snow we also make snowboard addiction trap boards what can give you a more accurate snowboard feel when on the trampolines but if you don't have access to a trampoline or one of her boards you can do front freeze just at home on flat ground and it's going to really help you",
        "timestamp": 523,
        "endTime": 545,
        "duration": 22
      },
      {
        "stepNumber": 22,
        "summary": "As you approach the jump, initiate a slight heel-edge carve, then open your upper body as you throw your spin, bringing your legs up to spot the landing as you rotate.",
        "rawText": "dial in this rotation recap a slight setup carve switching to your heel Edge as you start going up the lip a closed off upper body opening up as you throw your spin a straight edge line as you leave the lip off your tail Bing the knuckle of the jump as you bring your legs up locking in your spot and rotating around it putting down the landing in a blind landing position",
        "timestamp": 547,
        "endTime": 568,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "As you land after rotating, dig in your toe edge to hold the blind landing, look up, and then ride away clean.",
        "rawText": "digging in your tow Edge as you hold the blind Landing after your rotation has stopped look up and ride away clean I'm T us from snowb addiction and our goal is to improve your riding",
        "timestamp": 571,
        "endTime": 585,
        "duration": 14
      }
    ]
  },
  {
    "trickId": "backside-540",
    "trickName": "Backside 540",
    "aliases": [
      "bs 540",
      "back 540",
      "backside five forty"
    ],
    "videoId": "tCoQ3sSYT2A",
    "videoTitle": "How To Backside 540 On A Snowboard",
    "totalDuration": 627,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Backside 540, focus on a constant spot by rotating your body around the knuckle. Practicing on a trampoline or with a snowboard addiction board can help.",
        "rawText": "good in order to learn a backside 540 you're going need to be able to do backside 360 and backside 180 after that the main challenge of this trick comes from learning how to spot the knuckle and letting your body rotate around that point this is what we call a constant spot the best way to practice any 540 is on trampoline and ideally with one of our snowboard addiction boards the",
        "timestamp": 22,
        "endTime": 43,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "To learn a backside 540, pick a spot, like the knuckle, and focus your eyes on it as your body rotates. Keep your head as still as possible to help maintain consistent rotation.",
        "rawText": "skills you're trying to lock in on trampoline is the constant spot with the consistent rotation to do this you need to lock your eyes on a point of a trampoline and let your body rotate around that point trying to get as little head movement as possible but ideal backside 540 as you spotting the knuckle around 270 and locking your eyes on the knuckle as your body rotates",
        "timestamp": 45,
        "endTime": 66,
        "duration": 21
      },
      {
        "stepNumber": 3,
        "summary": "Keep your arms slightly away from your body throughout the rotation, not spread out or tucked in tight, to help maintain balance during the blind landing.",
        "rawText": "around that point finishing you off in that blind landing position the form you will be using is the back free from your take off with the blind landing spot from the back one it's important to make sure you're not getting caught up on your arms by letting them come in to the center of your torso your arm should always be slightly away from your body not spread out but just slightly away so",
        "timestamp": 68,
        "endTime": 88,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "Keep your knees stacked  meaning, knees straight over your toes and not caving inwards. Maintain this strong knee position, along with keeping your arms out, for a stable and consistent rotation during your backside 540.",
        "rawText": "you're not getting caught up on your arms it's also important to make sure your knees are in a strong stack position this means you're not letting your knees cave in towards each other keeping your knees out knees straight over your toes stacked these two things are going to really do a lot to help you get a constant rotation and feel stable in the air having your arms out will let you leave the rotation with your upper",
        "timestamp": 90,
        "endTime": 111,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "To spot the landing for your backside 540, keep your gaze underneath your arm. This will help connect your upper and lower body, keeping you from being too upright in the air.",
        "rawText": "body as well as keeping your spot underneath your arm it will let you spot the knuckle much sooner let's talk a bit more about the spotting under the arm because this is a super crucial often overlooked aspect of spinning if you try to spot over your shoulder what it's going to do is disconnect your upper body from lower body making you too tall in the Torso it'll also make it so you need to look around to spot the landing",
        "timestamp": 112,
        "endTime": 133,
        "duration": 21
      },
      {
        "stepNumber": 6,
        "summary": "To achieve a smooth Backside 540, spot your landing by looking under your arm, keeping your body tight and stacked. Hold this spotting position throughout the entire rotation.",
        "rawText": "where if you shift your spot to under your arm you'll be able to go and keep your body stacked in a tight position snap look under your arm spot the knuckle right away and then hold the spot the whole time with slight change is spotting under your shoulder versus over your shoulder is one of the most crucial parts of getting a constant smooth rotation and it's one of the things that will help your riding the",
        "timestamp": 136,
        "endTime": 157,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "To maintain a constant visual spot throughout your Backside 540, shift your gaze under your arm towards the landing, rather than over your shoulder. This helps avoid \"double spotting\" which can cause brief visual blindness.",
        "rawText": "most spotting over the shoulder also causes something called a double spot a double spot is when you go spot for landing and then flick your head around again to try Spot It Again giving you a moment of blindness where our goal on a backside 540 is having a constant spot for the whole spin so by shifting your view to under your arm you'll be able to go and spot the knuckle all the way at",
        "timestamp": 158,
        "endTime": 179,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "Maintain a strong, stable form with minimal head movement throughout the rotation of a backside 180, visualizing your landing, to set yourself up for powerful backside 540s.",
        "rawText": "180 and hold that spot the whole time making sure you're not blind for any point of a rotation and you're holding a strong form the whole time with as little head movement as possible and it's visal position that will give you really powerful backside 540s it's always best to do your tricks off the smallest jump possible when learning there's two reasons for this first of",
        "timestamp": 182,
        "endTime": 202,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Learn your Backside 540 on a small jump to ensure your takeoff and landing are precise. This forces you to focus on proper form and technique, reducing the risk of errors.",
        "rawText": "all it eliminates a lot of risk of hitting a bigger jump second the most crucial part is it makes it so you can't cheat your form the more air you have the more you'll be able to get away with but on a small jump you'll need to make sure your takeoff spot and Landing are absolutely dialed in in order to fully do the trick this is why it's best to learn your tricks on small jumps because",
        "timestamp": 204,
        "endTime": 224,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "Warm up with backside 360s, focusing on landing in your stacked position on the jump's sweet spot. Once comfortable, you're ready to attempt a backside 540.",
        "rawText": "then later you'll be able to transfer them to bigger jumps and bigger tricks without the same issues You' have if you started off on bigger jumps the back five is really just building off the backside 360 so warm up with a few backside 360s making sure that you're Landing in your stack position in The Sweet Spot of the jump once you do that you're ready to try a 540 use the exact",
        "timestamp": 226,
        "endTime": 246,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Use the same approach for your backside 540 as you do for a backside 360, but with slightly more power. This \"cheat spin\" allows you to finish the last 180 degrees with counter-rotation.",
        "rawText": "same approach you use on your bside 360 you'll only need to use slightly more power this is because the bside 540 are what we call a cheat spin a cheat spin means you can finish the trick with counter rotation allowing you to whip around your body an extra 180 right at the last moment your first few back FES will be like this similar to a backside",
        "timestamp": 249,
        "endTime": 270,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "Focus on the knuckle after the initial blind rotation. As you spin, keep your eyes locked on the knuckle (where the jump ends) to maintain control and style throughout your backside 540.",
        "rawText": "360 but smashing a quick counter rotated back one onto the end of a trick as you improve you'll start you have a constant rotation through the whole spin what will make your back fives more stylish and controlled backside 540s have you blind for the initial start of the spin so expect to not see a knuckle until around 270 once you see a knuckle hold your vision on it as you continue to",
        "timestamp": 272,
        "endTime": 294,
        "duration": 22
      },
      {
        "stepNumber": 13,
        "summary": "Focus on keeping your eyes looking past your back foot throughout the rotation to control your spin and maintain a stacked position for landing. Tilt your chin down as you approach the landing.",
        "rawText": "rotate around your spot if you go deep you will lose track of the knuckle this is completely okay just keep your spot uphill trying to keep your eyes looking past your back foot this will help you kill your rotation and keep your stacked position when coming into your blind Landing you want to make sure you're not leaning into your spot instead make sure you're just tilting your chin down while",
        "timestamp": 296,
        "endTime": 317,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "To land your Backside 540 successfully, stay \"stacked\" and tall throughout the rotation, especially on the landing, to absorb the impact and maintain control. Focus on a slight \"chin tilt\" rather than contorting your whole body.",
        "rawText": "keeping your body stacked and Tall this will help you fully absorb the impact while going and holding that blind landing position it's only a chin tilt so you don't need to get your body up and over into your spot the more stacked you are hitting the landing the easier it will be to absorb the impact and stop yourself from spinning out the more stacked you are on the landing the better so really go and focus in on",
        "timestamp": 319,
        "endTime": 340,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Keep your chin tilted down towards the snow to help you spot your landing. Focus on maintaining this spot as you rotate, and your ability to track the landing will improve over time.",
        "rawText": "figuring out how to tilt your chin down towards the snow without having your body follow the first few backside 540s you do you'll probably have a really hard time tracking the landing and knowing where you are in the air this is completely normal and it's something that will fade with time as long as your spot is set at the knuckle and you're training that constant spot rotation eventually you'll be able to see it more",
        "timestamp": 342,
        "endTime": 363,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "Look back uphill as you land your backside 540. This \"blind landing\" will help you track the knuckle and land smoothly.",
        "rawText": "and more until eventually you'll know exactly where you are in the air at all times there are two things that will help you stomp your backside 540s the first is your blind Landing a blind Landing refers to looking back uphill as you land this happens naturally as you go over the knuckle and continue to track the knuckle with your spot the reason why this works is because it",
        "timestamp": 364,
        "endTime": 385,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "Use counter-rotation with your lower body during the last 180 degrees of the spin to complete the Backside 540. This also helps slow down your overall rotation speed.",
        "rawText": "makes it so your upper body is rotated to towards the jump so when you land you have time to disperse that rotation without needing to generate that Force into your heel Edge the next tool you can use is counter rotation counter rotation lets you use your lower body to rotate the last 180 on a back five using counter rotation also slows down your overall rotation speed so any part of",
        "timestamp": 387,
        "endTime": 408,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "Focus on a constant spot while using counter-rotation to control your spin speed. This helps slow down your rotation, allowing you to hold the landing and ride away cleanly.",
        "rawText": "your spin after you use counter rotation will be much slower this makes counter rotation a great way to not only speed up your spin but also kill your rotation making it easier to hold your blind Landing letting you stomp and ride away the thing that makes both of these work is the constant spot because it makes it so your head's leaving your rotation letting you then catchup with your lower",
        "timestamp": 410,
        "endTime": 430,
        "duration": 20
      },
      {
        "stepNumber": 19,
        "summary": "Focus on spotting the landing knuckle under your arm throughout the rotation. This constant spot will help you rotate your body correctly and land a clean Backside 540.",
        "rawText": "body as well as holding the blind Landing as you pass the knuckle I talk about it a lot in this video but the constant spot is what will let you go and get a good 540 so really put a lot of focus into spotting underneath your arm and locking your eyes on that knuckle and figuring out the body motion to rotate around your spot the best ways to do this is on trampoline and through practice it's also the same principles",
        "timestamp": 432,
        "endTime": 453,
        "duration": 21
      },
      {
        "stepNumber": 20,
        "summary": "If you're struggling with a backside 540, practice a frontside freeze and translate the constant spotting technique you learn there. This is key to differentiating a backside 360 from a backside 540.",
        "rawText": "used on a front side 360 so if you're struggling with the constant spot go back maybe do some front side freeze and translate what you learn from back into your backside 540 because this constant spot is the difference between a bside 360 and a backside 540 recap you want to have a smooth setup car slightly stronger snap than 4 360 spotting",
        "timestamp": 455,
        "endTime": 476,
        "duration": 21
      },
      {
        "stepNumber": 21,
        "summary": "Focus on your landing: Dig your toe edge into the landing, holding the \"blind landing position\" until you've stopped spinning, then look up and ride away. Perfect your backside 360s before attempting a backside 540.",
        "rawText": "underneath your shoulder locking your eyes on the knuckle rotating around your spot digging in your toe Edge on the landing holding the blind landing position until you've fully killed your spin then look up and ride away backside 540s are super difficult if you don't have your backside 360s perfect it can be really hard to tell if your 360s are dialed in and perfect because there's so",
        "timestamp": 478,
        "endTime": 499,
        "duration": 21
      },
      {
        "stepNumber": 22,
        "summary": "After landing your first Backside 540s, practice them consistently on small jumps without grabs. Once comfortable, move to larger jumps and experiment with grabs, like the stalefish, to aid your rotation.",
        "rawText": "your riding once you've landed your first backside 540 it's time to start grinding them out do a bunch of them on little jums with no grabs and once you're feeling comfortable you can start bringing them to bigger jumps and adding grabs my personal favorite grab for the backside 540 is the stalefish because it makes it so my back arms leading the rotation helping me get the spin around and it just feels right there as a war",
        "timestamp": 546,
        "endTime": 567,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "To learn a proper backside 540, ensure your backside 360s are solid. Focus on a strong, stacked takeoff with no drift and a powerful snap off the tail.",
        "rawText": "warning back fives are where a lot of people Max up for snowboarding tricks this is because there's a lot of way to cheat a backs side 540 and make it work but it won't then translate to bigger tricks like backside 720s so if you really want to get a proper backside 540 don't neglect your backside 360s be truthful of yourself and make sure you're getting that strong stack takeoff no drift and Powerful snap of a tail",
        "timestamp": 569,
        "endTime": 590,
        "duration": 21
      },
      {
        "stepNumber": 24,
        "summary": "Focus on mastering backside 360s first. This strong foundation will make learning the Backside 540 much easier.",
        "rawText": "because it's that strong backside 360 Foundation that's going to be crucial for back f and back sevens so if you are honestly trying to improve as a rider spend most of your time on backside 360s and then once you do you'll be able to Backside five much easier after that it's time to start grinding your back FES and grinding your back freeze getting those super powerful takeoff that let you",
        "timestamp": 594,
        "endTime": 614,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "backside-540",
    "trickName": "Backside 540",
    "aliases": [
      "bs 540",
      "back 540",
      "backside five forty"
    ],
    "videoId": "tCoQ3sSYT2A",
    "videoTitle": "How To Backside 540 On A Snowboard",
    "totalDuration": 627,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Backside 540, you should first master Backside 360s and Backside 180s. Then, practice maintaining a constant visual focus on the jump's takeoff point (\"knuckle\") as your body rotates.",
        "rawText": "good in order to learn a backside 540 you're going need to be able to do backside 360 and backside 180 after that the main challenge of this trick comes from learning how to spot the knuckle and letting your body rotate around that point this is what we call a constant spot the best way to practice any 540 is on trampoline and ideally with one of our snowboard addiction boards the",
        "timestamp": 22,
        "endTime": 43,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "When practicing a backside 540, spot the knuckle around the 270-degree point and lock your eyes on it as your body rotates. This helps maintain consistent rotation and minimize head movement.",
        "rawText": "skills you're trying to lock in on trampoline is the constant spot with the consistent rotation to do this you need to lock your eyes on a point of a trampoline and let your body rotate around that point trying to get as little head movement as possible but ideal backside 540 as you spotting the knuckle around 270 and locking your eyes on the knuckle as your body rotates",
        "timestamp": 45,
        "endTime": 66,
        "duration": 21
      },
      {
        "stepNumber": 3,
        "summary": "Keep your arms slightly away from your body throughout the rotation to maintain balance and avoid getting caught up in the spin. This helps prepare for a blind landing.",
        "rawText": "around that point finishing you off in that blind landing position the form you will be using is the back free from your take off with the blind landing spot from the back one it's important to make sure you're not getting caught up on your arms by letting them come in to the center of your torso your arm should always be slightly away from your body not spread out but just slightly away so",
        "timestamp": 68,
        "endTime": 88,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "Keep your knees stacked  meaning, straight over your toes and not caving inwards  and keep your arms out to maintain a constant, stable rotation during the Backside 540.",
        "rawText": "you're not getting caught up on your arms it's also important to make sure your knees are in a strong stack position this means you're not letting your knees cave in towards each other keeping your knees out knees straight over your toes stacked these two things are going to really do a lot to help you get a constant rotation and feel stable in the air having your arms out will let you leave the rotation with your upper",
        "timestamp": 90,
        "endTime": 111,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "Keep your spot (the landing) under your arm to connect your upper and lower body and spot the landing sooner. Avoid spotting over your shoulder.",
        "rawText": "body as well as keeping your spot underneath your arm it will let you spot the knuckle much sooner let's talk a bit more about the spotting under the arm because this is a super crucial often overlooked aspect of spinning if you try to spot over your shoulder what it's going to do is disconnect your upper body from lower body making you too tall in the Torso it'll also make it so you need to look around to spot the landing",
        "timestamp": 112,
        "endTime": 133,
        "duration": 21
      },
      {
        "stepNumber": 6,
        "summary": "To keep your rotation smooth in a Backside 540, spot the landing by looking under your armpit as soon as you snap. Hold that spot throughout the rotation.",
        "rawText": "where if you shift your spot to under your arm you'll be able to go and keep your body stacked in a tight position snap look under your arm spot the knuckle right away and then hold the spot the whole time with slight change is spotting under your shoulder versus over your shoulder is one of the most crucial parts of getting a constant smooth rotation and it's one of the things that will help your riding the",
        "timestamp": 136,
        "endTime": 157,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "To maintain constant vision for your backside 540, shift your gaze under your arm instead of over your shoulder. This will help you spot the landing throughout the entire spin.",
        "rawText": "most spotting over the shoulder also causes something called a double spot a double spot is when you go spot for landing and then flick your head around again to try Spot It Again giving you a moment of blindness where our goal on a backside 540 is having a constant spot for the whole spin so by shifting your view to under your arm you'll be able to go and spot the knuckle all the way at",
        "timestamp": 158,
        "endTime": 179,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "Focus on holding a strong form with minimal head movement while you rotate a 180. This visual positioning from the 180 will give you a powerful start for your backside 540.",
        "rawText": "180 and hold that spot the whole time making sure you're not blind for any point of a rotation and you're holding a strong form the whole time with as little head movement as possible and it's visal position that will give you really powerful backside 540s it's always best to do your tricks off the smallest jump possible when learning there's two reasons for this first of",
        "timestamp": 182,
        "endTime": 202,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Focus on learning your Backside 540 on a small jump to ensure your takeoff and landing are precise, as this prevents you from compensating for poor form.",
        "rawText": "all it eliminates a lot of risk of hitting a bigger jump second the most crucial part is it makes it so you can't cheat your form the more air you have the more you'll be able to get away with but on a small jump you'll need to make sure your takeoff spot and Landing are absolutely dialed in in order to fully do the trick this is why it's best to learn your tricks on small jumps because",
        "timestamp": 204,
        "endTime": 224,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "Warm up with a few backside 360s, focusing on landing in your stacked position on the jump's sweet spot. Once you're comfortable with that, you're ready to try the backside 540.",
        "rawText": "then later you'll be able to transfer them to bigger jumps and bigger tricks without the same issues You' have if you started off on bigger jumps the back five is really just building off the backside 360 so warm up with a few backside 360s making sure that you're Landing in your stack position in The Sweet Spot of the jump once you do that you're ready to try a 540 use the exact",
        "timestamp": 226,
        "endTime": 246,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Use a similar approach as your backside 360, but with slightly more power. You can \"cheat\" the spin by using counter-rotation at the end to whip your body around for the extra 180 degrees.",
        "rawText": "same approach you use on your bside 360 you'll only need to use slightly more power this is because the bside 540 are what we call a cheat spin a cheat spin means you can finish the trick with counter rotation allowing you to whip around your body an extra 180 right at the last moment your first few back FES will be like this similar to a backside",
        "timestamp": 249,
        "endTime": 270,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "When learning a backside 540, expect to be blind until you've rotated about 270 degrees. Once you see a landmark like the knuckle of the jump, focus your vision on it to maintain control through the rest of the spin.",
        "rawText": "360 but smashing a quick counter rotated back one onto the end of a trick as you improve you'll start you have a constant rotation through the whole spin what will make your back fives more stylish and controlled backside 540s have you blind for the initial start of the spin so expect to not see a knuckle until around 270 once you see a knuckle hold your vision on it as you continue to",
        "timestamp": 272,
        "endTime": 294,
        "duration": 22
      },
      {
        "stepNumber": 13,
        "summary": "When approaching the landing, focus on tilting your chin down while keeping your eyes looking past your back foot to control your rotation and maintain your stacked position.",
        "rawText": "rotate around your spot if you go deep you will lose track of the knuckle this is completely okay just keep your spot uphill trying to keep your eyes looking past your back foot this will help you kill your rotation and keep your stacked position when coming into your blind Landing you want to make sure you're not leaning into your spot instead make sure you're just tilting your chin down while",
        "timestamp": 296,
        "endTime": 317,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "Keep your body stacked and tall as you approach the landing. This position will help you absorb the impact and maintain control after the blind landing.",
        "rawText": "keeping your body stacked and Tall this will help you fully absorb the impact while going and holding that blind landing position it's only a chin tilt so you don't need to get your body up and over into your spot the more stacked you are hitting the landing the easier it will be to absorb the impact and stop yourself from spinning out the more stacked you are on the landing the better so really go and focus in on",
        "timestamp": 319,
        "endTime": 340,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Focus on keeping your chin tilted down towards the snow while rotating, as this will help you track your landing. Consistent spotting at the knuckle during your rotation will improve your ability to see the landing.",
        "rawText": "figuring out how to tilt your chin down towards the snow without having your body follow the first few backside 540s you do you'll probably have a really hard time tracking the landing and knowing where you are in the air this is completely normal and it's something that will fade with time as long as your spot is set at the knuckle and you're training that constant spot rotation eventually you'll be able to see it more",
        "timestamp": 342,
        "endTime": 363,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "To stomp your backside 540, focus on a \"blind landing\": as you go over the jump, look back uphill and track the knuckle with your gaze to guide your landing. This natural body position helps you orient yourself in the air.",
        "rawText": "and more until eventually you'll know exactly where you are in the air at all times there are two things that will help you stomp your backside 540s the first is your blind Landing a blind Landing refers to looking back uphill as you land this happens naturally as you go over the knuckle and continue to track the knuckle with your spot the reason why this works is because it",
        "timestamp": 364,
        "endTime": 385,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "To help land your Backside 540, pre-rotate your upper body towards the jump. This gives you time to manage the rotation on landing.",
        "rawText": "makes it so your upper body is rotated to towards the jump so when you land you have time to disperse that rotation without needing to generate that Force into your heel Edge the next tool you can use is counter rotation counter rotation lets you use your lower body to rotate the last 180 on a back five using counter rotation also slows down your overall rotation speed so any part of",
        "timestamp": 387,
        "endTime": 408,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "To control your backside 540, use counter-rotation to slow your spin, making it easier to hold the landing. Keep spotting your landing to help your head catch up with your body's rotation.",
        "rawText": "your spin after you use counter rotation will be much slower this makes counter rotation a great way to not only speed up your spin but also kill your rotation making it easier to hold your blind Landing letting you stomp and ride away the thing that makes both of these work is the constant spot because it makes it so your head's leaving your rotation letting you then catchup with your lower",
        "timestamp": 410,
        "endTime": 430,
        "duration": 20
      },
      {
        "stepNumber": 19,
        "summary": "Focus on spotting the landing knuckle underneath your arm as you rotate. Lock your eyes on that spot to help your body rotate correctly.",
        "rawText": "body as well as holding the blind Landing as you pass the knuckle I talk about it a lot in this video but the constant spot is what will let you go and get a good 540 so really put a lot of focus into spotting underneath your arm and locking your eyes on that knuckle and figuring out the body motion to rotate around your spot the best ways to do this is on trampoline and through practice it's also the same principles",
        "timestamp": 432,
        "endTime": 453,
        "duration": 21
      },
      {
        "stepNumber": 20,
        "summary": "If you're struggling with the backside 540, practice the \"constant spot\" technique used in frontside 360s. This helps with the difference in spotting and gives you a strong snap for the 540.",
        "rawText": "used on a front side 360 so if you're struggling with the constant spot go back maybe do some front side freeze and translate what you learn from back into your backside 540 because this constant spot is the difference between a bside 360 and a backside 540 recap you want to have a smooth setup car slightly stronger snap than 4 360 spotting",
        "timestamp": 455,
        "endTime": 476,
        "duration": 21
      },
      {
        "stepNumber": 21,
        "summary": "Focus on your landing: Dig in your toe edge on the landing, hold the blind landing position until you've fully stopped spinning, then look up and ride away.",
        "rawText": "underneath your shoulder locking your eyes on the knuckle rotating around your spot digging in your toe Edge on the landing holding the blind landing position until you've fully killed your spin then look up and ride away backside 540s are super difficult if you don't have your backside 360s perfect it can be really hard to tell if your 360s are dialed in and perfect because there's so",
        "timestamp": 478,
        "endTime": 499,
        "duration": 21
      },
      {
        "stepNumber": 22,
        "summary": "Practice your backside 540s on small jumps without grabs to build consistency. Once comfortable, move to bigger jumps and incorporate a grab like the stalefish to help initiate and control your spin.",
        "rawText": "your riding once you've landed your first backside 540 it's time to start grinding them out do a bunch of them on little jums with no grabs and once you're feeling comfortable you can start bringing them to bigger jumps and adding grabs my personal favorite grab for the backside 540 is the stalefish because it makes it so my back arms leading the rotation helping me get the spin around and it just feels right there as a war",
        "timestamp": 546,
        "endTime": 567,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "Focus on building a solid backside 360 first, ensuring a strong, stacked takeoff with no drifting and a powerful tail snap. This will provide the foundation for a proper backside 540 and prevent the development of bad habits.",
        "rawText": "warning back fives are where a lot of people Max up for snowboarding tricks this is because there's a lot of way to cheat a backs side 540 and make it work but it won't then translate to bigger tricks like backside 720s so if you really want to get a proper backside 540 don't neglect your backside 360s be truthful of yourself and make sure you're getting that strong stack takeoff no drift and Powerful snap of a tail",
        "timestamp": 569,
        "endTime": 590,
        "duration": 21
      },
      {
        "stepNumber": 24,
        "summary": "Focus on mastering backside 360s first. A solid backside 360 foundation is key to learning backside 540s, making the 540 much easier to learn once you have it down.",
        "rawText": "because it's that strong backside 360 Foundation that's going to be crucial for back f and back sevens so if you are honestly trying to improve as a rider spend most of your time on backside 360s and then once you do you'll be able to Backside five much easier after that it's time to start grinding your back FES and grinding your back freeze getting those super powerful takeoff that let you",
        "timestamp": 594,
        "endTime": 614,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "frontside-540",
    "trickName": "Frontside 540",
    "aliases": [
      "fs 540",
      "front 540",
      "frontside five forty"
    ],
    "videoId": "MS6LSphIbRo",
    "videoTitle": "How To Frontside 540 On A Snowboard",
    "totalDuration": 502,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "For a frontside 540, use the same snap and takeoff technique as you would for a frontside 360. Focus on the familiar motions you already use for the 360 to get started.",
        "rawText": "hey snowm addiction Tavis here and in this video I'm going to teach you how to front side [Music] [Applause] [Music] [Applause] [Music] 540 for a front side 540 you'll be using the same snap and takeoff as your front side 360 the major difference for this",
        "timestamp": 0,
        "endTime": 22,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "To properly execute a frontside 540, approach the jump with your hips and chest closed off, not already open. This will allow you to generate coordinated and powerful rotation by keeping your upper body connected to your board.",
        "rawText": "your front side spins starting with wind up the most common mistake on front side spins is approaching a jump with your hips and chest already open this makes it so when you go to throw your spin you're going to have to overextend your upper body disconnect in you from your board making your rotation wonky and uncoordinated power on your front side spins comes from being closed off coming",
        "timestamp": 45,
        "endTime": 65,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "To generate power for the Frontside 540, close off your upper body and hips slightly, turning them a bit more than perfectly stacked over your board. This allows you to snap and generate power with your core.",
        "rawText": "to the jump this means your body's stacked and in a neutral position over your board to add more power to this you don't want to go and throw more instead what you want to do is close off a little bit more making it so your upper body and hips are slightly more turned than perfectly stacked and squared this allows you to go and snap generating power with your core look keeping",
        "timestamp": 67,
        "endTime": 88,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "To generate maximum power for your frontside 540, keep your upper and lower body connected and maintain a relatively small, controlled range of motion; a slight, closed-off position is all you need for the spin.",
        "rawText": "everything tight with your upper and lower body connected keep in mind that even when this motion is done as exaggerated as possible it's still relatively small and you don't need to fully reach back in order to get the spin instead a slight bit of closed off is all the range of motion you will need to generate maximum power on your front side rotations because the range of",
        "timestamp": 90,
        "endTime": 110,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "When doing a frontside 540, time your snap so that you finish it as your tail leaves the takeoff. This maximizes your height and power off the jump.",
        "rawText": "motion on your snap on a front side spin is small where the power comes from is timing it's the timing that decides how much power you will have off the takeoff the perfect timing on a front side five is when you finish your snap as your tail leaves the takeoff this lets you get maximum height off the Jump and power from your board we call this snapping off the tail in order to have",
        "timestamp": 111,
        "endTime": 132,
        "duration": 21
      },
      {
        "stepNumber": 6,
        "summary": "To get the right spin for a frontside 540, keep your body closed off to the jump during the run-up. Then, snap your spin about halfway up the takeoff, adjusting the timing to control the speed of your rotation.",
        "rawText": "the right timing you're going need to have the correct position when coming into the jump you want to keep your body closed off to the jump during your whole run up only opening up as you snap your spin you generally want to start snapping your spin halfway up the takeoff but earlier you start your spin the slower your snap will have to be and the slower your snap is the less power there will be behind it you can delay",
        "timestamp": 134,
        "endTime": 155,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "To get a smooth Frontside 540, take off with your upper body slightly open, initiating the rotation from your tail. This helps maintain consistent spin throughout the trick.",
        "rawText": "and speed up your snap for more power or start early and go slower for Less power but you'll always be aiming to leave the takeoff off your tail with your upper body slightly open in order to get a constant rotation on your front fivs you won't be leaving the takeoff with your upper body very extended instead just slightly open this will help keep your",
        "timestamp": 157,
        "endTime": 177,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "Maintain a strong, upright, and slightly open position on takeoff, holding your form throughout the entire 540 rotation. Focus on keeping your core tight and arms and legs in a solid, uncompromised position.",
        "rawText": "core tight keeping your rotation smoooth this stack strong position off the takeoff is the base for all front side spins you want to be only slightly open and Tall leaving the takeoff keeping your legs and arms in a strong uncompromised position just like on a front side 360 your goal is to hold your spot through the full duration of your spin this is only possible with the",
        "timestamp": 179,
        "endTime": 199,
        "duration": 20
      },
      {
        "stepNumber": 9,
        "summary": "Keep your vision underneath your front arm to spot the landing. This helps you rotate correctly and avoids overextending, leading to a more controlled and balanced Frontside 540.",
        "rawText": "proper head positioning you want to make sure you're never spotting over your shoulder this will make you tall and overextended and also make it so you need to reach around to try spot your Landing throwing you off balance and making it so the rotation won't work that's why we keep our vision underneath our front arm because this will let us spot the knuckle sooner hold the spot and pull into a rotation so you don't",
        "timestamp": 202,
        "endTime": 223,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "When attempting your first frontside 540, after spotting the knuckle at around 270 degrees, immediately fix your gaze forward and let your body continue rotating. This will help you complete the spin.",
        "rawText": "only see the rotation for longer but you also stay more connected and tight throughout the spin what's going to be really important for getting the front side 540 around when doing your first front side 540 you'll start to see the knuckle around 270 once you see the knuckle you want you to lock your eyes forward letting your body continue to rotate as you pass the knuckle keep your",
        "timestamp": 226,
        "endTime": 246,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Keep your legs stacked with knees pointing outwards as you approach the jump. This will help you stay balanced and pull up tighter, speeding up your spin.",
        "rawText": "your body set up for success as the knuckle comes into view this is done through your arms and legs your legs should be in a stacked position with your knees pointed outwards by keeping your knees pointed out you'll be more balanced in the air this allows you to pull up tight speeding up your spin arms are also very crucial for front thighs you need to keep your arms away from the",
        "timestamp": 315,
        "endTime": 335,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "To help complete your frontside 540, actively use your front arm to pull yourself through the spin. Maintain a balanced position and let your front shoulder assist in pulling you through the rotation.",
        "rawText": "center of your body with your front arm actively pulling your spin Along by doing these two steps you'll be in a balanced position with your upper body pulling in to finish the spin there's two options for grabbing a front side 540 when learning Indie and melon Indie is by far the best for this spin because it lets you use your front shoulder to continue pulling in into your spin this",
        "timestamp": 337,
        "endTime": 358,
        "duration": 21
      },
      {
        "stepNumber": 13,
        "summary": "To land a Frontside 540, delay your grab until after you've rotated 180 degrees. Be prepared to release your grab to regain control before landing.",
        "rawText": "helps you land in your stacked position the melon grab also works but it goes and speeds up your rotation meaning that you're going need to let go of the grab in order to get control over your Landing this makes landing on your heel Edge super common whenever you do a front five with a melon grab on both of these grabs it's important to not rush it making sure that you're not grabbing before 180 in order to grab sooner V",
        "timestamp": 360,
        "endTime": 382,
        "duration": 22
      },
      {
        "stepNumber": 14,
        "summary": "To land a clean frontside 540, pull with your front arm and whip your back arm into the landing throughout the spin. The Indie grab helps with this technique.",
        "rawText": "common to see heal Edge Landings on front side 540s in order to get a clean 2ft Landing you're going to spend the whole duration of a spin pulling with your front arm and ipping your back arm into the landing that's why the Indie grab is the best grab for front side 540s by pulling your lead arm towards the landing you'll be able to get your access rotation downwards letting you",
        "timestamp": 408,
        "endTime": 429,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Land with both feet simultaneously in a stacked position, keeping your body engaged throughout the spin to ensure a clean landing. Consistent practice is crucial for mastering the frontside 540.",
        "rawText": "land in a stack position with both feet at the same time this is all set up with the previous steps but it's important to know that you need to keep your body engaged during the whole duration of the spin in order to successfully land with both feet at the same time in your stack position front fighs take a long a lot of repetition and a lot of practice to get dialed in because of these variables but by getting a strong front side 540",
        "timestamp": 432,
        "endTime": 454,
        "duration": 22
      },
      {
        "stepNumber": 16,
        "summary": "Keep your upper body closed off until you switch to your heel edge, then snap your spin halfway up the takeoff while keeping your board straight. This will help you learn the Frontside 540.",
        "rawText": "it's going to make it way easier to get a front seven in the future that's why I highly recommend going and putting the time in here because it's going to really help you out with every future front side spin recap keep a closed off upper body until after you switch to your heel Edge start snapping your spin halfway up the takeoff keeping your board as straight as possible as your",
        "timestamp": 457,
        "endTime": 478,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "Initiate the spin by snapping the tail off the lip, opening your upper body slightly. Spot the knuckle at 270 degrees and pull your arm around to complete the spin, aiming for a clean landing in a stacked position.",
        "rawText": "tail snaps off the lip with your upper body slightly opened spot underneath your arm as you pull your arm around for the spin grab your snowboard around 180 spot the knuckle at 270 and keep pulling into your spin Hit The Landing in The Sweet Spot with a stack position absorb the impact and ride away clean I'm Tavis from snowbo addiction and our goal is to",
        "timestamp": 480,
        "endTime": 500,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "backside-720",
    "trickName": "Backside 720",
    "aliases": [
      "bs 720",
      "back 720",
      "backside seven-twenty",
      "backside two twenty"
    ],
    "videoId": "C2EJwuxG4Fs",
    "videoTitle": "How To Perfect Your Backside 720",
    "totalDuration": 701,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Backside 720, focus on your takeoff and windup. You'll need to tweak your takeoff to generate more power while keeping a tight core.",
        "rawText": "takes a lot more rotational Force this is mainly because you can't finish the spin with counter rotation like you can a back five or a back one so in order to go and get back sevens we're going need to start with tweaking our takeoffs in order to generate more power off a jump while keeping a more consistent tight core and the first step to train for this is your windup there are five key points you're trying to hit with every",
        "timestamp": 25,
        "endTime": 47,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "Maintain an upright body position with a straight back, avoiding any arching. Bend your knees slightly to shift your weight towards the balls of your feet.",
        "rawText": "single windup for back seven one an upright body position with no Bend in your back this means your back is straight and not arcing forwards or backwards two a slight Bend in your legs you want enough Bend in your knees that your weight is shifted to the balls of your feet if your knees start going over your toes or you start shifting backwards you know you have too much or too little Bend three hips open towards",
        "timestamp": 48,
        "endTime": 70,
        "duration": 22
      },
      {
        "stepNumber": 3,
        "summary": "To generate more power for your Backside 720 wind up, open your hips on the takeoff. Actively engage your back knee, keeping it pointed toward your middle toe, to maintain a strong position.",
        "rawText": "a takeoff opening your hips increases your range of motion on your wind up this lets you get more power out of your Snap Four a strong back knee position when you open your hips your back knee will want you follow and start twisting forward which will compromise your strong position make sure to actively engage your back knee keeping it pointed at your middle toe five arms away from",
        "timestamp": 72,
        "endTime": 93,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "To achieve the perfect wind-up for a Backside 720, keep your arms away from your body during the wind-up phase to maximize your mobility and rotational power. This will help you rotate on the correct axis.",
        "rawText": "the body you want to make sure no part of your arms is touching your body on wind up this will keep you more mobile giving your body more room to generate power hitting all five of these points will put you into a perfect wind up position what is needed in order to rotate on the correct axis for a backside 720 when you try to snap a backside 720 leaning forward your rotation will be aimed upwards making",
        "timestamp": 96,
        "endTime": 117,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "Set your rotation over your back foot and maintain a tall body position, extending your full body with your chest pointed towards your tail. This body position helps establish the correct axis for the backside 720.",
        "rawText": "your chest lift Towards the Sky what you want to be doing is having your rotation set over your back foot with a tall body what this does is it makes it so your chest is pointed down towards your tail with your full body extended with your point of balance being set over your back foot this is the body position that will help get you the proper axis of",
        "timestamp": 119,
        "endTime": 139,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "To maximize your backside 720, fully extend your chest down towards the tail of the board. This body position helps with rotation, tail snapping, and spotting the landing.",
        "rawText": "rotation as well as letting you maximize the power and spot The Landing sooner this fully extended chest down towards the tailal position is exactly what you'll be aiming for on every backside 720 this is because it does three crucial things one it sets up a proper AIS of rotation two it helps you snap off your tail three it puts your head in a position to spot the knuckle off",
        "timestamp": 141,
        "endTime": 162,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "As your tail leaves the jump for a backside 720, rotate your upper body 180 degrees *before* your board leaves the jump, ensuring your board takes off in a straight line for more power and snap.  Practice straight takeoffs on back threes and fives first.",
        "rawText": "takeoff as your tail leaves the takeoff on a back seven your upper body should already be rotated around 180 as your board stays completely straight it is a very important to have your board leaving off in a straight line because it'll give you more snap and Power if you aren't comfortable with this straight takeoff on back threes and back fives I'd recommend going back and practicing those until you have that",
        "timestamp": 164,
        "endTime": 185,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "Maintain a strong, straight takeoff for your backside 720 to minimize drifting and maximize in-air control. Landing on a flat base is key; drifting during the spin requires counterbalancing, potentially leading to errors.",
        "rawText": "strong straight takeoff because it's going to be absolutely crucial when trying a back seven this will let you drift less giving you more control in the air and letting you spot the knuckles sooner it's also going to be crucial for finishing the trick Landing with a flat base the more you drift a backside spin the more you're going into to counterbalance by digging in your heels on the landing this is because you need to go and stop yourself from your sideways trajectory where if you're",
        "timestamp": 187,
        "endTime": 208,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "Focus on your takeoff on a smaller jump (15-25ft) with minimal kick to make landing your backside 720 easier. This will give you more control and less chance of last-minute adjustments.",
        "rawText": "going straight off a takeoff you'll come into a jump nice allowing you to land with a proper two-footed Landing the ideal jump is around 15 to 25 ft the most important aspect on a backside 720 is your takeoff and on a smaller jump a good takeoff is easier to manage I'd recommend looking for a jump that doesn't have too much kick because you don't want anything last minute messing",
        "timestamp": 210,
        "endTime": 231,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "Practice your backside 720s on smaller jumps to build a solid foundation. This forces you to execute the trick correctly, making it easier to land on larger jumps later.",
        "rawText": "up your backside form the other benefit to practicing your backside 720s on smaller jumps is it trains your foundation and makes it so you have to do the backside 720 in a proper way where if you go and do your sevens on a bigger jump you have more room to cheat making it so you don't need to get the trick as dialed in but if you're able to go and get a proper backside seven on a 15t jump it's going to be very easy to",
        "timestamp": 233,
        "endTime": 253,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Let your upper body rotate past your tail more than you would for a backside 5. The key is to lead the rotation with your upper body.",
        "rawText": "translate those skills over to a larger jump in the future and this is why we recommend going and building up these tricks on the smaller features before bringing them to larger jumps you'll be having the same setup carve as for every backside spin the biggest difference here is you're going to be letting your upper body rotate past your tail more than you would for a back five so the challenge will be coming from letting your upper body lead that rotation while",
        "timestamp": 256,
        "endTime": 276,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "Focus on your spot: you can either maintain a constant visual spot or use a \"double spot\" where you spot one 360 and then quickly whip your head around for the next 360 during the rotation.",
        "rawText": "keeping your board completely straight off the takeoff that's all the steps we need to get into the air so now let's cover what to do once we're there starting with your spot there are two kinds of spots you can do on a back seven the constant spot and a double spot a double spot is when you rotate a 360 spot the knuckle and then whip your head around for the next 360 SE this also goes and disconnects your upper and",
        "timestamp": 278,
        "endTime": 300,
        "duration": 22
      },
      {
        "stepNumber": 13,
        "summary": "To smoothly spin a Backside 720, maintain a constant spot by focusing on a consistent axis rotation, just like you would for a 540. This allows you to spot the landing and maintain a steady rotation speed.",
        "rawText": "lower body making it harder to have a smooth constant rotation that's why instead of doing the double spot we want to focus on doing the constant spot just like on 540s a constant spot will let you spot the knuckle at 270 and rotate around without losing sight of the landing allowing you to have a constant speed of rotation a constant spot is achieved by two things axis rotation and",
        "timestamp": 302,
        "endTime": 322,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "To set up for a backside 720, maintain an upright takeoff and snap over your back foot. This will naturally position your eyeline under your back arm, allowing you to spot the landing early, starting at the 270-degree mark.",
        "rawText": "head position both of these are achieved by a proper upright takeoff that lets you snap over your back foot when you snap over your back foot your eyeline will be set under your back arm putting you in the same under the back arm spot position used on every backside spin this lets you spot the knuckle as early as 270 setting you up for the rest of your back seven your axis rotation can",
        "timestamp": 325,
        "endTime": 346,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Focus on a downward axis of rotation for your backside 720, throwing your chest over your back foot in a downward motion. This differs from the upward rotation used in frontside spins.",
        "rawText": "vary vastly from Flat court and FP even though we are trying to not Corker spins here it's important to be set up on the proper axis rotation there's two axises rotation there's upwards over your shoulder what you use on front side rotations like a front cork five and there's downwards where you're going in throwing tall with a chest over your back foot in a downwards motion and this",
        "timestamp": 348,
        "endTime": 369,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "To avoid an improper spin axis on your Backside 720, don't break at the waist. Instead, maintain a stable core to keep your momentum aligned for the rotation.",
        "rawText": "is what we use on backside spins this rotation is very noticeable when someone's doing a big cork but it's very subtle when someone's keeping for spins flatter the main thing that causes the improper over shoulder axis is breaking at the waist if you break at the waist and try to snap your momentum will be thrown Towards the Sky making you lean into your front foot resulting in the",
        "timestamp": 372,
        "endTime": 392,
        "duration": 20
      },
      {
        "stepNumber": 17,
        "summary": "To cork a backside 720, maintain a tall, stacked body position and initiate your rotation over your back foot, ensuring your weight is shifted appropriately. Avoid breaking at the waist and throwing your rotation downwards.",
        "rawText": "over the shoulder wild axis but by staying tall your throw will put your weight over your back foot letting you keep your spot under your arm and this is how you actually cork a backside spin the more your rotation is set over your back foot the more quirky your rotation will be but we never want to be breaking up the waist and throwing downwards it always should be a tall stack position",
        "timestamp": 393,
        "endTime": 413,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "To master the backside 720, focus on a good takeoff and get tight into a ball. Use a \"mute\" grab (formerly called \"wetle\") to control the torque and accelerate your spin.",
        "rawText": "improve your riding the last part of of the backside 720 is the grab because you're not able to go and speed up your rotation like you can on a back five it's important to get a good takeoff and get tight into a ball letting you go and control the torque and speed up your spins the best grab to do this wh is mute now known as the wetle grab a wetle grab gives two massive perks one it lets",
        "timestamp": 507,
        "endTime": 529,
        "duration": 22
      },
      {
        "stepNumber": 19,
        "summary": "Keep your front shoulder pulled into the spin by using your back arm for stabilization. This helps maintain a smooth rotation and correct posture for landing the Backside 720.",
        "rawText": "you use your back arm to stabilize and control the speed of your spin two it keeps your front shoulder pulled into your spin which helps keep you rotating smoothly through the full rotation and puts you in that correct posture to finish with Spin and land stacked for these reasons we highly recommend every back Seven's learned with the wetle grab because you're letting your upper body lead for rotation on a back seven it",
        "timestamp": 532,
        "endTime": 553,
        "duration": 21
      },
      {
        "stepNumber": 20,
        "summary": "Grab the board between the 270 and 330-degree point of your rotation during a backside 720. This timing allows your upper and lower body to stay aligned and maximize rotation speed.",
        "rawText": "will take time for your lower body to catch up to your upper body if you reach for a grab too soon it will cut this process short removing the follow through what will drastically decrease your rotation speed you want to be grabbing a back side 720 around 270 to 330 this will give you adequate time to let your lower body and upper body catch up to each other it will also make it so",
        "timestamp": 555,
        "endTime": 576,
        "duration": 21
      },
      {
        "stepNumber": 21,
        "summary": "Visualize the entire backside 720 before attempting it. Close your eyes and imagine yourself successfully spotting the knuckle, grabbing the board, and smoothly rotating.",
        "rawText": "you're hitting your grab around the same time you're spotting the knuckle making it one fluent motion of spotting well grabbing allowing you to pull into a spin resulting in a much smoother rotation because there's so many little components going on of backside 720 we utilize a tool called visualization this means we're going to go and close our eyes and imagine our doing the trick in the first person and",
        "timestamp": 578,
        "endTime": 599,
        "duration": 21
      },
      {
        "stepNumber": 22,
        "summary": "When attempting a backside 720, focus on two things: your takeoff and either your spot position or the timing of your grab. This helps build the muscle memory needed to perform the trick.",
        "rawText": "the third person this is a technique that all highle Riders use and what it does is it builds the muscle Pathways in your mind allowing you to go and subconsciously perform a lot of these tasks I have a Golden Rule and it's that you can't focus on more than two things when doing a trick on your snowboard the first thing you need to focus on is your takeoff and the second thing can either be your spot position your grab timing",
        "timestamp": 601,
        "endTime": 622,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "Before attempting a backside 720, ensure your backside 360s are consistently clean and comfortable. This solidifies your foundation and allows you to focus on the specific adjustments needed for the larger spin.",
        "rawText": "can be one of those things but you need to go and get every other step subconscious so you can go and narrow it down and focus in on one or two specific topics for a spin this is just great practice and something to do when you're trying these bigger spins before trying to back seven make sure you're very comfortable in the jump you don't want to have any confusion if you're going to be drifting not any sweet spot so go and focus in get a few good backside 360s",
        "timestamp": 624,
        "endTime": 646,
        "duration": 22
      },
      {
        "stepNumber": 24,
        "summary": "To land a backside 720, focus on a straight takeoff, maintain a strong, tall body position throughout the rotation, and keep your eyes spotting your landing. Grab your board between 2:30 and 3:30 in the rotation, and land stacked with your body aligned.",
        "rawText": "and after that link it together and do the seven the five main things that make a back seven work are a straight takeoff with as little drift as possible a strong tall body position during every part of your takeoff and snap a constant spot through with full rotation grabbing your board around 230 to 330 Landing stacked with your body aligned and your",
        "timestamp": 649,
        "endTime": 670,
        "duration": 21
      },
      {
        "stepNumber": 25,
        "summary": "To learn a Backside 720, ensure you have strong fundamentals by consistently landing back fives. This means you need to be comfortable and confident with your backside spins.",
        "rawText": "weight over the balls of your feet once you can hit those Five Points consistently you'll know that your backside foundations are strong and you're ready to move on to bigger spins or bigger jumps a backside 720 is really combining every skill you know on your backside spins so make sure that you have strong fundamentals of your back frees your back fives and combining those with the steps you learned in this",
        "timestamp": 672,
        "endTime": 693,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "frontside-720",
    "trickName": "Frontside 720",
    "aliases": [
      "fs 720",
      "front 720",
      "frontside seven twenty"
    ],
    "videoId": "qDJSAetVz1k",
    "videoTitle": "How To Dial In Your Frontside 720",
    "totalDuration": 817,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Frontside 720, you need a solid frontside air and frontside 180 (frontside F) first.  Master these two tricks to build a foundation for the 720.",
        "rawText": "hey snow addiction Tavis here and today I'm going to teach you one of the most fun tricks of front side [Music] [Applause] [Music] [Applause] [Music] [Applause] 720 in order to front side 720 you're going to need your front freeze and your front F the better you have these two",
        "timestamp": 0,
        "endTime": 21,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "To learn a frontside 720, build upon your frontside 540 technique by adding a bit more snap and power. You can also utilize counter-rotation to help finish the extra 180 degrees.",
        "rawText": "tricks the easier it's going to be to go and get the front side 720 we're going to be building off what we learned on the front five and tweaking it in order to make it work on a front side 720 even though the front 7 is an extra 180 versus the front 5 it only takes slightly more snap and power this is because you can finish a front seven with counter rotation counter rotation",
        "timestamp": 23,
        "endTime": 43,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "To set up your Frontside 720, focus on a powerful pop off the tail of your board with minimal drifting off the jump. This clean takeoff will allow for smoother and more controlled rotation in the air.",
        "rawText": "allows you to speed up the trick as long as your body is in the correct position to fully utilize it in order to get set up to fully utilize counter rotation you're going to want to hit two points a good snap off your tail getting maximum pop out of a jump and little to no drift the more up with the least drift you can get will let you go and control your rotation more smoothly in the air then",
        "timestamp": 46,
        "endTime": 66,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "To initiate the Frontside 720, disconnect your upper and lower body to allow your legs to rotate. Keep your eyes locked on the landing spot to rotate your head, which helps with the counter-rotation.",
        "rawText": "then you go and disconnect your upper and lower body with that said let's talk a little bit about what is counter rotation counter rotation is when you disconnect your upper body and lower body allowing you to rotate your legs when leaving your upper body behind this will only work if you have the correct head positioning you need your eyes locked on the knuckle positioned for the blind Landing this rotates your head allowing you to use coun rotation to",
        "timestamp": 68,
        "endTime": 90,
        "duration": 22
      },
      {
        "stepNumber": 5,
        "summary": "To control your Frontside 720 landing, use counter-rotation in the final 180 degrees of the spin. This slows down your rotational momentum, helping you land stacked and reduce the chance of sliding out.",
        "rawText": "counter rotation for the last 180 of any spin this slowdown effect can actually be utilized to your advantage because using counter rotation to speed up your spin while slowing it down will kill your momentum when you're still in the air this makes it so you're going to be coming into the landing with less rotational Force resulting in an easier impact allowing you stay stacked and having a less chance of sliding out on",
        "timestamp": 113,
        "endTime": 134,
        "duration": 21
      },
      {
        "stepNumber": 6,
        "summary": "If you can consistently land a frontside 540 in a stacked position, the frontside 720 will be easier. Use counter-rotation for the final 180 degrees of the spin.",
        "rawText": "Landing this is why if you can do a front side 540 and fully finish the spin in a stack position it's easy to do a front side 720 because then you can just use counter rotation for the last 180 and absolutely lace the front seven that's why we call front 7 a cheat trick because you're putting in all the work for the front five and if you take the time to do that work the front 7 will come very naturally to you a great way",
        "timestamp": 137,
        "endTime": 158,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "To learn a frontside 720, use the same powerful takeoff position as a frontside 540. Then, lock your eyes on the knuckle and let your body rotate past it, similar to a frontside 360.",
        "rawText": "to visualize a front size 720 is imagine your front five combined with the spot of your front three because you're going to want the same takeoff the same powerful position as on a front five and then locking your eyes on the knuckle and letting your body rotate past that point just like you would on a front side 360 the hardest part of front 7 is the constant spot a constant spot is",
        "timestamp": 160,
        "endTime": 180,
        "duration": 20
      },
      {
        "stepNumber": 8,
        "summary": "To land a frontside 720, pick a fixed point (like the jump's knuckle) and keep your eyes locked on it as you rotate. Minimize head movement and maintain a consistent rotation throughout the spin.",
        "rawText": "when you go and lock your eyes on a point for this instance it will be the knuckle of a jump and when you track that point with your eyes as your body rotates around it you're trying to have as little head movement as possible while maintaining as constant of a rotation as you can a common mistake you'll see on a front seven is the double spot a double spot is when you rotate 3E 60 spot the landing and then",
        "timestamp": 182,
        "endTime": 203,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "To successfully land a frontside 720, keep your head leading the rotation throughout the spin, just as you would for a frontside 360. This constant spotting ensures you can see your landing.",
        "rawText": "whip your head around again to go and spot The Landing this has the massive downside of making you blind for a moment during a crucial part of your spin a golden rule for snowboarding is that you can't spin without your head that's why your head should always be leading your rotation your constant spot on a front seven is using the same principles as on a front side 360 just to a larger extent the most important",
        "timestamp": 205,
        "endTime": 227,
        "duration": 22
      },
      {
        "stepNumber": 10,
        "summary": "To successfully land a Frontside 720, lock your eyes on a fixed point (like the knuckle of the jump) as you come out of the first 360, letting your body follow the rotation. This technique can be practiced on a trampoline to replicate the feeling.",
        "rawText": "part to executing it successfully is making sure that when you're coming out of the first 360 your head is leading the rotation looking locked down on that knuckle letting your body follow along the best way to train this is on trampoline on trampoline you can fully replicate the feeling of locking your eyes at one point and rotating around it we also make something called the",
        "timestamp": 229,
        "endTime": 249,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "For your first frontside 720 attempts, aim for a jump with a smooth takeoff and a moderate kick, ideally between 10 and 25 feet. This will help you generate the necessary power and rotation for the full spin.",
        "rawText": "the last 180 giving you a lot of room to add rotational speed throughout the spin I'd recommend 10 to 25 ft for your first front seven attempts because we are teaching you how to do it flat I'd also recommend that the jump doesn't have too much kick because you're going to need a very solid smooth takeoff in order to generate the power needed for front side 720 what brings us into the takeoff your",
        "timestamp": 273,
        "endTime": 293,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "To nail your Frontside 720, focus on a powerful takeoff: snap off your tail with full extension. Minimize any sideways sliding (scrubbing) off the jump to maintain your snap.",
        "rawText": "takeoff is the most important part of a front side 720 on a front 7 takeoff you need to make sure that you're getting a nice snap off your tail with full extension you can go and scrub off the takeoff a little bit I use a little bit of scrub myself but you're aiming for as little as possible because if you start sliding too much sideways off of the takeoff you're going to be missing your snap off your tail and missing a lot of",
        "timestamp": 297,
        "endTime": 318,
        "duration": 21
      },
      {
        "stepNumber": 13,
        "summary": "Be patient and strong on your frontside takeoff. This will generate the necessary power and rotation to spot the landing and complete the Frontside 720.",
        "rawText": "power and rotational force that you can generate by being a little bit more patient this is why the main thing I tell myself on any front side spin is be patient coming into a takeoff a patient strong front side takeoff is the base for every front side Spin and it will set you up to have the proper access and the proper Force allowing you to go and spot the knuckle and hold that rotation",
        "timestamp": 320,
        "endTime": 340,
        "duration": 20
      },
      {
        "stepNumber": 14,
        "summary": "Focus on perfecting your takeoff for frontside 720s. Practice your frontside 360s, concentrating on a strong snap off the tail to generate the necessary rotation and enter the trick smoothly.",
        "rawText": "the whole way if you're struggling with your front side 72s it's probably stemming from a flaw and a takeoff so go and take the time and really get your takeoff styled in on your front freeze and front F because once you can get that strong snap off the tail you'll be able to enter the vortex and just really fully enjoy the trick from that point on there's a lot of little mistakes that",
        "timestamp": 342,
        "endTime": 362,
        "duration": 20
      },
      {
        "stepNumber": 15,
        "summary": "To initiate your frontside 720, throw your spin with the jump by extending your body for pop and rotation. Use a slight bend in your legs and hinge at your waist to generate the spin.",
        "rawText": "out if you have a time sign up for a free trial you have nothing to lose an important aspect to your front side takeoff is making sure that you're throwing with the jump throwing with the jump means that you're throwing your spin as your body extends giving you pop and rotation this is where a slight Bend of the legs and a slight hinge at the waist come into play so that when you",
        "timestamp": 429,
        "endTime": 449,
        "duration": 20
      },
      {
        "stepNumber": 16,
        "summary": "To initiate the Frontside 720, wind up your upper body, reaching 90 degrees of rotation by the jump's halfway point, then throw into the spin as your tail snaps off the jump. Focus on extending your legs and upper body for a powerful takeoff.",
        "rawText": "snap your spin you also have an extension through your legs and upper body with a perfect takeoff having you snap off your tail with your body completely extended with around 90 of rotation on your upper body in order to Tim this properly you should be finishing your wind up around halfway up the jump and starting your throw from that point finishing as your tail snaps",
        "timestamp": 451,
        "endTime": 471,
        "duration": 20
      },
      {
        "stepNumber": 17,
        "summary": "To generate power for your Frontside 720, focus on a slight wind-up and perfect timing of your body's extension off the lip. This \"pocket\" of rotation is key for maximizing spin and power.",
        "rawText": "off the lip if your body in that 90 rotation fully extended this window of rotation matched up of a timing of a takeoff is what we call hitting the pocket of the spin and this is where all power deres from on front side rotations mastering the motion of the slight wind up perfect time extension will let you front seven basically anything because it goes and generates so much power an",
        "timestamp": 473,
        "endTime": 494,
        "duration": 21
      },
      {
        "stepNumber": 18,
        "summary": "Focus on perfecting your takeoff timing for a cleaner launch, rather than winding up for more power. This will allow you to generate more power and rotation for your frontside 720.",
        "rawText": "important thing to know on a front 7 is you're not trying to wind up more for more power instead your power is coming from a cleaner takeoff with more dialed in timing so go and play around with this timing really get it channeled in because it's really going to let you go and master your takeoffs and generate so much power and snap off your tail this motion lets you get pop and rotation increasing your overall power combining",
        "timestamp": 496,
        "endTime": 517,
        "duration": 21
      },
      {
        "stepNumber": 19,
        "summary": "Focus on bringing your legs up towards your body in the air to increase stability for the Frontside 720. For the easiest grab, use a melon grab.",
        "rawText": "this with a proper head position will allow you to front seven pretty much anything the easiest grab for a front side 720 is the melon grab but a Indie grab is going to be a better grab if you're inspiring to do a front side 9 in the future the melon grab pulls your body along the spin forcing you to stay tight and keep your spot going the more more you can bring your legs up to you in the air the more stable you will be",
        "timestamp": 520,
        "endTime": 540,
        "duration": 20
      },
      {
        "stepNumber": 20,
        "summary": "Focus on a strong, fully extended takeoff to set up your frontside 720. Let your legs raise up to your body before reaching for the grab, allowing for more control over your spin.",
        "rawText": "and the more control you'll have over your spin it's important to not rush this grabbing process you want to make sure you're getting fully extended off the lip and giving your legs time to raise up to your body before reaching down for the grab if you go and get a strong takeoff your body will be set up to hit any grab you want so focus on that takeoff and the grab will come after on the front seven Landing you",
        "timestamp": 542,
        "endTime": 562,
        "duration": 20
      },
      {
        "stepNumber": 21,
        "summary": "To successfully land a frontside 720, keep your eyes looking uphill (away from the landing) for longer than you think you need to. This allows you to control your rotation and land with your upper body twisted uphill, preventing a heel-edge washout.",
        "rawText": "need to hold your eyes uphill longer than you'd think you should be landing with your upper body Twisted nearly 180 uphill this gives you more time to disperse your rotation on the landing looking up from your blind Landing too soon Landing looking at your feet or Landing looking downhill will all cause you to wash out to your heel Edge this is why we want to go and hold that blind",
        "timestamp": 564,
        "endTime": 584,
        "duration": 20
      },
      {
        "stepNumber": 22,
        "summary": "Keep your body tall with your chin pointed downwards as you come in for the landing of your frontside 720, so you can absorb the impact and land cleanly on your toe edge. This helps to distribute the rotation through the landing.",
        "rawText": "Landing long your V feels comfortable to go and fully kill the rotation and give our upper body time to disperse it through the landing allowing us to hold our tow Edge and ride away clean in order to fully absorb the impact of Landing you're going to want to keep your body tall coming into it this means you're not going to be doing the blind Landing leaned over your foot but instead keeping your body tall with your chin pointed downwards this stack",
        "timestamp": 586,
        "endTime": 607,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "To absorb the takeoff and impact of a Frontside 720, use a \"blind landing position\" with your upper body rotated 180 degrees uphill. Maintain a tall body posture and dig in your toe edge for stability and to disperse the rotational force upon landing.",
        "rawText": "position is what's going to let you absorb the takeoff and fully disperse for rotation a textbook blind Ling position has your upper body rotated 180 facing uphill digging in your toe Edge and having your whole body tall by having this tow Edge pressure with a blind landing position and the tall body posture you'll be able to absorb the impact and disperse the rotational Force",
        "timestamp": 609,
        "endTime": 630,
        "duration": 21
      },
      {
        "stepNumber": 24,
        "summary": "To land a frontside 720, spot the knuckle and maintain your focus on that spot throughout the entire rotation. Ensure you hold your toe edge through the landing.",
        "rawText": "allowing you to hold your toe Edge through a full Landing if you slide your flat base or heel Edge that's a good indication that you looked up from your blind lighting too soon and you need to hold it a little bit longer next time on by ideal front side 7 it's going to feel like one constant rotation where you spot the knuckle and hold that spot through the full duration of the spin your first few attempts you might find",
        "timestamp": 633,
        "endTime": 653,
        "duration": 20
      },
      {
        "stepNumber": 25,
        "summary": "When spinning a Frontside 720, focus on keeping your eyes locked on the takeoff knuckle even as you pass the 450-degree mark. This will properly position your upper body, enabling you to complete the full rotation.",
        "rawText": "yourself getting stuck at 540 and needing to really Force around for 180 this is all going to come from not leading the rotation with your eyes it's important for when you're coming through your spin around 450 but you keep your eyes looking at the knuckle as you fly past it this will go and put your upper body in the proper position allowing you to finish a spin with counter rotation getting the seven around a few things",
        "timestamp": 654,
        "endTime": 675,
        "duration": 21
      },
      {
        "stepNumber": 26,
        "summary": "If you're learning frontside 720s, first master fully rotating your frontside 540s. Ensure you're landing your front five in a completely rotated and stacked position.",
        "rawText": "you can do to get more comfortable this motion without trying the front seven are one making sure that your front fives are completely rotated there is a massive difference between doing a front five lining on your heel Edge under rotated versus Landing your front five fully rotated in your stacked position so if you're struggling with getting the rotational power in a front seven go back to the front five and get them to",
        "timestamp": 677,
        "endTime": 698,
        "duration": 21
      },
      {
        "stepNumber": 27,
        "summary": "Practice landing consistently in the \"sweet spot\" of the jump before attempting a Frontside 720. This will build confidence and ensure you have the correct speed for the trick.",
        "rawText": "the point where you're Landing stacked two because you're going to be coming into the landing blind on a front seven you want to make sure you're very comfortable with a jump I'd recommend hitting the jump and getting super comfortable with Landing in a sweet spot so when you drop in for a front 7 there doesn't need to be any doubt in your mind that you're not going to have a correct speed when hitting it when you do a front seven your point of spot is",
        "timestamp": 700,
        "endTime": 720,
        "duration": 20
      },
      {
        "stepNumber": 28,
        "summary": "Focus on nailing the jump approach and spotting. If you're comfortable with the jump and can consistently spot your landing after a frontside 540, the frontside 720 should be achievable.",
        "rawText": "the knuckle of a jump so if you're going and coming up short or going too deep it can mess up your spotting Point making it harder to commit to the rotation so take your time get comfortable with the jump and it's going to make the front seven a lot easier the last tip is trust yourself if you can do a good five if you have a constant spot locked in on your front free you're going to be able to do the front seven there's a lot of",
        "timestamp": 723,
        "endTime": 744,
        "duration": 21
      },
      {
        "stepNumber": 29,
        "summary": "Focus on a good takeoff and head position to successfully land a Frontside 720. Believe in yourself, feel confident, and put in the work on the foundational steps.",
        "rawText": "ways to cheat a front seven by adding counter rotation speeding up the spin scruffing it around there's a bunch of possibilities so as long as you go and set yourself up with a good takeoff and good head position you'll be able to get this trick around so believe in yourself feel confident put in the work on the prior steps and you'll be able to tackle the front seven and absolutely lace it",
        "timestamp": 745,
        "endTime": 765,
        "duration": 20
      },
      {
        "stepNumber": 30,
        "summary": "Start your frontside 720 by switching from your toe edge to your heel edge as you go through the takeoff. Close your body halfway up the jump, then extend, snap your spin, finishing the snap as your tail leaves the lip.",
        "rawText": "in no time recap approach the jump on your tow Edge start switching to your heel Edge after you go through the spoon of the takeoff keep your body closed off into halfway up the takeoff with a slight bending your legs and body start extending and snapping your spin halfway up the jump finishing your snap as your tail leaves the lift of the jump with your upper body rotated 90 bring your",
        "timestamp": 767,
        "endTime": 788,
        "duration": 21
      },
      {
        "stepNumber": 31,
        "summary": "Lock your eyes on the knuckle and rotate through the jump, letting go of the grab at the 540 mark. Counter-rotate the final 180 degrees while keeping your eyes focused, and land slightly under-rotated, digging in your toe edge.",
        "rawText": "legs up to your grab around 270 lock your eyes on the knuckle and rotate around your spot let go of a grab at 540 and counter rotate 180 as you keep your eyes locked on the knuckle land slightly under rotated while digging in your tow Edge hold the landing long your V feels natural look up and ride away and that's how to front side 720 I'm Tavis from",
        "timestamp": 791,
        "endTime": 812,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "backside-900",
    "trickName": "Backside 900",
    "aliases": [
      "bs 900",
      "back 900",
      "backside nine",
      "bs nine"
    ],
    "videoId": "CdshWEEKjXc",
    "videoTitle": "How To Backside 900 Like A Pro",
    "totalDuration": 461,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "Focus on spotting the knuckle with your eyes and lead the rotation with your upper body, then finish the rotation with your legs. This will be a key motion to master.",
        "rawText": "principles for this is because we're going to be using the spot from the back five and a take off of a back seven it's really crucial that you have your back thighs with that constant spot so you can lock your eyes on the knuckle and lead the rotation of your upper body and rotate through finishing the rotation with your legs because this is going to be a really crucial motion for moving onto the back nine and then the next step is you want to make sure you have",
        "timestamp": 26,
        "endTime": 48,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "If you can confidently land a Backside 720 on jumps of 10-15 feet, you have the necessary power and control to start practicing Backside 900s. Focus on maintaining your current technique and control, as no additional power is needed.",
        "rawText": "your back sevens super solid on 10 to 15t jumps this means you're going up and spinning your back seven and finishing rotation Landing stacked if you can go and do a back seven on that size of a jump and land stacked in control you'll know that you have enough power to start working the back nine because for a back n we don't need to add any more power to",
        "timestamp": 49,
        "endTime": 69,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "Let your upper body lead the rotation from the start of your backside 900. This will allow you to use counter-rotation as you finish the trick.",
        "rawText": "rotation than a back seven this is because we can finish it with counter rotation just like the back five so it's important to go get that strong takeoff good snap good spot and let your upper body lead the rotation giving you the ability to use counter rotation if you need let's talk a little bit about what you need to do to get your back back seven into a back nine when you start coming around for a back nine your",
        "timestamp": 71,
        "endTime": 92,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "To land a Backside 900, initiate the rotation with your upper body leading the spin. This proactive setup will help you match the landing of the jump.",
        "rawText": "access will be slightly different than on a back seven this is because you're letting your upper body lead for the rotation and you're preemptively setting yourself up to match the landing of the jump so the biggest difference of the back nine to a back seven is with slight access if you do a back seven on a back n axis you're going to see the rider coming in tail heavy because that would go and set them up through the perfect twft landing on the back nine so that's",
        "timestamp": 94,
        "endTime": 114,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "Make sure you land in the sweet spot to stomp your backside 900.",
        "rawText": "why it's really important to let your upper body leave the rotation of Back N pulling into it setting you up to go and get into that Landing with that 2T stop because back NES have a lot of rotational Force so we're going need to go and control that and slow it down there's three things that can really help you stomp a backside 900 first thing you can do to help you stomp a back nine is make sure you're Landing in The Sweet Spot Landing in The Sweet Spot",
        "timestamp": 117,
        "endTime": 137,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "Before attempting a Backside 900, master Backside 7s, focusing on landing in the sweet spot. This will help you maintain consistent rotational speed and stick the landing.",
        "rawText": "will make it so you get less impact hitting the landing allowing you to digging your Edge and right away clean so before trying a 900 make sure you bet you did a couple back sevens where you landed sweet spot because it's going to really help an ideal Back N has you setting the spin and continuing that same speed of rotation until you hit the landing but I'm going to show you two ways that you can go in cheapest",
        "timestamp": 139,
        "endTime": 159,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "Use counter-rotation for the last 180 degrees of the spin. This speeds up your spin while also slowing down your overall rotation, making the landing more manageable.",
        "rawText": "rotation and make it easier to control the first way you can make it easier to land a back nine is by using counter rotation for the last 180 counter rotation does two things first of all it speeds up the spin second it slows down your overall rotation speed when you counter rotate you actually slow down your maximum speed of rotation this is why if you use counter rotation early in",
        "timestamp": 160,
        "endTime": 181,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "As you approach the landing of your backside 900, use counter-rotation on the last 180 degrees of your spin to slow down your rotation. This technique helps you stick the blind landing and avoid sliding out.",
        "rawText": "the speed it's going to cause disconnect and slow down your spin but if you use it for the last 180 it has the double factor of speeding up your rotation while killing your spinning momentum so that way if you use counter rotation you're going come in with less momentum making it easier to hold the blind landing and not slide out to heels this technique is usually used when you're going a little bit slower than you expected of a jump because it helps you",
        "timestamp": 183,
        "endTime": 204,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "Let go of your grab *earlier* than you normally would. This will help maintain a consistent rotation speed, which is key when learning a new trick like a Backside 900.",
        "rawText": "speed it up and it helps you go and kill your momentum what really helps if not Landing that sweet spot of the jump because it's going to make it easier to control the landing the next thing you can do to really help your back nines is let go of a grab earlier than normal you generally want to grab for as long as possible but when learning a new trick we want to focus on getting a constant rotation speed and when you let go of a grab you're able to do a few things you",
        "timestamp": 206,
        "endTime": 227,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "To control your backside 900 rotation speed, actively adjust your body tension. Tighten your core and pull your knees in to speed up the spin, or soften your body and extend to slow it down.",
        "rawText": "can pull your knees in you're able to tighten your core you're able to go and increase your rotation speed or you can do the opposite and extend soften up and that slow down your rotation this is why you can go and control your spin so much more by letting go of a grab a little bit early we often use the phrase in snowboarding flexing every muscle in the body when I do a back nine and I really",
        "timestamp": 228,
        "endTime": 248,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "To initiate the Backside 900, try two opposite approaches: either tighten up your body and pull in with your upper body (maybe even flex your eyes) for a fast rotation, or make yourself big and spread out your arms to slow down the rotation.",
        "rawText": "need to get it around I let go of a grab and I go and tighten everything up making sure I'm pulling in with my upper body sometimes I even feel like I'm flexing my eyeballs to help get that rotation around and then I also do the opposite where I let go of a grab I go make myself big spread out my arms and slow down my overall rotation speed this is really useful if you're going and",
        "timestamp": 250,
        "endTime": 270,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "If you're overshooting a backside 900, release your grab and expand your body to slow down your rotation and adjust your landing. This gives you more time in the air to correct your spin.",
        "rawText": "overshooting a jump because if you snap your spin with enough rotational force that you land perfect in sweet spot if you land deep on the jump you're going need to slow down that speed and the best way to do it is by letting go of that grab and expanding yourself backside 900s are one of the first tricks where you'll have enough time in the air to decide you don't have it for example you can be going for a backside 900 realize that you're not going to",
        "timestamp": 273,
        "endTime": 294,
        "duration": 21
      },
      {
        "stepNumber": 13,
        "summary": "If you're under-rotating on a Backside 900, it's okay to land a 720 instead. This is easier if you have a flatter axis rotation.",
        "rawText": "clear the knuckle and you can stop it at 720 you generally want to commit to every trick you're doing in snowboarding but if you're coming up short on a back nine it's okay to pull out and do a seven this is one of the reasons it's useful to have a flatter axis rotation because it makes it more flexible for pulling out and adjusting what spin you're doing so generally you want to lace it every time but this is the first",
        "timestamp": 296,
        "endTime": 317,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "Focus on controlling your rotation in the air, and decide early if you'll land a 720 or commit to the 900. Practice backside spins flat to improve your ability to adjust in the air.",
        "rawText": "trick you'll really be able to decide in the air if you have enough rotation or you need to keep it at seven so don't force it don't try to twist around last second instead go engage Where You Are and control and come into the landing either seven or commit to the nine this is why I highly recommend going and getting your backside spins flat because it makes it so much safer to make adjustments when you really cork a spin",
        "timestamp": 319,
        "endTime": 340,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "Focus on keeping your rotation flat while learning backside sevens, as this will help you progress to a backside 900 and beyond. This means keeping the board as level as possible throughout the spin.",
        "rawText": "you're committed to that axis of rotation because you're only going to come to your feet once you go and finish that complete rotation but by keeping your rotation flat you'll be able to do the seven same axis do the nine and then you can even transition it to 10 in the future so if you're really quirky on on your back sevens I recommend taking the time and learning how to do them in a flatter access because it's going to",
        "timestamp": 342,
        "endTime": 363,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "To safely learn a Backside 900, ensure your Backside 720s and Backside 540s are consistently locked in. Consider using video analysis to assess your progress if you don't have a coach.",
        "rawText": "make this trick a lot safer and future trick safer back ns are a really complex trick that you need to make sure that you have your back sevens and back fives locked in it's really hard to tell if your tricks are ready to move them on to the next point so if you're thinking about trying this trick and you don't have a coach I highly recommend checking out addiction Plus on addiction plus we have a feature called video analysis where you can submit a clip of your",
        "timestamp": 365,
        "endTime": 386,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "Find a 20-30ft jump and carve a backside 7 setup, carving slightly harder than you would for a backside 7, then spot under your back arm grabbing around.",
        "rawText": "want to help getting into that next level check out addiction plus it's the most affordable program on the internet and I really believe it's the best tool we have to improve your riding recap find a 20 to 30ft jump do your normal backside 7 setup carve slow just slightly harder than for a back seven spot under your back arm grabbing around",
        "timestamp": 410,
        "endTime": 430,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "Lead your upper body rotation and eyes past the jump's knuckle, then hold your toe edge in the blind landing longer than you think you need to before looking up.",
        "rawText": "270 hold your eyes on the knuckle as you rotate around your spot use your judgment to decide if you can continue to hold the grab or you need to let go to make adjustments continue to lead the rotation of your upper body let your eyes past the knuckle tracking uphill finishing in that blind Landing dig in your tow Edge and hold that blind Landing for longer than you think then look up and ride away hopefully that",
        "timestamp": 433,
        "endTime": 454,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "frontside-900-like-a-pro",
    "trickName": "Frontside 900 Like A Pro",
    "aliases": [],
    "videoId": "Tdj5eI7SLC4",
    "videoTitle": "How To Frontside 900 Like A Pro",
    "totalDuration": 549,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "Don't rush the rotation when attempting a frontside 900. Avoid overextending your upper body, as this is a common mistake that can disrupt the trick.",
        "rawText": "attached onto it this is a good way to actually think about spinning these tricks because it can help you visualize the second half of the motion the big issue of visualizing your front N9 like this is it can make you want to rush into the access of rotation you're feeling comfortable with what is my biggest issue on the front nine you can see it a lot where I'll go and overextend my upper body trying to get",
        "timestamp": 67,
        "endTime": 87,
        "duration": 20
      },
      {
        "stepNumber": 2,
        "summary": "To generate the necessary rotational force for a frontside 900 without disconnecting your spin, focus on overextending your upper body during the rotation. This will allow for the power needed for the front nine.",
        "rawText": "more power more snap and that's going to make my legs drag behind making a disconnect in my rotation the main reason this is happening is because I'm opening my upper body making it so I don't have as much range of motion to play with but I still need that power because a front nine takes a lot of rotational Force so what do I do I go and overextend my upper body pushing the rotation causing a disconnect this is",
        "timestamp": 89,
        "endTime": 111,
        "duration": 22
      },
      {
        "stepNumber": 3,
        "summary": "To ensure a consistent frontside 900, generate enough rotational force on takeoff to complete the spin without getting disconnected in the air. This will allow for the most stable and controlled spin.",
        "rawText": "the biggest thing you want to avoid on your front nines because it's going to make it so your spins are inconsist consistent and not one solid motion what's really important for a strong front nine the ideal takeoff on a front nine has you leaving with enough rotational Force to get the front nine around but not so much that you get disconnected in the air a great way to tell if you had enough snap is if you're",
        "timestamp": 114,
        "endTime": 134,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "To improve your frontside 900, focus on snapping your legs behind you for more power, rather than letting your upper body lead the rotation and over-exaggerating your takeoff. This will allow for a better takeoff and control through the rotation.",
        "rawText": "getting the full rotation but can still grab at 270 if you can't grab into around 450 that's a good indication that you're going and snapping too much off the takeoff letting your upper body lead the rotation Mak it into your legs leg behind in order to generate more snap and power without overexaggerating your takeoff the only thing you can do is speeding up your snap this means you",
        "timestamp": 137,
        "endTime": 158,
        "duration": 21
      },
      {
        "stepNumber": 5,
        "summary": "To generate the power for a frontside 900, stay closed off longer on the approach and then quickly snap your body into the rotation just before takeoff. This quick snapping motion is key, even though it makes the trick harder to execute.",
        "rawText": "need to be even more patient coming to a take off staying closed off a little bit longer so that way you can go and snap faster without overextending it's this quick snap motion that's necessary to generate the power needed for a front nine the quicker you do your snap the more power will be behind it the only hard part is the quicker you do it the easier it is to mess it up so this is",
        "timestamp": 160,
        "endTime": 180,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "Practice frontside 7s and 5s off small jumps to master fully popping and rotating without overextending your upper body, focusing on a strong, quick snap off your tail.",
        "rawText": "where the skill cap really comes in on front side 900s in order to train this do a bunch of front sevens and a bunch of front fivs off really small jumps getting really comfortable with fully popping and fully generating your rotation without overextending your upper body you want to be leaving off the lip feeling the strong power off the quick snap leaving off your tail with having your whole core and body",
        "timestamp": 182,
        "endTime": 203,
        "duration": 21
      },
      {
        "stepNumber": 7,
        "summary": "To land a frontside 900, shorten your setup carve and delay your edge change. This will help you stay closed off and prevent your upper body from opening up too early, allowing for a stronger snap.",
        "rawText": "connected together the best way to go and do this is by shortening your setup car making sure that you're waiting and delaying when you get in your heel Edge will make it so you can go and stay closed off more naturally because the biggest problem you'll see on bigger front side spins is people getting antsy and letting their upper body open up before it's time to generate the snap and that's going to result in you need",
        "timestamp": 205,
        "endTime": 226,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "Maintain patience and avoid opening your upper body too early. Also, delay engaging your heel edge and ensure you're lifting off the tail of the board for maximum rotation.",
        "rawText": "to overextend your upper body causing that disconnect every time that's why I always tell myself when dropping in for front nine front 10 to be patient making sure that I'm not letting my upper body open up and I'm making sure if I'm not getting on my heel Edge too soon because the next part to getting a good front nine is leaving off your tail the more you scrub the less you're going to get",
        "timestamp": 227,
        "endTime": 249,
        "duration": 22
      },
      {
        "stepNumber": 9,
        "summary": "Delay your setup carve to create a natural arc off the jump. This will make it easier to commit to the rotation and land smoothly for a Frontside 900.",
        "rawText": "the Arc of the jump this is why delaying your setup carf will let you snap off your tail putting more on a natural Arc of the jump making it easier to go and commit for rotation and get into a landing because front lines used that switch front side Landing that's really hard to commit to if you don't have the proper Arc going into the landing another way to increase power off a",
        "timestamp": 250,
        "endTime": 270,
        "duration": 20
      },
      {
        "stepNumber": 10,
        "summary": "To generate more power for your Frontside 900, delay the start of your snap off the takeoff. This means you'll need to rotate faster to complete the spin.",
        "rawText": "takeoff is increasing the speed of your snap when doing a lofty like front three your snap is going to start around halfway off the takeoff and you're going to have a slow rotation as you leave the lip but in order to get more power we can actually make this motion quicker by going and delaying when we start our snap we'll have to do it faster and the faster we do it the more rotational",
        "timestamp": 272,
        "endTime": 292,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Practice a quick, powerful snap on smaller jumps to get comfortable with the motion before attempting a Frontside 900 on a larger jump. This will help you manage the harsher angles and any takeoff imperfections.",
        "rawText": "power we're going to have coming off a lifp of a jump the issue with a faster snap is it makes it so your angles are more harsh so if you have a little bit of Jank in your takeoff it's going to be more exaggerated because you're going into it with more power in a quicker motion that just means you want to get really comfortable with a quicker faster snap on smaller jumps before moving on to a bigger jump and trying a bigger",
        "timestamp": 295,
        "endTime": 316,
        "duration": 21
      },
      {
        "stepNumber": 12,
        "summary": "Once you've rotated 450 degrees, actively pull with your back arm to initiate the backside rotation needed for the rest of the 900. Focus on this arm pull to complete the spin.",
        "rawText": "trick like a front nine I have a really hard time grabbing before 450 but this really highlights the second part of the spin and that is because it's really like a backside rotation once you get through about first 450 what I mean by that is you want to be grabbing and been pulling with your back arm into a spin if you don't let yourself pull into the",
        "timestamp": 318,
        "endTime": 338,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "Focus on actively engaging your muscles throughout the frontside 900 rotation. Use the same \"spawning\" technique as you do for front sevens and fives, spotting the knuckle and then looking forward.",
        "rawText": "rotation you're not going to be able to get into that Landing that two footed stomp what brings us to the in the air part of the front nine it's going to be using the same spawning principles as you use for front sevens and front fives where you're going and constantly spaw the knuckle and then as you pass it you let your gaze continue on forward it's really important to be active activ L engaging your muscles the whole time",
        "timestamp": 339,
        "endTime": 360,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "Engage your glutes, core, hips, and shoulders to initiate the frontside rotation, pulling into the spin. This active engagement is crucial for controlling the rotation and making adjustments mid-air.",
        "rawText": "you're in the jump on the front nine this means you're pulling in with your glutes your core your hips your shoulders every part of your body is pulling and leading into that rotation so much so that sometimes you'll feel like you're even flexing your eyes to get that little bit of the extra rotation because it's a lot easier to slow down a front nine than it is to speed it up this makes for two parts",
        "timestamp": 361,
        "endTime": 381,
        "duration": 20
      },
      {
        "stepNumber": 15,
        "summary": "Focus on a powerful takeoff with good extension, grab at a 270 spin point, and then pull your whole body into the rotation while locking your eyes on the landing, ensuring a full feet landing.",
        "rawText": "that make a front nine being that takeoff where you're going getting a good extension that lets you go and grab at two 70 and then pulling into the spin locking your eyes on the knuckle as you pull with your whole body into that rotation flexing and pulling it around until you go and see the landing and can land on full feet at the same time this requires a Bel as much power as a front",
        "timestamp": 383,
        "endTime": 404,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "After grabbing the board during your Frontside 900, let your upper body rotate an extra 90 degrees past your legs. This allows you to \"pull back\" the spin and utilize counter-rotation to complete the rotation.",
        "rawText": "side 10 because we can't really utilize counter rotation but what you can do to make it a little bit easier to rotate is let your body leave the rotation after you get the grab what I mean by this is when you grab you can actually go and pull with your upper body having your upper body rotated around 90 more de than your legs are this makes it so you can go and pull back the spin with counter rotation anytime you see",
        "timestamp": 406,
        "endTime": 426,
        "duration": 20
      },
      {
        "stepNumber": 17,
        "summary": "Pull with your upper body throughout the spin, then use counter-rotation with your arm to accelerate your rotation at the last second, allowing you to spot the landing and complete the 900.",
        "rawText": "someone's arm come back in front of them like this that means you're utilizing counter rotation to pull in between back a line and this can help go and speed up your rotation at that last second and that's why it's so crucial to be pulling with your upper body the whole way through the spin because then you can be at 7 see the landing and finish off that spin if needed this is one of the best",
        "timestamp": 428,
        "endTime": 448,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "To prepare for a frontside 900, carve into your heels after the jump's \"spoon\" and keep your shoulders and hips closed off to the jump until the moment you initiate the spin.",
        "rawText": "break it down and if you're not ready to front nine we'll tell you but not only that we'll also tell you how to get ready because our goal and addiction plus is to improve as many people's riding as possible sign up now and let us improve your riding recap be patient with your setup carve swap into your heels after the spoon of the jump keep your shoulder and hips closed off to the jump until it's time to snap time your",
        "timestamp": 474,
        "endTime": 495,
        "duration": 21
      },
      {
        "stepNumber": 19,
        "summary": "As you leave the jump's lip, reach for the grab around 270 degrees, keep your eyes on the landing, and use your upper body to lead the rotation. Pull yourself into the landing, ensuring you land over your toes with both feet down.",
        "rawText": "snap so you finish extending as your tail leaves the lip of a jump bring your body back aligned and reach the grab around 270 lock your eyes on the knuckle and pull the rotation around using every part of your body pull more than you think letting your upper body lead for rotation by a little bit then pull yourself into the landing making sure that you're getting over your toes and getting both feet down to the ground",
        "timestamp": 498,
        "endTime": 519,
        "duration": 21
      },
      {
        "stepNumber": 20,
        "summary": "Land with both feet stacked and look up to ride away. Mastering the frontside 900 requires the same power and split landing challenge as a frontside 1080, so take your time to learn it well.",
        "rawText": "land both feet stacked look up and ride away front nines are one of the most tet tricks in snowboarding if you do one in front of people that know what's up they're going to lose their mind and get absolutely stoked this is because it has just as much power needed as the front tent with that really challenging split front side Landing so if you want to be a beast take your time learn the front 9es because after that front 10 will be",
        "timestamp": 521,
        "endTime": 541,
        "duration": 20
      }
    ]
  },
  {
    "trickId": "frontside-1080",
    "trickName": "Frontside 1080",
    "aliases": [
      "fs 1080",
      "front 1080",
      "frontside thousand eighty",
      "1080",
      "ten eighty"
    ],
    "videoId": "0luOaDmSTW4",
    "videoTitle": "The Key For Frontside 1080's",
    "totalDuration": 554,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "Focus on mastering frontside 720s and 900s, as the same fundamental skills, power, and control are crucial for landing a frontside 1080. Practice these rotations until your form is solid before attempting the 1080.",
        "rawText": "fundamental skills for our front side 1080 but what we do need is very strong fundamentals on the front sevens and front 9 this is because we're going to be using the same skills and just carrying them over adding more power adding more control and that's what's going to let us do the 1080 so that's what I'm going to talk about in this video I'm going to show you how we can go and make sure that our form is locked in so when you try the front 10 you'll",
        "timestamp": 23,
        "endTime": 44,
        "duration": 21
      },
      {
        "stepNumber": 2,
        "summary": "To land a Frontside 1080, extend fully off the takeoff to maintain a flat rotation. Avoid dipping or cheating your takeoff, as this will disrupt your axis of rotation.",
        "rawText": "be able to lace it hopefully first try there's a few points we need to hit on every front 10 attempt and we're going to start with our takeoffs on a fride 1080 we need to keep our rotation very flat this means you need to make sure that you're getting fully extended off the takeoff because if you start dipping up and and over your shoulder or cheating your takeoff it's going to be harder to keep that strong flow that'll let you contain the same axis of",
        "timestamp": 46,
        "endTime": 67,
        "duration": 21
      },
      {
        "stepNumber": 3,
        "summary": "To make a Frontside 1080 easier, narrow your approach and delay your setup carve. This reduces the time spent on your heels, allowing for more extension off the tail of your board for the rotation.",
        "rawText": "rotation throughout the full spin there's three things that make this easier to do first off is approach by narrowing in our setup carve we'll be able to spend less time on our heels this makes it so you have the less chance to scrub meaning that you're going to get more extension off the tail of your snowboard in order to do this delay your setup carve make sure you're not going and switching to your heel Edge and shot after you fully have gone",
        "timestamp": 69,
        "endTime": 90,
        "duration": 21
      },
      {
        "stepNumber": 4,
        "summary": "Focus on extending fully as you leave the lip of the jump, rather than winding up, to generate power for the frontside spin. This maximizes your rotation.",
        "rawText": "through the spoon of a jump because it's crucial to make sure you're leaving as much off your tail as possible because that's going to put you up with the jump and it's going to really initiate your rotation second is your wind up you don't want to wind up any extra for a front T because that's not where power comes on front side spins instead power comes from staying closed off and getting that full extension as you leave the lip so I want you when you're doing",
        "timestamp": 92,
        "endTime": 114,
        "duration": 22
      },
      {
        "stepNumber": 5,
        "summary": "To maintain power and control for your Frontside 1080, keep your front arm closed, hips squared (or even slightly closed) towards the takeoff, and time your snap so it finishes as your tail snaps.",
        "rawText": "your front T to just make sure that you're not letting your chest or hip open towards the takeoff instead making sure that your front arms closed off and your hips are squared if not even a little bit closed this is all the range of motion from a windup you're going to need to generate power but you need to pair that with the third step and that's your timing the ideal timing has you finishing your snap as your tail snaps",
        "timestamp": 116,
        "endTime": 136,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "Focus on keeping your upper body closed until the moment you snap into the rotation off the takeoff to maximize your range of motion. This will help you maintain a consistent and powerful rotation.",
        "rawText": "off the takeoff this will put you in the proper Arc of a jump while putting you in what we call the vortex and that is when you're in a consistent powerful rotation where you don't need to worry about correting your balance there is two main issues of timing first of all is letting your upper body open up to a jump before you start your snap this will just limit the range of motion you can utilize because if you're opened up",
        "timestamp": 139,
        "endTime": 159,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "To avoid over-rotating on your frontside 1080, avoid opening your chest too much on the takeoff. This prevents you from needing to hyper-extend your body for power, which can throw off your rotation.",
        "rawText": "like this your range of motion will be a lot smaller versus closed off to full what brings us into the second problem and that is over exaggerating your takeoff this happens a lot when you're coming into a jump with your chest open because it makes it in order to get your full power off a takeoff you need to go and hyper extend your body making it so your legs can fall behind your upper",
        "timestamp": 161,
        "endTime": 182,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "Focus on three key elements for power: 1) Maximize core extension as you snap off the tail. 2) Keep everything tight. 3) Pull your legs in together to grab around 270 degrees.",
        "rawText": "body what isn't ideal because we want it so our snap goes snaps us off a tail with a max amount of extension in our core but we can still keep everything tight and pull our legs in together allowing us to grab around 270 those are the three things that give you power on your front side spins and they're going to be really crucial to lock in before trying a front 10 the best way to train this is just by doing front sevens and",
        "timestamp": 184,
        "endTime": 205,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "Practice and master frontside 7s off small jumps, utilizing the same timing and \"spotting\" technique (eyes on the jump's knuckle) you'll use for a frontside 1080.",
        "rawText": "front 9es off of small jumps you you should be able to comfortably do front sevens off of 15t jumps before even thinking about trying a front 10 because you're going to be using that same timing that same spot that same Vortex on a small front 7even as you will be for the front 10 the next thing we need to go over is spotting just like every other front side spin your goal is to lock your eyes on the knuckle and rotate",
        "timestamp": 207,
        "endTime": 228,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "To complete the frontside 1080, actively lead the rotation with your upper body. This allows for proper counter-rotation and a stacked position over your board.",
        "rawText": "around it using the constant spot by Leading the rotation of your upper body you'll be able to finish your front T utilizing counter rotation as well as being more stacked over your board this is one of the challenges of your first time trying a front 10 because you'll have a very clear moment going from 7 to 10 where you can spot the knuckle and decide I'm going to pull out so it's going to take you a little bit to get",
        "timestamp": 230,
        "endTime": 250,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "To land a frontside 1080, ensure a clean takeoff by going straight with the jump and avoiding any drifting. This helps you maintain a consistent visual spot, which increases your confidence and aids in a successful landing.",
        "rawText": "comfortable with the motion of rotating to seven and then continuing your constant spot what really helps with a constant spot is making sure you aren't drifting when you drift on a jump it becomes a lot harder to track the same point on the knuckle and feel confidence that you're going to make it into the landing but by going getting a clean snap making sure that you're going with the jump and not drifting across you'll",
        "timestamp": 252,
        "endTime": 272,
        "duration": 20
      },
      {
        "stepNumber": 12,
        "summary": "Eliminate any drifting from your frontside spins to prepare for a Frontside 1080. Focusing on clean rotations will make the final 360 of the 1080 feel more natural.",
        "rawText": "be a to lock your eyes on and it's going to feel a lot more natural going and pulling in into that last 360 that you need for the 10 so if you're drifting on your front side spins take a step back and get that drift out of your riding because it's going to really be necessary when moving on to a 1080 the last thing you need for easy front 10 is getting comfortable Mak can't you have a sweet spot of a jump if you start coming",
        "timestamp": 274,
        "endTime": 294,
        "duration": 20
      },
      {
        "stepNumber": 13,
        "summary": "Ensure consistent landings on the jump's \"sweet spot\" to confidently commit to the final rotation of a Frontside 1080. Avoid stopping at the front nine, which often leads to a heelside landing and a fall.",
        "rawText": "up short or going too big it's going to be really hard to commit to that last Blind part of a rotation so getting really comfortable with the jump being consistent Landing that sweet spot will let you fully commit to getting the spin around the most common fall you'll see on a front 10 is deciding you don't have enough air time and pulling out at front nine this usually results in a heelside landing where you then slap to your back",
        "timestamp": 296,
        "endTime": 317,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "To safely learn a Frontside 1080, master the Frontside 900 first. This builds the muscle memory necessary to adjust mid-air and land safely if you under-rotate the 1080.",
        "rawText": "this is one of the biggest Falls I make on my front pen attempts and this is because I'm not comfortable with my front nine so if I'm under rotating a front 10 I don't have a muscle memory to go and walk in and get over to my toes and land at that front nine that is one of the reasons it's so crucial to get a solid front nine to make front 10 way safer because then if you miss the snap you can adjust and land at 900 as well",
        "timestamp": 320,
        "endTime": 341,
        "duration": 21
      },
      {
        "stepNumber": 15,
        "summary": "If you want to learn a Frontside 1080, master Frontside 900s first. Practice the melon grab, as it aids in rotation and allows you to continue spinning.",
        "rawText": "as doing the front N9 will give you all the fundamental skills you need for the front 10 so if you're scared of a front 10 go get your front nines it's going to be hard but it will really pay off depending on the grab you do your access rotation will be different on the front 10 that's why I recommend the melon grab the melon grab has two perks the first one being it goes and lets you continue rotation because it's leading with your",
        "timestamp": 344,
        "endTime": 366,
        "duration": 22
      },
      {
        "stepNumber": 16,
        "summary": "Use a melon grab (grabbing the heel edge with your front hand) to initiate and control your frontside 1080. This grab helps keep your rotation flat and consistent, while your back arm can be used to adjust the speed of your spin.",
        "rawText": "front arm grab down letting you go and pull into a spin as well as having your back arm free to adjust your access of rotation or slow down the spin the other bonus of the melon grab is it helps keep your rotation flat because you're able to go and keep your spot consistant at the same point and you don't really need to reach out of your way to get the grab so I'd say melon grab is is the easiest",
        "timestamp": 367,
        "endTime": 388,
        "duration": 21
      },
      {
        "stepNumber": 17,
        "summary": "To land a frontside 1080, delay your grab until after you've rotated at least 270 degrees. This ensures you're getting full extension off the lip of the jump and maximizes your rotation.",
        "rawText": "grab for flat front tents for any grab you choose to do it's really important to make sure you're not grabbing before 270 if you manage to grab before 270 it's a great indication that you cut your snap short in order to break and reach for that grab a front 10 takes full extension off the lip so it should be almost physically impossible to get that full extension and then grab the 4",
        "timestamp": 390,
        "endTime": 410,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "Focus on a full, powerful snap off the jump, and let the grab come naturally. Also, choose a jump that's 35-50 feet with minimal kick to keep your rotation flat.",
        "rawText": "to70 so aim to get your full snap and then let the grab come to you naturally because the rushing this process is one of the things you can do to really lessen the amount of power you're getting off the lip and the last ingredient for a successful front 10 is picking the right jump you want to find a perfect 35 to 50t jump without too much kick this is because we're trying to keep our rotation flat and we want",
        "timestamp": 412,
        "endTime": 433,
        "duration": 21
      },
      {
        "stepNumber": 19,
        "summary": "To improve your chances of landing a frontside 1080, find a jump that's at least 35-50 feet long for a smoother, more controlled rotation. A well-built jump will significantly aid in the execution of the trick.",
        "rawText": "that nice long takeoff in order to generate rotation you can rotate front ends really fast I've done going on 20ft jumps but they feel way better on 35 to 50t jumps so if you don't have a proper jump in your Resort it might be worth venturing out over to Whistler some other Resort that makes better jumps because a really good jump will really help you with your front TS I wouldn't",
        "timestamp": 435,
        "endTime": 456,
        "duration": 21
      },
      {
        "stepNumber": 20,
        "summary": "Make sure you're comfortable with the jump you're using for your frontside 1080. Choose a jump that's not too kicky to set yourself up for success.",
        "rawText": "be able to just pull up at my local Resort and do a front 10 knowing the kind of Groom quality that's to bear so make sure that you have a jump that you're really comfortable with and is ideally not too kicky and will really put you on the right path to success it can be insanely hard to go and figure out what you're doing wrong especially once you start getting to tricks as complex as a 10",
        "timestamp": 458,
        "endTime": 478,
        "duration": 20
      },
      {
        "stepNumber": 21,
        "summary": "To learn a Frontside 1080, find a medium-sized jump and build speed. Focus on a late setup, switching edges after the lip, staying closed off, snapping your spin off the tail, and extending at the end of the rotation.",
        "rawText": "dial in your writing and get you to a point where you can do the frontend and if you're at that point we can give you that little extra confidence to go and try it cap find a good 35 to 50t jump get your speed locked in have a late setup carb switching edges after the spoon of the jump stay closed off when riding up the lifp snap and spin leaving off your tail finishing your extension",
        "timestamp": 501,
        "endTime": 522,
        "duration": 21
      },
      {
        "stepNumber": 22,
        "summary": "Focus on the knuckle as you rotate, leading the spin with your head and keeping your eyes locked on the landing spot as you pass the knuckle, then dig your toe edge to stop and ride away cleanly.",
        "rawText": "as your tail snaps off grab at 270 while locking your eyes on the knuckle continue leading the rotation of your head hold your spot on the knuckle as you pass it locking your eyes in that blind landing position digging your toe wedge Stop and Ride Away clean and that is how your front side 1080 the last video in the learn to jump front side series I hope you watch the whole thing",
        "timestamp": 525,
        "endTime": 546,
        "duration": 21
      }
    ]
  },
  {
    "trickId": "back-double-cork-1080",
    "trickName": "Back Double Cork 1080",
    "aliases": [
      "back dub 1080",
      "backside double cork ten eighty",
      "back double 10",
      "BDC 1080"
    ],
    "videoId": "BAPfrEr7NXk",
    "videoTitle": "Make Back Dub 1080's Look Easy",
    "totalDuration": 647,
    "steps": [
      {
        "stepNumber": 1,
        "summary": "To learn a Back Double Cork 1080, first master a back cork 5, which involves snapping over your tail in a down throw motion. Then, combine the back cork 5 with an upward cab under flip.",
        "rawText": "want to see as many people as possible throwing these on the mountain the first step to learning a dub back 10 is figuring out what it is a duback 10 is two components first a back Ork 5 where you're snapping over your tail this is a down throw motion and then the second motion to this trick is an upward cab under flip it's by combining this back cork five with a cab under flip that you",
        "timestamp": 69,
        "endTime": 91,
        "duration": 22
      },
      {
        "stepNumber": 2,
        "summary": "To set up for a Back Double Cork 1080, use a \"stacked takeoff\" by throwing over your tail and fully extending, shifting your weight back. This will position you at a 450 degree rotation for the next part of the trick.",
        "rawText": "get the dub back 10 so how do we do this the duback 10 uses two underlining principles first is a stacked takeoff where you're throwing over your tail it's really important to get a full extension with your weight being shifted over your tail off takeoff what this will do is it will set you up at 450 for the next part of this trick the cab",
        "timestamp": 94,
        "endTime": 114,
        "duration": 20
      },
      {
        "stepNumber": 3,
        "summary": "To prepare for a Back Double Cork 1080, master the \"under flip a cab under flip,\" which is essentially a switch frontside cork 5.  This drill helps you learn the crucial shift from downward to upward rotation after spotting the knuckle on your approach.",
        "rawText": "under flip a cab under flip is a switch front side cork 5 and it's absolutely crucial to get dialed in for a dub back 10 because if a dub back 10 is combining these two principles first that snap off your tail taking around to 450 where you spot the knuckle and as soon as you spot the knuckle you shift your downward rotation into an upward",
        "timestamp": 116,
        "endTime": 136,
        "duration": 20
      },
      {
        "stepNumber": 4,
        "summary": "To initiate the Back Double Cork 1080, fully extend and snap over the tail, then execute a \"cab five\" rotation, coming up and over your shoulder. This will set you up for the complex rotation needed for the trick.",
        "rawText": "rotation ideally feeling just like a cab five for a second part of a spin because the rotation access is so complex it's actually very flexible for the access you end up using on the dub back 10 but there's the two main principles you need to hit ftic fully extended snap over the tail and that cab five where you're coming up and over your shoulder you",
        "timestamp": 138,
        "endTime": 158,
        "duration": 20
      },
      {
        "stepNumber": 5,
        "summary": "To learn a Back Double Cork 1080, master cab cork variations with different flippy and flat approaches to get comfortable with various aerial positions. This will help you avoid being in an awkward position during the second flip of your double cork.",
        "rawText": "can't do a dub back 10 without either of those two steps so even though it's a super flexible trick you need to get both of these components locked in before trying it I recommend doing these cab cork Vibes more flippy more flat just filling every possible situation because the last thing you want is to be doing a dub back 10 and end up in the second part of your flip in an access you're not comfortable with so do a",
        "timestamp": 161,
        "endTime": 181,
        "duration": 20
      },
      {
        "stepNumber": 6,
        "summary": "To prepare for a Back Double Cork 1080, master the Cab Cork 5. Your throw should be up and over your front shoulder, maintaining a tall chest with the throw angled backwards.",
        "rawText": "bunch of cab cork fives do them flippy do them cart do them flat get really comfortable with this trick because it's going to be the second half of your dub back 10 making it the safety net of the trick in order to do a proper cab cork 5 you need to follow V steps your throw needs to be up and over your front shoulder your chest should be tall with your throw angled backwards it's this",
        "timestamp": 183,
        "endTime": 203,
        "duration": 20
      },
      {
        "stepNumber": 7,
        "summary": "To learn the second half of a Back Double Cork 1080, start with a cab underflip, gradually increasing the rotation over your shoulder to make the trick more spinny. This builds the necessary motion for a smooth landing.",
        "rawText": "awkward motion of opening your chest and dipping your front shoulder that Mak makes the cab cork 5 work the best way to get this motion unlocked is just start with a cab under flip and then gradually turn more and more over your shoulder making it more spinny as you go this is the second half of a dub back 10 so it determines how you land so it's really important to build it up and get really comfortable with this trick do it",
        "timestamp": 206,
        "endTime": 227,
        "duration": 21
      },
      {
        "stepNumber": 8,
        "summary": "If you're learning Back Double Cork 1080, practice your Cab Cork 5's to perfect the flip-to-spin ratio. This will help you learn to go over your head two times, ensuring a stable landing.",
        "rawText": "on small jumps do it on bigger jumps and just do as many as you can because it's your safety net for of a dub back tent you'll know that you have a perfect cab cork 5 when you flipped to spin ratio is the same this means you'll be popping up and flipping the same amount as you're spinning allowing you to come into the landing with that two-footed stop next you're going to learn how to go over your head two times the best way to do",
        "timestamp": 228,
        "endTime": 249,
        "duration": 21
      },
      {
        "stepNumber": 9,
        "summary": "To practice the back double cork 1080, start with a Misty 5 and slightly over-rotate it to end up in a backdrop position. Then, from that backdrop position, perform a backflip.",
        "rawText": "this is the dub back Misty n on trampoline this is a much harder trick on snow so you will not be using in your progression for of a dub back 10 on an actual jump instead we're only going to be focused on this trick for the to practice this trick do a misty five and slightly overr rotate it so you end up in a backdrop from there go and do a backdrop back flip this is the feeling",
        "timestamp": 252,
        "endTime": 273,
        "duration": 21
      },
      {
        "stepNumber": 10,
        "summary": "Get comfortable with the back Misty (backflip with a grab) as this motion is similar to the Back Double Cork 1080. Practice this feeling, and consider using a mat for safe trampolining.",
        "rawText": "of the dub back Misty n where you go flip over hit your back and then pull and look backward finishing rotation get really comfy with this motion because it's exactly the feeling that you'll be getting on the dub Misty 9 your first time trying a dub make sure you have someone throwing a mat for you a mat is just a great way to make trampolining safer than it already is when using a mat we use What's called the free bounce",
        "timestamp": 276,
        "endTime": 296,
        "duration": 20
      },
      {
        "stepNumber": 11,
        "summary": "Use a 3-2-1 count, throwing the Back Double Cork 1080 on \"one\" to coordinate with your spotter and nail the timing for your trick. This helps with spotting and improves your chances of landing successfully.",
        "rawText": "system that is where you go and say three 2 one throwing the trick on one this helps you coordinate with your mat thrower when you're going to do the trick making it so it's easier for them to go and catch you so every time you're on a trampoline and you have someone throw a mat use this system three 2 one throwing the trick on the count of one just like on a snowboard it's really",
        "timestamp": 298,
        "endTime": 320,
        "duration": 22
      },
      {
        "stepNumber": 12,
        "summary": "Practice a \"dub back Misty 9\" (a Misty Flip into a backflip) to get comfortable with throwing down and then rotating upwards, which is crucial for the \"Back Double Cork 1080.\"",
        "rawText": "important to get a full extension off the trampoline this will go and set you up perfect to go and pull back into that back flip because a dub back Misty 9 is really just a straight up Misty into a back flip and it's going to be great for getting used to a feeling of throwing down and then rotating up that will be crucial for the dub back 10 once you get really comfy with a dub Back N it's time",
        "timestamp": 322,
        "endTime": 343,
        "duration": 21
      },
      {
        "stepNumber": 13,
        "summary": "To initiate a Back Double Cork 1080, flatten your initial takeoff trajectory more like a spin, instead of a straight down backflip. Then, pull over your shoulder, similar to a Cab underflip.",
        "rawText": "to do a dub back 10 foris we use the same principles but instead of looking straight back like a backflip we'll be going and pulling over a shoulder like a cab under flip this is a really tricky motion that takes a lot of muscle memory but what you want to focus on is instead of going full on down like you would for a MTI try flatten out a bit throw it a bit more like a spin and then pull into",
        "timestamp": 345,
        "endTime": 366,
        "duration": 21
      },
      {
        "stepNumber": 14,
        "summary": "To flatten your rotation and make it more spin-focused for the Back Double Cork 1080, use your back arm to aggressively pull open your shoulder as you initiate the trick. This will help you get the desired spin over the jump.",
        "rawText": "your cab under flip I like to really utilize my back arm pulling open my shoulder and this will help flatten your rotation making it so your rotation is more spinny than flippy what's really crucial for getting the tent this is still much more flippy than you'll want going off of a jump but we're using it to get used to the motion of throwing down and been throwing into our spin but",
        "timestamp": 369,
        "endTime": 389,
        "duration": 20
      },
      {
        "stepNumber": 15,
        "summary": "To prepare for a Back Double Cork 1080, master a perfect back seven off a small jump. Focus on a strong snap off the tail, consistent rotation, consistent spotting, and a solid two-footed landing.",
        "rawText": "on an actual jump we're going to want to throw it a lot more like a back seven than a dub MTI the last stage you need to get locked in before trying for dub back 10 is getting an absolutely perfect back seven off of a small jump this means you're getting a full snap off your tail a constant rotation as you're constant spotting the whole time finishing with that two-footed Landing",
        "timestamp": 392,
        "endTime": 413,
        "duration": 21
      },
      {
        "stepNumber": 16,
        "summary": "Focus on mastering the \"back seven\" (backside 720) off a small jump, as it shares key core and tail-snap techniques crucial for a Back Double Cork 1080. Achieving a good takeoff and maintaining proper head position are critical for success in the Double Cork 1080.",
        "rawText": "the snap off the tail and the constant activation of your core at needed to do a back seven off a small jump is really similar to emotion and feeling of doing a dub back 10 so you really want to get these locked on before even thinking about doing a dub back 10 your success on a dub back 10 is determined by two things your takeoff and your head position let's first break down but take off it's going to be very similar to how",
        "timestamp": 416,
        "endTime": 438,
        "duration": 22
      },
      {
        "stepNumber": 17,
        "summary": "To get your \"Back Double Cork 1080\" flippy, shift your upper body down towards the tail of your snowboard as you take off. This will help initiate the flip.",
        "rawText": "you take off for a back seven but instead of going and keeping our body aligned and Tall we're going to go and shift it all the way over the tail of our snowboards this is what's going to set us on our AIS the more you shift your upper body down towards your tail the more flippy your Dub's going to be and the more you keep it flat the more flat spin likee it's going to be the",
        "timestamp": 440,
        "endTime": 460,
        "duration": 20
      },
      {
        "stepNumber": 18,
        "summary": "When throwing the Back Double Cork 1080, extend your body fully over your tail, initiating the throw more like a spin to achieve a smooth and consistent rotation. Avoid throwing the trick directly toward your toes.",
        "rawText": "most crucial part is that your throw is set fully extended over your tail the biggest mistake I see on du back T is people throwing it straight to their toes like you would a MTI on the trampoline so make sure that you're going and throwing it more like a spin just really set over your tail because this is what's going to give you a constant smooth rotation and set you up to spot what brings us into step two",
        "timestamp": 461,
        "endTime": 483,
        "duration": 22
      },
      {
        "stepNumber": 19,
        "summary": "After snapping and grabbing, rotate about 450 degrees, then pull your head up, tucking your chin into your shoulder to set up for the second flip and ensure a 1080 rotation. Avoid throwing your head straight back.",
        "rawText": "head positioning after your snap and grab you're going to be rotated around 450 at this point you need to pull your head up tucking your chin into your shoulder this will be what sets for second flip it's important to not throw your head straight back over because this will put you on axis for the dub back nine where we're trying to do the dub back 10 so instead of going straight",
        "timestamp": 486,
        "endTime": 506,
        "duration": 20
      },
      {
        "stepNumber": 20,
        "summary": "To achieve a smooth, controlled Back Double Cork 1080, focus on driving your chin towards your back arm and dipping your upper body into the rotation. This motion should feel similar to initiating a Cab Cork 5, helping you spot and manage the spin.",
        "rawText": "over it's more your chin into your back arm and dipping your whole upper body into it this is what's going to put you on that smooth constant rotation that allows you to spot and control the spin ideally you'll be pulling into the second part of a dubac 10 just like you would a cab cork 5 and it should feel very similar when done right what really helps for training this is practicing",
        "timestamp": 508,
        "endTime": 529,
        "duration": 21
      },
      {
        "stepNumber": 21,
        "summary": "Get your chin to your back shoulder, tuck in tightly, and lean over with your upper body while keeping your core engaged in one fluent motion. This combined motion is key to the back double cork 1080.",
        "rawText": "getting your chin into your back shoulder and tucking in and over with your whole upper body keeping your whole core tight and engaged that's really crucial for this trick just snap it tighten up and lean over all in one motion because even though the DU back 10 is too separate motions to make one trick we're still trying to combine it into one fluent set of motions that goes",
        "timestamp": 531,
        "endTime": 551,
        "duration": 20
      },
      {
        "stepNumber": 22,
        "summary": "Visualize the entire Back Double Cork 1080 trick before attempting it, focusing on your windup, snap, spot, and pull. This mental preparation will make executing the trick on snow much smoother.",
        "rawText": "and lets us go and perform this trick in a smooth Safe Way another tool that's really useful for the duback 10 is visualization I've done hundreds of back tens I still go and and visualize it every time my windup my snap my spot my pull by getting comfortable with this Motion in your head you're going to be able to bring it into snow a lot easier",
        "timestamp": 554,
        "endTime": 575,
        "duration": 21
      },
      {
        "stepNumber": 23,
        "summary": "Practice and visualize a \"du back 10\" (likely a back double cork 1080) before attempting the full trick. This will help with the flips and the overall flow of the rotation.",
        "rawText": "because it's going to be a lot less sudden and surprising for these flips so before doing a du back 10 practice and visualizing it it's really going to help but du back 10 isn't a super technical trick and it's really forgiving for AIS and rotation because you have so much room to speed up and change the trick in the air but it's really important to not skip these fundamental steps St because",
        "timestamp": 577,
        "endTime": 598,
        "duration": 21
      },
      {
        "stepNumber": 24,
        "summary": "Focus on mastering the foundational tricks (Cab Cork, etc.) before attempting the Backside Double Cork 1080. Perfecting these prior steps will significantly increase your chances of landing the more complex trick.",
        "rawText": "if you go and mess up your takeoff or you don't have a proper cab cork Vibe it's going to make the trick really hard to land so take time build the prior steps because once you can do those steps perfectly the backside 1080 is going to come pretty naturally to you it's still a double and a legendary trick so there's a lot of work but by putting in these steps it's going to make it a lot more approachable and a",
        "timestamp": 600,
        "endTime": 620,
        "duration": 20
      },
      {
        "stepNumber": 25,
        "summary": "To land a Back Double Cork 1080, find a great jump and maintain a smooth takeoff with a straight edge and tall upper body. As you spin, grab around 270 degrees, tuck your head into your shoulder to spot the landing, and pull into your spin.",
        "rawText": "lot easier to break down recap find a great jump with amazing conditions get a smooth takeoff with a straight great Edge line and a tall upper body growing down over your tail grabbing around 270 tucking your head into your shoulder and spotting the knuckle pulling into your spin Landing stacked and riding away I'm Tavis from snowboard addiction and I",
        "timestamp": 622,
        "endTime": 644,
        "duration": 22
      }
    ]
  }
]