{
  "trickId": "backside-360",
  "trickName": "Backside 360",
  "aliases": [
    "bs 360",
    "back 360",
    "backside three sixty",
    "back one"
  ],
  "videoId": "wcz_QMCy2-s",
  "videoTitle": "How To Backside 360 On A Snowboard",
  "totalDuration": 927,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To set up for a backside 360, get into a \"stacked\" position: align your body over your legs with a straight back and powerful, engaged knees (don't let your knees bow in or out).",
      "rawText": "you [Music] the first place to start with any backside spin is with finding your stacked position being stacked is a term we use a lot in snowboarding and it's referring to this having the sight under your legs your body aligned a straight back and a powerful knee position not having your knees come in Bowie out",
      "timestamp": 28,
      "endTime": 49,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "To wind up for a backside 360, start with a straight back and slightly bent legs, opening your hips towards the takeoff. Keep your back knee straight and arms open while maintaining a strong, stacked posture.",
      "rawText": "in a very specific way for it to translate to snowboarding the basketball we're going to go over here starting with the windup the ideal backside windup has a straight back slight bending of the legs open hips towards the end of the takeoff while keeping your back knee straight letting your arms open up will keeping this straight stacked strong posture the better you",
      "timestamp": 72,
      "endTime": 92,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "Focus on training the fundamental \"wind up\" motion with a straight back, avoiding bending forward or leaning back, to increase your range of motion and the power available for your backside 360.",
      "rawText": "get at this motion the more you'll be able to increase the range of motion used increasing the power that you can use off the lip backside 360s don't take very much power they're not going need to go and make this motion very exaggerated but you want to train it and get the fundamentals of having the straight back and having the wind up without compromising bending forward or leaning back uh awesome tip that Pro",
      "timestamp": 94,
      "endTime": 114,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "To maintain a strong and stable base for your backside 360, focus on flexing your glutes during your wind-up. This will help keep your core tight and stacked, improving your control throughout the spin.",
      "rawText": "snowber Darcy sharp gave me is use your glutes for this it's really hard to break up a waist if you tighten your glutes so whenever you're doing your wind ups focus on flexing your glutes a little bit helping to keep your core tight and stacked in that strong position this is going to be the base for every backside spin so go and keep working on it and keep dialing in on and off the slopes next up is snap you're",
      "timestamp": 118,
      "endTime": 139,
      "duration": 21
    },
    {
      "stepNumber": 5,
      "summary": "Focus on keeping your spin on a level plane, avoiding throwing your body up or down. Time your rotation so you hit a neutral position as your board's nose reaches the end of the takeoff.",
      "rawText": "trying to go and keep your snap on a consistent plane of rotation making sure that you're not throwing down or up continuing your spot in a smooth constant line next is timing you want to be going and hitting a neutral position as your nose reaches the end of a takeoff the bigger your backside spins the more you'll then go and extend that",
      "timestamp": 141,
      "endTime": 162,
      "duration": 21
    },
    {
      "stepNumber": 6,
      "summary": "To keep your balance and see your landing, avoid looking over your shoulder. Instead, focus your spot elsewhere to maintain stability and prevent your body from over-rotating.",
      "rawText": "motion but for a back free you'll just be going and holding that position and popping off that last little bit another super important step for your backside spins is your spot it can feel really natural to spot looking over your shoulder but this will go and make you you extend your Coro throwing you off balance and losing your stability it also makes it so you don't see a knuckle",
      "timestamp": 164,
      "endTime": 184,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "When spinning a backside 360, spot your landing by looking under your back arm. This helps you control the rotation and land with your body stacked in a tight position.",
      "rawText": "as soon but by shifting your gaze to underneath your arm you're going to be able to beef your body stacked in a tight position SP the knuckle sooner allowing you should go and control the rotation and know what's going on sooner than an over the shoulder spot on any backside spin make sure your spot is underneath your back arm lastly is Landings you always want to be landing",
      "timestamp": 186,
      "endTime": 206,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "Practice the \"wind up, snap, spot, and landing\" key points of the Backside 360 on a trampoline to build the necessary muscle memory and technique before attempting it on snow. Focus on these points to improve your rotation control.",
      "rawText": "sure you have good controlled bounces before going and adding rotation after that try to hit the same four key points your wind up your snap your spot and your Landing by practicing these four points on trampoline you'll have a lot more success when bringing them back over to snow with B skills in place the next stage to improve this is",
      "timestamp": 229,
      "endTime": 249,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "After fully extending your body for the trick, focus on bringing your legs up towards your body to maintain control and power. Avoid cutting your extension short, as this will reduce your control.",
      "rawText": "bringing your leg to your body bringing your legs up is an important part of every trick on a snowboard you're aiming to start bringing your legs up after your full extension if you cut your extension short you'll lose control and power for right extension will bring your legs off right to you but too little or too much will disconnect your body making it so you have to use your",
      "timestamp": 251,
      "endTime": 271,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "When practicing your backside 360s, avoid grabbing your board too early, as it can hinder your leg extension. If you do grab, use a mute or method grab.",
      "rawText": "muscles instead of the momentum of a jump to bring your legs up I'd recommend not grabbing your snowboard when practicing your backside 360s because reaching to grab your snowboard early can make it so you don't do your full extension making it so it's harder to bring your legs up in the long run if you decide you need to grab your snowboard I recommend using the mute / wetle grab this is the best grab for practicing your backside Spin and will",
      "timestamp": 272,
      "endTime": 293,
      "duration": 21
    },
    {
      "stepNumber": 11,
      "summary": "As you approach the jump, setup carve on your heel edge. Then, transition to your toe edge as you pass the lip, maintaining a straight line off the takeoff.",
      "rawText": "be super useful once we move on to Backside 720s later on in the series with both skills in place it's time to start bringing this trick to the slopes starting with your setup carve a textbook setup carve as you approaching the jump on your Keel Edge transitioning to your tow Edge as you pass a spoon of the jump holding a straight line off the takeoff until your tail snaps off the",
      "timestamp": 295,
      "endTime": 315,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "To set up for your backside 360, maintain a stacked body position and ensure a straight takeoff to eliminate drifting and maintain control. Perfect your edge pressure and timing as you prepare to rotate.",
      "rawText": "end setup carvs are a super flexible motion but there is a few things you're trying to achieve with every setup car first a stacked body position second a straight takeoff third Edge pressure four timing your stacked body position is the base for all tricks a straight takeoff removes drifting giving you better control and less chance to hit",
      "timestamp": 318,
      "endTime": 338,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "To avoid breaking at the waist and losing your stack, focus on maintaining your body position and don't get on your toe edge too early during your setup carve. This ensures you maintain power and proper form for the 360.",
      "rawText": "the knuckle Edge pressure lets you not catch an edge timing lets you leave off your tail getting maximum power the main mistake you can make on your setup carb is breaking at the waist breaking at the waist refers to losing your stack position and crumpling at the hips this can be caused by a few thing most commonly getting on your toe Edge much too soon the longer you hold your tow",
      "timestamp": 340,
      "endTime": 360,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "Find a mellow slope (like a cat track or green run) and practice your setup carve. Maintaining a strong, tall body position will help you avoid leaning forward and breaking at the waist when you eventually hit the jump.",
      "rawText": "Edge the harder it will be to hold your strong tall body position making it more likely you start to lean forward resulting in Breaking at the waist setup cars are one of the things you really want to get in place before going off the Jump a great way to practice this is just on the slope find a super mellow pitch slope VI a cat track or a green run and practice your setup car trying",
      "timestamp": 362,
      "endTime": 383,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "To learn a backside 360, focus on these four key points: stacked body position, straight takeoff, edge pressure, and timing. Start by traversing across the slope on your toe edge to get a feel for the rotation.",
      "rawText": "to hit the four key points your stacked body position a straight takeoff Edge pressure and timing both are the four main points you're trying to improve when doing this training exercise with those in place it's time to get spinning the first backside 360 you can do is just traversing across the slope to do this get on your tow Edge going along the",
      "timestamp": 386,
      "endTime": 406,
      "duration": 20
    },
    {
      "stepNumber": 16,
      "summary": "When popping your backside 360, maintain a stacked position throughout the rotation. Aim to land smoothly and continue traversing across the slope without carving back up the hill.",
      "rawText": "slope then pop a 360 you're trying to hold your stack position and hit before key Point wind up snap spot Landing you want to get these 360s to a point where you can land stacked and continue with Traverse along the slope when doing this Traverse it's important to not be putting too much pressure into your Edge causing you to carve back up the hill",
      "timestamp": 407,
      "endTime": 428,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "Practice maintaining consistent edge pressure on a downward slope while on your toe edge to get a feel for the balance needed before attempting the backside 360. Focus on holding the edge without turning upwards.",
      "rawText": "you want slight Edge pressure that lets you grip the snow but doesn't start turning you upwards if you're struggling with maintaining that constant Edge pressure and you're digging in and going up the hill practice holding your Edge pressure just on a downward slope find a run where you feel comfortable holding a straight line and this practice getting on your tow edge trying to hold that little bit of edge pressure but without",
      "timestamp": 430,
      "endTime": 451,
      "duration": 21
    },
    {
      "stepNumber": 18,
      "summary": "Focus on backside 360s *downhill* to build edge pressure, wind-up, and snap in an awkward position. This will greatly improve your ability to do backside 360s off a jump.",
      "rawText": "digging in and starting to turn the next stage is doing your backside 360s going downhill this is actually way harder than doing a backside 360 off a jump but it will teach you how to maintain your Edge pressure well generating your wind up and snap in an uncomfortable position what going to pay massive dividends when you go to take your backside 360s off a park jump you're trying to hit with five key points setup wind up snap spot",
      "timestamp": 453,
      "endTime": 474,
      "duration": 21
    },
    {
      "stepNumber": 19,
      "summary": "To increase your snap and torque for a backside 360, focus on letting your tail be the last part of your board to touch the snow upon landing. Practice these steps gradually throughout the season.",
      "rawText": "Landing you want your tail to be the last part of your board making contact on the snow actively making sure that you're leaving off your tail will drastically increase the amount of snap and torque if you can get off your snowboard these steps will take a little bit of time to master so i' recommend just spreading them out through with season of riding instead of just going up on the mountain and spending all day grinding it just do a few free 60s when",
      "timestamp": 478,
      "endTime": 498,
      "duration": 20
    },
    {
      "stepNumber": 20,
      "summary": "If you're feeling nervous about a backside spin, revisit the fundamental skills by practicing backside 360s. Use this to dial in your form and build confidence.",
      "rawText": "getting off a chair heading to the park just adding them in where you can these are the fundamental skills you'll be using on every backside spin even now I like to use these backside 360s when I'm feeling nervous about doing like a dum back p a back seven you name it if I'm feeling nervous about my backside form I go back to these steps and dial them in because I'm confident if I can perform",
      "timestamp": 501,
      "endTime": 521,
      "duration": 20
    },
    {
      "stepNumber": 21,
      "summary": "Take your backside 360 to a small jump, like a rail takeoff. When practicing off a rail, be mindful of others and avoid taking off at spots primarily used for rails.",
      "rawText": "well as well I'll be able to translate that to off the Jump now that we have all those in place it's time to take your backside 360 to a jump the ideal jump is the smallest jump you can find rail takeoffs work great for this but if you're utilizing a rail takeoff in your training make sure that you're not getting in anyone's way ra rail takeoffs are primarily used for ra rails so do not be taking off at a spot that would",
      "timestamp": 522,
      "endTime": 544,
      "duration": 22
    },
    {
      "stepNumber": 22,
      "summary": "To land a backside 360 smoothly, focus on spotting over your shoulder to maintain a constant rotation, and aim to land fully rotated with your upper and lower body stacked on the balls of your feet. This completes the spin.",
      "rawText": "spin off it you're trying to avoid drifting breaking at the waist and spotting over your shoulder with the end goal being a constant smooth rotation Landing you in your stacked position that means Landing in on the balls of your feet completely rotated with your lower and upper body we call this finishing the trip and you'll want to be able to just finish your backside 360 before moving on to bigger features or",
      "timestamp": 568,
      "endTime": 590,
      "duration": 22
    },
    {
      "stepNumber": 23,
      "summary": "To avoid landing on your heels and under-rotating a backside 360, maintain your balance throughout the spin. Be confident with your approach speed and don't break at the waist during takeoff.",
      "rawText": "indication that something went slightly wrong at some point during the rotation a few things that commonly cause heel Edge Landings are breaking at the waste off a takeoff this sets you unbalanced and makes your spins harder to control not being confident with the speed of the the jump this can lead to under rotating and whenever you under rotate a back threee 7 10 Etc you need to land on your heels to not catch your tow Edge",
      "timestamp": 614,
      "endTime": 636,
      "duration": 22
    },
    {
      "stepNumber": 24,
      "summary": "To land a backside 360, make sure your takeoff is solid and that you have a strong, stacked position. Find a jump that's the right size for you, ideally between 5 and 10 feet.",
      "rawText": "these mistakes all have the trend of being dictated by your takeoff and that's why it's so important to build up your fundamentals and get a strong stack position off your takeoff and with your snaps after you have all view sets in place it's time to find a proper size jump I'd recommend anywhere from 5 ft to 10 ft but it really depends on what jumps you have at your local Resort one of the most important things you're",
      "timestamp": 639,
      "endTime": 660,
      "duration": 21
    },
    {
      "stepNumber": 25,
      "summary": "Look for a jump with a moderate amount of \"kick\" at the lip – enough to help you rotate, but not so much that it throws your body off balance. Avoid jumps with excessive kick to prevent spinning out and losing control during your backside 360.",
      "rawText": "looking for is making sure the jump doesn't have too much kick kick on a jump refers to that last bit of um at the lip a little bit of kick is nice because it'll help row your legs up to you and give you more power of your rotation but too much kick will want to break you out the waist causing you to go and spin out and cause these mistakes that we've been going over that's why a kicky jump is one of the number one",
      "timestamp": 661,
      "endTime": 682,
      "duration": 21
    },
    {
      "stepNumber": 26,
      "summary": "Get comfortable with straight airs and the jump itself before attempting a backside 360. This helps avoid hitting the knuckle or going too deep, setting you up for a successful spin.",
      "rawText": "enemies of learning backside spins the two biggest risks you're taking when hitting a jump are hitting the knuckle and going too deep that's why it's super crucial to lock in your straight airs and get really comfortable with a jump you're hitting before trying to spin it after getting a feel for the jump all you need to do is apply the skills we've been working on this video to the jump itself the bigger the jump the more you",
      "timestamp": 683,
      "endTime": 704,
      "duration": 21
    },
    {
      "stepNumber": 27,
      "summary": "As you're transitioning from your heel edge to toe edge at the bottom of the jump, keep your eyes on the takeoff and finish your snap as your board leaves the lip. This will help you control the rotation in the air.",
      "rawText": "will need to slow down your motion and snap because you'll have more air time you need to control but other than that the fundamental principles are exactly the same for your setup carve you want to switch from your heel Edge to your toe Edge at the bottom of the jump holding your eyes on the takeoff as your board starts to leave a lip your upper body should be close to a stacked position finishing your snap as your",
      "timestamp": 706,
      "endTime": 727,
      "duration": 21
    },
    {
      "stepNumber": 28,
      "summary": "To learn a backside 360, focus on a strong takeoff and a powerful snap from the board, as these are the foundation for all backside spins. Practice perfecting the backside 360, as it will improve all other backside spins.",
      "rawText": "tail leaves the take off hopefully resulting in your first proper backside 360 backside 360s are the base for every single backside spin so it's really important to take the time and dial them in making sure you got your strong takeoff your strong snap and just overall the complete package because if you can lock in a perfect backside fre it's going to make every single backside",
      "timestamp": 728,
      "endTime": 749,
      "duration": 21
    },
    {
      "stepNumber": 29,
      "summary": "To improve your backside 360, focus on a straight takeoff, maintaining a stacked body position as you leave the lip, and landing in a stacked position. Practicing this will refine your form for bigger spins.",
      "rawText": "spin so much easier in the future this is the trick I go and practice the most and use to refine my form and I highly suggest you do the same if you have Ambitions of doing 540s and Beyond what to look for you want you have a straight line off the takeoff a stacked body position leaving the lip at under theh shoulder spot finish with a trick with your stacked landing position you might",
      "timestamp": 751,
      "endTime": 772,
      "duration": 21
    },
    {
      "stepNumber": 30,
      "summary": "Focus on solidifying your backside fundamentals: ensure good takeoffs, controlled airtime, and clean landings in a stacked position before attempting a backside 360.",
      "rawText": "but confident is my vibe what I like to do is break it down are my takeoffs good am I feeling in controlling the air am I Landing clean and in my stacked position once you get all the fundamentals be covering this video in place and have a strong backside 360 it's going to be time to start pushing yourself and expanding because with the backside 360 your backside fundamentals will be",
      "timestamp": 886,
      "endTime": 907,
      "duration": 21
    }
  ]
}