{
  "trickId": "backside-720",
  "trickName": "Backside 720",
  "aliases": [
    "bs 720",
    "back 720",
    "backside seven-twenty",
    "backside two twenty"
  ],
  "videoId": "C2EJwuxG4Fs",
  "videoTitle": "How To Perfect Your Backside 720",
  "totalDuration": 701,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To learn a Backside 720, focus on your takeoff and windup. You'll need to tweak your takeoff to generate more power while keeping a tight core.",
      "rawText": "takes a lot more rotational Force this is mainly because you can't finish the spin with counter rotation like you can a back five or a back one so in order to go and get back sevens we're going need to start with tweaking our takeoffs in order to generate more power off a jump while keeping a more consistent tight core and the first step to train for this is your windup there are five key points you're trying to hit with every",
      "timestamp": 25,
      "endTime": 47,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "Maintain an upright body position with a straight back, avoiding any arching. Bend your knees slightly to shift your weight towards the balls of your feet.",
      "rawText": "single windup for back seven one an upright body position with no Bend in your back this means your back is straight and not arcing forwards or backwards two a slight Bend in your legs you want enough Bend in your knees that your weight is shifted to the balls of your feet if your knees start going over your toes or you start shifting backwards you know you have too much or too little Bend three hips open towards",
      "timestamp": 48,
      "endTime": 70,
      "duration": 22
    },
    {
      "stepNumber": 3,
      "summary": "To generate more power for your Backside 720 wind up, open your hips on the takeoff. Actively engage your back knee, keeping it pointed toward your middle toe, to maintain a strong position.",
      "rawText": "a takeoff opening your hips increases your range of motion on your wind up this lets you get more power out of your Snap Four a strong back knee position when you open your hips your back knee will want you follow and start twisting forward which will compromise your strong position make sure to actively engage your back knee keeping it pointed at your middle toe five arms away from",
      "timestamp": 72,
      "endTime": 93,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "To achieve the perfect wind-up for a Backside 720, keep your arms away from your body during the wind-up phase to maximize your mobility and rotational power. This will help you rotate on the correct axis.",
      "rawText": "the body you want to make sure no part of your arms is touching your body on wind up this will keep you more mobile giving your body more room to generate power hitting all five of these points will put you into a perfect wind up position what is needed in order to rotate on the correct axis for a backside 720 when you try to snap a backside 720 leaning forward your rotation will be aimed upwards making",
      "timestamp": 96,
      "endTime": 117,
      "duration": 21
    },
    {
      "stepNumber": 5,
      "summary": "Set your rotation over your back foot and maintain a tall body position, extending your full body with your chest pointed towards your tail. This body position helps establish the correct axis for the backside 720.",
      "rawText": "your chest lift Towards the Sky what you want to be doing is having your rotation set over your back foot with a tall body what this does is it makes it so your chest is pointed down towards your tail with your full body extended with your point of balance being set over your back foot this is the body position that will help get you the proper axis of",
      "timestamp": 119,
      "endTime": 139,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "To maximize your backside 720, fully extend your chest down towards the tail of the board. This body position helps with rotation, tail snapping, and spotting the landing.",
      "rawText": "rotation as well as letting you maximize the power and spot The Landing sooner this fully extended chest down towards the tailal position is exactly what you'll be aiming for on every backside 720 this is because it does three crucial things one it sets up a proper AIS of rotation two it helps you snap off your tail three it puts your head in a position to spot the knuckle off",
      "timestamp": 141,
      "endTime": 162,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "As your tail leaves the jump for a backside 720, rotate your upper body 180 degrees *before* your board leaves the jump, ensuring your board takes off in a straight line for more power and snap.  Practice straight takeoffs on back threes and fives first.",
      "rawText": "takeoff as your tail leaves the takeoff on a back seven your upper body should already be rotated around 180 as your board stays completely straight it is a very important to have your board leaving off in a straight line because it'll give you more snap and Power if you aren't comfortable with this straight takeoff on back threes and back fives I'd recommend going back and practicing those until you have that",
      "timestamp": 164,
      "endTime": 185,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "Maintain a strong, straight takeoff for your backside 720 to minimize drifting and maximize in-air control. Landing on a flat base is key; drifting during the spin requires counterbalancing, potentially leading to errors.",
      "rawText": "strong straight takeoff because it's going to be absolutely crucial when trying a back seven this will let you drift less giving you more control in the air and letting you spot the knuckles sooner it's also going to be crucial for finishing the trick Landing with a flat base the more you drift a backside spin the more you're going into to counterbalance by digging in your heels on the landing this is because you need to go and stop yourself from your sideways trajectory where if you're",
      "timestamp": 187,
      "endTime": 208,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "Focus on your takeoff on a smaller jump (15-25ft) with minimal kick to make landing your backside 720 easier. This will give you more control and less chance of last-minute adjustments.",
      "rawText": "going straight off a takeoff you'll come into a jump nice allowing you to land with a proper two-footed Landing the ideal jump is around 15 to 25 ft the most important aspect on a backside 720 is your takeoff and on a smaller jump a good takeoff is easier to manage I'd recommend looking for a jump that doesn't have too much kick because you don't want anything last minute messing",
      "timestamp": 210,
      "endTime": 231,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "Practice your backside 720s on smaller jumps to build a solid foundation. This forces you to execute the trick correctly, making it easier to land on larger jumps later.",
      "rawText": "up your backside form the other benefit to practicing your backside 720s on smaller jumps is it trains your foundation and makes it so you have to do the backside 720 in a proper way where if you go and do your sevens on a bigger jump you have more room to cheat making it so you don't need to get the trick as dialed in but if you're able to go and get a proper backside seven on a 15t jump it's going to be very easy to",
      "timestamp": 233,
      "endTime": 253,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "Let your upper body rotate past your tail more than you would for a backside 5. The key is to lead the rotation with your upper body.",
      "rawText": "translate those skills over to a larger jump in the future and this is why we recommend going and building up these tricks on the smaller features before bringing them to larger jumps you'll be having the same setup carve as for every backside spin the biggest difference here is you're going to be letting your upper body rotate past your tail more than you would for a back five so the challenge will be coming from letting your upper body lead that rotation while",
      "timestamp": 256,
      "endTime": 276,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "Focus on your spot: you can either maintain a constant visual spot or use a \"double spot\" where you spot one 360 and then quickly whip your head around for the next 360 during the rotation.",
      "rawText": "keeping your board completely straight off the takeoff that's all the steps we need to get into the air so now let's cover what to do once we're there starting with your spot there are two kinds of spots you can do on a back seven the constant spot and a double spot a double spot is when you rotate a 360 spot the knuckle and then whip your head around for the next 360 SE this also goes and disconnects your upper and",
      "timestamp": 278,
      "endTime": 300,
      "duration": 22
    },
    {
      "stepNumber": 13,
      "summary": "To smoothly spin a Backside 720, maintain a constant spot by focusing on a consistent axis rotation, just like you would for a 540. This allows you to spot the landing and maintain a steady rotation speed.",
      "rawText": "lower body making it harder to have a smooth constant rotation that's why instead of doing the double spot we want to focus on doing the constant spot just like on 540s a constant spot will let you spot the knuckle at 270 and rotate around without losing sight of the landing allowing you to have a constant speed of rotation a constant spot is achieved by two things axis rotation and",
      "timestamp": 302,
      "endTime": 322,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "To set up for a backside 720, maintain an upright takeoff and snap over your back foot. This will naturally position your eyeline under your back arm, allowing you to spot the landing early, starting at the 270-degree mark.",
      "rawText": "head position both of these are achieved by a proper upright takeoff that lets you snap over your back foot when you snap over your back foot your eyeline will be set under your back arm putting you in the same under the back arm spot position used on every backside spin this lets you spot the knuckle as early as 270 setting you up for the rest of your back seven your axis rotation can",
      "timestamp": 325,
      "endTime": 346,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Focus on a downward axis of rotation for your backside 720, throwing your chest over your back foot in a downward motion. This differs from the upward rotation used in frontside spins.",
      "rawText": "vary vastly from Flat court and FP even though we are trying to not Corker spins here it's important to be set up on the proper axis rotation there's two axises rotation there's upwards over your shoulder what you use on front side rotations like a front cork five and there's downwards where you're going in throwing tall with a chest over your back foot in a downwards motion and this",
      "timestamp": 348,
      "endTime": 369,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "To avoid an improper spin axis on your Backside 720, don't break at the waist. Instead, maintain a stable core to keep your momentum aligned for the rotation.",
      "rawText": "is what we use on backside spins this rotation is very noticeable when someone's doing a big cork but it's very subtle when someone's keeping for spins flatter the main thing that causes the improper over shoulder axis is breaking at the waist if you break at the waist and try to snap your momentum will be thrown Towards the Sky making you lean into your front foot resulting in the",
      "timestamp": 372,
      "endTime": 392,
      "duration": 20
    },
    {
      "stepNumber": 17,
      "summary": "To cork a backside 720, maintain a tall, stacked body position and initiate your rotation over your back foot, ensuring your weight is shifted appropriately. Avoid breaking at the waist and throwing your rotation downwards.",
      "rawText": "over the shoulder wild axis but by staying tall your throw will put your weight over your back foot letting you keep your spot under your arm and this is how you actually cork a backside spin the more your rotation is set over your back foot the more quirky your rotation will be but we never want to be breaking up the waist and throwing downwards it always should be a tall stack position",
      "timestamp": 393,
      "endTime": 413,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "To master the backside 720, focus on a good takeoff and get tight into a ball. Use a \"mute\" grab (formerly called \"wetle\") to control the torque and accelerate your spin.",
      "rawText": "improve your riding the last part of of the backside 720 is the grab because you're not able to go and speed up your rotation like you can on a back five it's important to get a good takeoff and get tight into a ball letting you go and control the torque and speed up your spins the best grab to do this wh is mute now known as the wetle grab a wetle grab gives two massive perks one it lets",
      "timestamp": 507,
      "endTime": 529,
      "duration": 22
    },
    {
      "stepNumber": 19,
      "summary": "Keep your front shoulder pulled into the spin by using your back arm for stabilization. This helps maintain a smooth rotation and correct posture for landing the Backside 720.",
      "rawText": "you use your back arm to stabilize and control the speed of your spin two it keeps your front shoulder pulled into your spin which helps keep you rotating smoothly through the full rotation and puts you in that correct posture to finish with Spin and land stacked for these reasons we highly recommend every back Seven's learned with the wetle grab because you're letting your upper body lead for rotation on a back seven it",
      "timestamp": 532,
      "endTime": 553,
      "duration": 21
    },
    {
      "stepNumber": 20,
      "summary": "Grab the board between the 270 and 330-degree point of your rotation during a backside 720. This timing allows your upper and lower body to stay aligned and maximize rotation speed.",
      "rawText": "will take time for your lower body to catch up to your upper body if you reach for a grab too soon it will cut this process short removing the follow through what will drastically decrease your rotation speed you want to be grabbing a back side 720 around 270 to 330 this will give you adequate time to let your lower body and upper body catch up to each other it will also make it so",
      "timestamp": 555,
      "endTime": 576,
      "duration": 21
    },
    {
      "stepNumber": 21,
      "summary": "Visualize the entire backside 720 before attempting it. Close your eyes and imagine yourself successfully spotting the knuckle, grabbing the board, and smoothly rotating.",
      "rawText": "you're hitting your grab around the same time you're spotting the knuckle making it one fluent motion of spotting well grabbing allowing you to pull into a spin resulting in a much smoother rotation because there's so many little components going on of backside 720 we utilize a tool called visualization this means we're going to go and close our eyes and imagine our doing the trick in the first person and",
      "timestamp": 578,
      "endTime": 599,
      "duration": 21
    },
    {
      "stepNumber": 22,
      "summary": "When attempting a backside 720, focus on two things: your takeoff and either your spot position or the timing of your grab. This helps build the muscle memory needed to perform the trick.",
      "rawText": "the third person this is a technique that all highle Riders use and what it does is it builds the muscle Pathways in your mind allowing you to go and subconsciously perform a lot of these tasks I have a Golden Rule and it's that you can't focus on more than two things when doing a trick on your snowboard the first thing you need to focus on is your takeoff and the second thing can either be your spot position your grab timing",
      "timestamp": 601,
      "endTime": 622,
      "duration": 21
    },
    {
      "stepNumber": 23,
      "summary": "Before attempting a backside 720, ensure your backside 360s are consistently clean and comfortable. This solidifies your foundation and allows you to focus on the specific adjustments needed for the larger spin.",
      "rawText": "can be one of those things but you need to go and get every other step subconscious so you can go and narrow it down and focus in on one or two specific topics for a spin this is just great practice and something to do when you're trying these bigger spins before trying to back seven make sure you're very comfortable in the jump you don't want to have any confusion if you're going to be drifting not any sweet spot so go and focus in get a few good backside 360s",
      "timestamp": 624,
      "endTime": 646,
      "duration": 22
    },
    {
      "stepNumber": 24,
      "summary": "To land a backside 720, focus on a straight takeoff, maintain a strong, tall body position throughout the rotation, and keep your eyes spotting your landing. Grab your board between 2:30 and 3:30 in the rotation, and land stacked with your body aligned.",
      "rawText": "and after that link it together and do the seven the five main things that make a back seven work are a straight takeoff with as little drift as possible a strong tall body position during every part of your takeoff and snap a constant spot through with full rotation grabbing your board around 230 to 330 Landing stacked with your body aligned and your",
      "timestamp": 649,
      "endTime": 670,
      "duration": 21
    },
    {
      "stepNumber": 25,
      "summary": "To learn a Backside 720, ensure you have strong fundamentals by consistently landing back fives. This means you need to be comfortable and confident with your backside spins.",
      "rawText": "weight over the balls of your feet once you can hit those Five Points consistently you'll know that your backside foundations are strong and you're ready to move on to bigger spins or bigger jumps a backside 720 is really combining every skill you know on your backside spins so make sure that you have strong fundamentals of your back frees your back fives and combining those with the steps you learned in this",
      "timestamp": 672,
      "endTime": 693,
      "duration": 21
    }
  ]
}