{
  "trickId": "backside-180",
  "trickName": "Backside 180",
  "aliases": [
    "bs 180",
    "back 180",
    "backside one eighty"
  ],
  "videoId": "ln03njzMzuk",
  "videoTitle": "Master The Backside 180 On Your Snowboard",
  "totalDuration": 464,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To learn a Backside 180, focus on two key elements: the pop and the spot. Master these to execute the trick successfully.",
      "rawText": "oh my God P white out hey guys Tavis here and in this video I'm going to teach you how to Backside [Music] [Applause] 180 backside 180s have two main components the pop and the spot we're",
      "timestamp": 6,
      "endTime": 28,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "Focus on a forward spot on the snow and rotate around it while maintaining contact with the ground. Keep your eyes locked on that spot throughout the rotation.",
      "rawText": "going to be starting with training the spot so we can go and dial it in and really Crush these back ones backside 180s use something called the constant spot the best way to train this is by picking a forward point in the snow and rotating around that point maintaining contact with the ground and keeping your eyes locked on that point as you pass it this will result in you finishing in",
      "timestamp": 31,
      "endTime": 51,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "When practicing a Backside 180, focus on tracking the knuckle and rotating around it as you approach the landing. This helps you land with your back to the landing, which is crucial for this trick.",
      "rawText": "that blind landing position blind Landings are referring to when you land looking back uphill and it's used on back ones back FS front freeze any trick that you're finishing your trick with your back to The Landing you use the blind Landing while you're doing the spawning trick you're going to be training the ability to track the knuckle and rotate around it in order to do this effectively make sure that as",
      "timestamp": 53,
      "endTime": 75,
      "duration": 22
    },
    {
      "stepNumber": 4,
      "summary": "To land a backside 180, maintain pressure on your toe edge throughout the rotation. This will help prevent catching your heels and ensure a clean spin.",
      "rawText": "you pass the knuckle your head tracks uphill an important thing to note for this is you need to keep the pressure on your toe Edge if you have your pressure on your heel Edge you'll be at risk of catching heels so whenever you're rotating about last bit for a blind rotation make sure you keep the pressure onto your toe Edge slightly you don't want it to be leaning over into your spot instead make sure you're",
      "timestamp": 77,
      "endTime": 97,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "Keep your body stacked (board, upper and lower body aligned, slight bend in legs), tilt your chin down and pull this stacked position as you rotate.",
      "rawText": "maintaining your stacked position a stacked position refers to having your board in line with your upper and lower body with a slight Bend in your legs this is a base position you'll be using for every trick on a snowboard by tilting your chin down and pulling the stack position as you rotate you'll be accurately emulating what it's like to actually do the back one off and jump a key Point here is making sure you're",
      "timestamp": 99,
      "endTime": 121,
      "duration": 22
    },
    {
      "stepNumber": 6,
      "summary": "Hold your blind landing position until your rotation stops completely. While holding the landing, use your toe edge to rotate back uphill and stop your rotation.",
      "rawText": "holding your blind Landing if you start to look up from your blind Landing too soon it will result in you scrub to your heels washing out continuing rotation what you want to do is make sure you hold your blind Landing until your rotation is fully stopped while you do this you're taking your toe Edge these two things of rotated back uphill with your upper body and digging your tow",
      "timestamp": 122,
      "endTime": 143,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "Hold the landing of your backside 180 a bit longer than you think you need to. This will help you land cleanly and is important for building good habits for bigger spins.",
      "rawText": "Edge will let you dispers your rotational power allowing you to right away cleanly without washing out it's important to really build the habit of holding that blind Landing a little bit longer than you think because it's going to be extra crucial once you start moving on to bigger spins your goal on a backside 180 is to use the spot trick and apply it to the knuckle making it so",
      "timestamp": 145,
      "endTime": 165,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "As you approach the landing, pop up, spot the knuckle, and smoothly rotate your body around, keeping your eyes on the knuckle. This will help you land with your back to the direction you came from, ready to hold your edge and ride away.",
      "rawText": "you pop up see the knuckle as soon as possible and rotate your rotation smoothly around keeping your eyes locked on the knuckle as you pass it this will result in you looking uphill back up the knuckle as you hit the Landing then you just hold the blind Landing dig in your tow Edge and ride away practice this step on snow until you feel comfortable withing motion after that it's time to",
      "timestamp": 167,
      "endTime": 187,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "Ride a side hit to practice your backside 180s. The side hit will help you maintain your toe edge, require less rotation, and let you focus on your pop.",
      "rawText": "take your backside 180 to a side hit side hits make backside 180s easier to do because hitting them you naturally hold your toe Edge going all the way up it making it so you don't need to worry about a setup C they also make it so you only need to rotate around 90 letting you focus more on your pop and more on your spot you don't need to generate much rotation for a backside 180",
      "timestamp": 190,
      "endTime": 210,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "To land a backside 180, pop up lightly off the side hit while slightly closing your shoulder on takeoff. Focus on your spot to initiate the rotation with minimal extra power.",
      "rawText": "especially off the side hit so focus on getting a good pop up lightly closing your shoulder off the takeoff and focusing on your spot a good popup with a good spot will let you go and rotating backside 180 without adding much power once you have your backside 180s on side hits locked in it's time to bring them to a park jump there's two things you're",
      "timestamp": 212,
      "endTime": 232,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "To land a backside 180 on a jump, approach on your heel edge and start swapping to your toe edge at the bottom of the takeoff. Finish the rotation as your tail leaves the jump, looking toward where you'll land.",
      "rawText": "going to need to change for a park jump first of all you need to add slightly more rotation going from 90 to 180 next you need to add something called a setup carb a textbook setup carb has you approaching on your heel Edge starting to swap to the toe edge of your snowboard at the bottom of the takeoff finishing your throw as your tail leaves the takeoff looking towards the end of a",
      "timestamp": 234,
      "endTime": 254,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "Maintain your stacked position and ride off the jump in a straight line. As you leave the jump, start looking away from the takeoff to initiate the spin.",
      "rawText": "takeoff serves two purposes keeping your carve straight and letting you time your snap you want your aim to start looking away from the takeoff as your board starts to leave the lift of a jump setup cars are not very important on backside 180s so it become covering them more in depth in our backside 360 tutorial what is important is making sure you're maintaining your stack position and riding off a jump in a straight line a",
      "timestamp": 256,
      "endTime": 276,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "Focus on a straight-line takeoff to minimize drift. Use counter-rotation to initiate and control the backside 180, and prioritize a good pop off the takeoff.",
      "rawText": "stack position with a straight line up for takeoff will eliminate a lot of drift allowing you to pop up track the knuckle and maintain a more constant rotation on backside 180 you can actually rotate it completely with counter rotation this is why you don't need to worry about snapping too hard and instead focus on getting a good pop off a takeoff having your",
      "timestamp": 278,
      "endTime": 298,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "To get a good pop for your backside 180, focus your eyes and upper body on the direction of rotation while letting your legs follow. Make sure your tail of the board makes full contact with the lip of the jump until the very end for a clean pop.",
      "rawText": "eyes and upper body leave rotation because you can always have your legs play catchup afterwards the best way to achieve a good takeoff is through a proper pop a proper pot as you leaving off and jump making sure your Tail's making contact with a lip until it snaps off the end this fully utilizes your snowboard allowing you to get a clean pop up will help you match for Arc of a",
      "timestamp": 300,
      "endTime": 321,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Match your jump's arc to your rotation for a smoother backside 180. This helps you focus on the spin and minimizes adjustments needed for landing.",
      "rawText": "jump when you match the Arc of a jump you'll be able to focus more of a rotation because you won't need make adjustments to try line up your body with the landing this is one of the most important steps of getting a smooth clean backside 180 if you want more help getting a clean paw we made a great video earlier in this series so go back and watch it and understand those fundamentals because it's really going",
      "timestamp": 324,
      "endTime": 344,
      "duration": 20
    },
    {
      "stepNumber": 16,
      "summary": "To land a backside 180, avoid throwing your shoulders too aggressively; instead, focus on a good pop. Also, maintain a stacked position and avoid breaking at the waist to maintain control.",
      "rawText": "to be a massive game changer for your back ones and every trick to come there are three main mistakes made on backside 180s first is throwing too hard you don't need that much rotation on a backside 180 so focus on getting a good pop second is breaking at the waist when you break at the waist you won't be able to hold your stack position not letting you fully utilize your board as well as",
      "timestamp": 345,
      "endTime": 366,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "To land a backside 180, ensure a clean pop off the takeoff, and don't look up before completing your rotation. Avoid slipping to your heels by holding your landing.",
      "rawText": "making it so you can't fully push through the takeoff getting a clean pop and lastly is not holding the blind Landing if you go and look up from a backside 180 without having your rotation fully killed you're going to slip to your heels resulting in a not make those are the three main mistakes that you need to watch out for on any backside 180 try to hit the five key",
      "timestamp": 368,
      "endTime": 389,
      "duration": 21
    },
    {
      "stepNumber": 18,
      "summary": "Focus on these key points for a Backside 180: Use slight toe pressure for takeoff, close your front shoulder slightly, rotate smoothly while spotting your landing, and land on your switch toe edge.",
      "rawText": "points a takeoff with slight toe pressure a slightly closed off front shoulder a smooth rotation as you perform the spotting trick a switch toe Edge Landing then hold the blind Landing until your rotation is completely stopped and ride away there's so many Possible little things that could be messing up your backside 180 that we can't cover in this video that's why we made an addiction plus addiction plus is",
      "timestamp": 391,
      "endTime": 412,
      "duration": 21
    }
  ]
}