{
  "trickId": "backside-900",
  "trickName": "Backside 900",
  "aliases": [
    "bs 900",
    "back 900",
    "backside nine",
    "bs nine"
  ],
  "videoId": "CdshWEEKjXc",
  "videoTitle": "How To Backside 900 Like A Pro",
  "totalDuration": 461,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "Focus on spotting the knuckle with your eyes and lead the rotation with your upper body, then finish the rotation with your legs. This will be a key motion to master.",
      "rawText": "principles for this is because we're going to be using the spot from the back five and a take off of a back seven it's really crucial that you have your back thighs with that constant spot so you can lock your eyes on the knuckle and lead the rotation of your upper body and rotate through finishing the rotation with your legs because this is going to be a really crucial motion for moving onto the back nine and then the next step is you want to make sure you have",
      "timestamp": 26,
      "endTime": 48,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "If you can confidently land a Backside 720 on jumps of 10-15 feet, you have the necessary power and control to start practicing Backside 900s. Focus on maintaining your current technique and control, as no additional power is needed.",
      "rawText": "your back sevens super solid on 10 to 15t jumps this means you're going up and spinning your back seven and finishing rotation Landing stacked if you can go and do a back seven on that size of a jump and land stacked in control you'll know that you have enough power to start working the back nine because for a back n we don't need to add any more power to",
      "timestamp": 49,
      "endTime": 69,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "Let your upper body lead the rotation from the start of your backside 900. This will allow you to use counter-rotation as you finish the trick.",
      "rawText": "rotation than a back seven this is because we can finish it with counter rotation just like the back five so it's important to go get that strong takeoff good snap good spot and let your upper body lead the rotation giving you the ability to use counter rotation if you need let's talk a little bit about what you need to do to get your back back seven into a back nine when you start coming around for a back nine your",
      "timestamp": 71,
      "endTime": 92,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "To land a Backside 900, initiate the rotation with your upper body leading the spin. This proactive setup will help you match the landing of the jump.",
      "rawText": "access will be slightly different than on a back seven this is because you're letting your upper body lead for the rotation and you're preemptively setting yourself up to match the landing of the jump so the biggest difference of the back nine to a back seven is with slight access if you do a back seven on a back n axis you're going to see the rider coming in tail heavy because that would go and set them up through the perfect twft landing on the back nine so that's",
      "timestamp": 94,
      "endTime": 114,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "Make sure you land in the sweet spot to stomp your backside 900.",
      "rawText": "why it's really important to let your upper body leave the rotation of Back N pulling into it setting you up to go and get into that Landing with that 2T stop because back NES have a lot of rotational Force so we're going need to go and control that and slow it down there's three things that can really help you stomp a backside 900 first thing you can do to help you stomp a back nine is make sure you're Landing in The Sweet Spot Landing in The Sweet Spot",
      "timestamp": 117,
      "endTime": 137,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "Before attempting a Backside 900, master Backside 7s, focusing on landing in the sweet spot. This will help you maintain consistent rotational speed and stick the landing.",
      "rawText": "will make it so you get less impact hitting the landing allowing you to digging your Edge and right away clean so before trying a 900 make sure you bet you did a couple back sevens where you landed sweet spot because it's going to really help an ideal Back N has you setting the spin and continuing that same speed of rotation until you hit the landing but I'm going to show you two ways that you can go in cheapest",
      "timestamp": 139,
      "endTime": 159,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "Use counter-rotation for the last 180 degrees of the spin. This speeds up your spin while also slowing down your overall rotation, making the landing more manageable.",
      "rawText": "rotation and make it easier to control the first way you can make it easier to land a back nine is by using counter rotation for the last 180 counter rotation does two things first of all it speeds up the spin second it slows down your overall rotation speed when you counter rotate you actually slow down your maximum speed of rotation this is why if you use counter rotation early in",
      "timestamp": 160,
      "endTime": 181,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "As you approach the landing of your backside 900, use counter-rotation on the last 180 degrees of your spin to slow down your rotation. This technique helps you stick the blind landing and avoid sliding out.",
      "rawText": "the speed it's going to cause disconnect and slow down your spin but if you use it for the last 180 it has the double factor of speeding up your rotation while killing your spinning momentum so that way if you use counter rotation you're going come in with less momentum making it easier to hold the blind landing and not slide out to heels this technique is usually used when you're going a little bit slower than you expected of a jump because it helps you",
      "timestamp": 183,
      "endTime": 204,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "Let go of your grab *earlier* than you normally would. This will help maintain a consistent rotation speed, which is key when learning a new trick like a Backside 900.",
      "rawText": "speed it up and it helps you go and kill your momentum what really helps if not Landing that sweet spot of the jump because it's going to make it easier to control the landing the next thing you can do to really help your back nines is let go of a grab earlier than normal you generally want to grab for as long as possible but when learning a new trick we want to focus on getting a constant rotation speed and when you let go of a grab you're able to do a few things you",
      "timestamp": 206,
      "endTime": 227,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "To control your backside 900 rotation speed, actively adjust your body tension. Tighten your core and pull your knees in to speed up the spin, or soften your body and extend to slow it down.",
      "rawText": "can pull your knees in you're able to tighten your core you're able to go and increase your rotation speed or you can do the opposite and extend soften up and that slow down your rotation this is why you can go and control your spin so much more by letting go of a grab a little bit early we often use the phrase in snowboarding flexing every muscle in the body when I do a back nine and I really",
      "timestamp": 228,
      "endTime": 248,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "To initiate the Backside 900, try two opposite approaches: either tighten up your body and pull in with your upper body (maybe even flex your eyes) for a fast rotation, or make yourself big and spread out your arms to slow down the rotation.",
      "rawText": "need to get it around I let go of a grab and I go and tighten everything up making sure I'm pulling in with my upper body sometimes I even feel like I'm flexing my eyeballs to help get that rotation around and then I also do the opposite where I let go of a grab I go make myself big spread out my arms and slow down my overall rotation speed this is really useful if you're going and",
      "timestamp": 250,
      "endTime": 270,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "If you're overshooting a backside 900, release your grab and expand your body to slow down your rotation and adjust your landing. This gives you more time in the air to correct your spin.",
      "rawText": "overshooting a jump because if you snap your spin with enough rotational force that you land perfect in sweet spot if you land deep on the jump you're going need to slow down that speed and the best way to do it is by letting go of that grab and expanding yourself backside 900s are one of the first tricks where you'll have enough time in the air to decide you don't have it for example you can be going for a backside 900 realize that you're not going to",
      "timestamp": 273,
      "endTime": 294,
      "duration": 21
    },
    {
      "stepNumber": 13,
      "summary": "If you're under-rotating on a Backside 900, it's okay to land a 720 instead. This is easier if you have a flatter axis rotation.",
      "rawText": "clear the knuckle and you can stop it at 720 you generally want to commit to every trick you're doing in snowboarding but if you're coming up short on a back nine it's okay to pull out and do a seven this is one of the reasons it's useful to have a flatter axis rotation because it makes it more flexible for pulling out and adjusting what spin you're doing so generally you want to lace it every time but this is the first",
      "timestamp": 296,
      "endTime": 317,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "Focus on controlling your rotation in the air, and decide early if you'll land a 720 or commit to the 900. Practice backside spins flat to improve your ability to adjust in the air.",
      "rawText": "trick you'll really be able to decide in the air if you have enough rotation or you need to keep it at seven so don't force it don't try to twist around last second instead go engage Where You Are and control and come into the landing either seven or commit to the nine this is why I highly recommend going and getting your backside spins flat because it makes it so much safer to make adjustments when you really cork a spin",
      "timestamp": 319,
      "endTime": 340,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Focus on keeping your rotation flat while learning backside sevens, as this will help you progress to a backside 900 and beyond. This means keeping the board as level as possible throughout the spin.",
      "rawText": "you're committed to that axis of rotation because you're only going to come to your feet once you go and finish that complete rotation but by keeping your rotation flat you'll be able to do the seven same axis do the nine and then you can even transition it to 10 in the future so if you're really quirky on on your back sevens I recommend taking the time and learning how to do them in a flatter access because it's going to",
      "timestamp": 342,
      "endTime": 363,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "To safely learn a Backside 900, ensure your Backside 720s and Backside 540s are consistently locked in. Consider using video analysis to assess your progress if you don't have a coach.",
      "rawText": "make this trick a lot safer and future trick safer back ns are a really complex trick that you need to make sure that you have your back sevens and back fives locked in it's really hard to tell if your tricks are ready to move them on to the next point so if you're thinking about trying this trick and you don't have a coach I highly recommend checking out addiction Plus on addiction plus we have a feature called video analysis where you can submit a clip of your",
      "timestamp": 365,
      "endTime": 386,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "Find a 20-30ft jump and carve a backside 7 setup, carving slightly harder than you would for a backside 7, then spot under your back arm grabbing around.",
      "rawText": "want to help getting into that next level check out addiction plus it's the most affordable program on the internet and I really believe it's the best tool we have to improve your riding recap find a 20 to 30ft jump do your normal backside 7 setup carve slow just slightly harder than for a back seven spot under your back arm grabbing around",
      "timestamp": 410,
      "endTime": 430,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "Lead your upper body rotation and eyes past the jump's knuckle, then hold your toe edge in the blind landing longer than you think you need to before looking up.",
      "rawText": "270 hold your eyes on the knuckle as you rotate around your spot use your judgment to decide if you can continue to hold the grab or you need to let go to make adjustments continue to lead the rotation of your upper body let your eyes past the knuckle tracking uphill finishing in that blind Landing dig in your tow Edge and hold that blind Landing for longer than you think then look up and ride away hopefully that",
      "timestamp": 433,
      "endTime": 454,
      "duration": 21
    }
  ]
}