{
  "trickId": "back-double-cork-1080",
  "trickName": "Back Double Cork 1080",
  "aliases": [
    "back dub 1080",
    "backside double cork ten eighty",
    "back double 10",
    "BDC 1080"
  ],
  "videoId": "BAPfrEr7NXk",
  "videoTitle": "Make Back Dub 1080's Look Easy",
  "totalDuration": 647,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To learn a Back Double Cork 1080, first master a back cork 5, which involves snapping over your tail in a down throw motion. Then, combine the back cork 5 with an upward cab under flip.",
      "rawText": "want to see as many people as possible throwing these on the mountain the first step to learning a dub back 10 is figuring out what it is a duback 10 is two components first a back Ork 5 where you're snapping over your tail this is a down throw motion and then the second motion to this trick is an upward cab under flip it's by combining this back cork five with a cab under flip that you",
      "timestamp": 69,
      "endTime": 91,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "To set up for a Back Double Cork 1080, use a \"stacked takeoff\" by throwing over your tail and fully extending, shifting your weight back. This will position you at a 450 degree rotation for the next part of the trick.",
      "rawText": "get the dub back 10 so how do we do this the duback 10 uses two underlining principles first is a stacked takeoff where you're throwing over your tail it's really important to get a full extension with your weight being shifted over your tail off takeoff what this will do is it will set you up at 450 for the next part of this trick the cab",
      "timestamp": 94,
      "endTime": 114,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "To prepare for a Back Double Cork 1080, master the \"under flip a cab under flip,\" which is essentially a switch frontside cork 5.  This drill helps you learn the crucial shift from downward to upward rotation after spotting the knuckle on your approach.",
      "rawText": "under flip a cab under flip is a switch front side cork 5 and it's absolutely crucial to get dialed in for a dub back 10 because if a dub back 10 is combining these two principles first that snap off your tail taking around to 450 where you spot the knuckle and as soon as you spot the knuckle you shift your downward rotation into an upward",
      "timestamp": 116,
      "endTime": 136,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "To initiate the Back Double Cork 1080, fully extend and snap over the tail, then execute a \"cab five\" rotation, coming up and over your shoulder. This will set you up for the complex rotation needed for the trick.",
      "rawText": "rotation ideally feeling just like a cab five for a second part of a spin because the rotation access is so complex it's actually very flexible for the access you end up using on the dub back 10 but there's the two main principles you need to hit ftic fully extended snap over the tail and that cab five where you're coming up and over your shoulder you",
      "timestamp": 138,
      "endTime": 158,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "To learn a Back Double Cork 1080, master cab cork variations with different flippy and flat approaches to get comfortable with various aerial positions. This will help you avoid being in an awkward position during the second flip of your double cork.",
      "rawText": "can't do a dub back 10 without either of those two steps so even though it's a super flexible trick you need to get both of these components locked in before trying it I recommend doing these cab cork Vibes more flippy more flat just filling every possible situation because the last thing you want is to be doing a dub back 10 and end up in the second part of your flip in an access you're not comfortable with so do a",
      "timestamp": 161,
      "endTime": 181,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "To prepare for a Back Double Cork 1080, master the Cab Cork 5. Your throw should be up and over your front shoulder, maintaining a tall chest with the throw angled backwards.",
      "rawText": "bunch of cab cork fives do them flippy do them cart do them flat get really comfortable with this trick because it's going to be the second half of your dub back 10 making it the safety net of the trick in order to do a proper cab cork 5 you need to follow V steps your throw needs to be up and over your front shoulder your chest should be tall with your throw angled backwards it's this",
      "timestamp": 183,
      "endTime": 203,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "To learn the second half of a Back Double Cork 1080, start with a cab underflip, gradually increasing the rotation over your shoulder to make the trick more spinny. This builds the necessary motion for a smooth landing.",
      "rawText": "awkward motion of opening your chest and dipping your front shoulder that Mak makes the cab cork 5 work the best way to get this motion unlocked is just start with a cab under flip and then gradually turn more and more over your shoulder making it more spinny as you go this is the second half of a dub back 10 so it determines how you land so it's really important to build it up and get really comfortable with this trick do it",
      "timestamp": 206,
      "endTime": 227,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "If you're learning Back Double Cork 1080, practice your Cab Cork 5's to perfect the flip-to-spin ratio. This will help you learn to go over your head two times, ensuring a stable landing.",
      "rawText": "on small jumps do it on bigger jumps and just do as many as you can because it's your safety net for of a dub back tent you'll know that you have a perfect cab cork 5 when you flipped to spin ratio is the same this means you'll be popping up and flipping the same amount as you're spinning allowing you to come into the landing with that two-footed stop next you're going to learn how to go over your head two times the best way to do",
      "timestamp": 228,
      "endTime": 249,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "To practice the back double cork 1080, start with a Misty 5 and slightly over-rotate it to end up in a backdrop position. Then, from that backdrop position, perform a backflip.",
      "rawText": "this is the dub back Misty n on trampoline this is a much harder trick on snow so you will not be using in your progression for of a dub back 10 on an actual jump instead we're only going to be focused on this trick for the to practice this trick do a misty five and slightly overr rotate it so you end up in a backdrop from there go and do a backdrop back flip this is the feeling",
      "timestamp": 252,
      "endTime": 273,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "Get comfortable with the back Misty (backflip with a grab) as this motion is similar to the Back Double Cork 1080. Practice this feeling, and consider using a mat for safe trampolining.",
      "rawText": "of the dub back Misty n where you go flip over hit your back and then pull and look backward finishing rotation get really comfy with this motion because it's exactly the feeling that you'll be getting on the dub Misty 9 your first time trying a dub make sure you have someone throwing a mat for you a mat is just a great way to make trampolining safer than it already is when using a mat we use What's called the free bounce",
      "timestamp": 276,
      "endTime": 296,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "Use a 3-2-1 count, throwing the Back Double Cork 1080 on \"one\" to coordinate with your spotter and nail the timing for your trick. This helps with spotting and improves your chances of landing successfully.",
      "rawText": "system that is where you go and say three 2 one throwing the trick on one this helps you coordinate with your mat thrower when you're going to do the trick making it so it's easier for them to go and catch you so every time you're on a trampoline and you have someone throw a mat use this system three 2 one throwing the trick on the count of one just like on a snowboard it's really",
      "timestamp": 298,
      "endTime": 320,
      "duration": 22
    },
    {
      "stepNumber": 12,
      "summary": "Practice a \"dub back Misty 9\" (a Misty Flip into a backflip) to get comfortable with throwing down and then rotating upwards, which is crucial for the \"Back Double Cork 1080.\"",
      "rawText": "important to get a full extension off the trampoline this will go and set you up perfect to go and pull back into that back flip because a dub back Misty 9 is really just a straight up Misty into a back flip and it's going to be great for getting used to a feeling of throwing down and then rotating up that will be crucial for the dub back 10 once you get really comfy with a dub Back N it's time",
      "timestamp": 322,
      "endTime": 343,
      "duration": 21
    },
    {
      "stepNumber": 13,
      "summary": "To initiate a Back Double Cork 1080, flatten your initial takeoff trajectory more like a spin, instead of a straight down backflip. Then, pull over your shoulder, similar to a Cab underflip.",
      "rawText": "to do a dub back 10 foris we use the same principles but instead of looking straight back like a backflip we'll be going and pulling over a shoulder like a cab under flip this is a really tricky motion that takes a lot of muscle memory but what you want to focus on is instead of going full on down like you would for a MTI try flatten out a bit throw it a bit more like a spin and then pull into",
      "timestamp": 345,
      "endTime": 366,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "To flatten your rotation and make it more spin-focused for the Back Double Cork 1080, use your back arm to aggressively pull open your shoulder as you initiate the trick. This will help you get the desired spin over the jump.",
      "rawText": "your cab under flip I like to really utilize my back arm pulling open my shoulder and this will help flatten your rotation making it so your rotation is more spinny than flippy what's really crucial for getting the tent this is still much more flippy than you'll want going off of a jump but we're using it to get used to the motion of throwing down and been throwing into our spin but",
      "timestamp": 369,
      "endTime": 389,
      "duration": 20
    },
    {
      "stepNumber": 15,
      "summary": "To prepare for a Back Double Cork 1080, master a perfect back seven off a small jump. Focus on a strong snap off the tail, consistent rotation, consistent spotting, and a solid two-footed landing.",
      "rawText": "on an actual jump we're going to want to throw it a lot more like a back seven than a dub MTI the last stage you need to get locked in before trying for dub back 10 is getting an absolutely perfect back seven off of a small jump this means you're getting a full snap off your tail a constant rotation as you're constant spotting the whole time finishing with that two-footed Landing",
      "timestamp": 392,
      "endTime": 413,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "Focus on mastering the \"back seven\" (backside 720) off a small jump, as it shares key core and tail-snap techniques crucial for a Back Double Cork 1080. Achieving a good takeoff and maintaining proper head position are critical for success in the Double Cork 1080.",
      "rawText": "the snap off the tail and the constant activation of your core at needed to do a back seven off a small jump is really similar to emotion and feeling of doing a dub back 10 so you really want to get these locked on before even thinking about doing a dub back 10 your success on a dub back 10 is determined by two things your takeoff and your head position let's first break down but take off it's going to be very similar to how",
      "timestamp": 416,
      "endTime": 438,
      "duration": 22
    },
    {
      "stepNumber": 17,
      "summary": "To get your \"Back Double Cork 1080\" flippy, shift your upper body down towards the tail of your snowboard as you take off. This will help initiate the flip.",
      "rawText": "you take off for a back seven but instead of going and keeping our body aligned and Tall we're going to go and shift it all the way over the tail of our snowboards this is what's going to set us on our AIS the more you shift your upper body down towards your tail the more flippy your Dub's going to be and the more you keep it flat the more flat spin likee it's going to be the",
      "timestamp": 440,
      "endTime": 460,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "When throwing the Back Double Cork 1080, extend your body fully over your tail, initiating the throw more like a spin to achieve a smooth and consistent rotation. Avoid throwing the trick directly toward your toes.",
      "rawText": "most crucial part is that your throw is set fully extended over your tail the biggest mistake I see on du back T is people throwing it straight to their toes like you would a MTI on the trampoline so make sure that you're going and throwing it more like a spin just really set over your tail because this is what's going to give you a constant smooth rotation and set you up to spot what brings us into step two",
      "timestamp": 461,
      "endTime": 483,
      "duration": 22
    },
    {
      "stepNumber": 19,
      "summary": "After snapping and grabbing, rotate about 450 degrees, then pull your head up, tucking your chin into your shoulder to set up for the second flip and ensure a 1080 rotation. Avoid throwing your head straight back.",
      "rawText": "head positioning after your snap and grab you're going to be rotated around 450 at this point you need to pull your head up tucking your chin into your shoulder this will be what sets for second flip it's important to not throw your head straight back over because this will put you on axis for the dub back nine where we're trying to do the dub back 10 so instead of going straight",
      "timestamp": 486,
      "endTime": 506,
      "duration": 20
    },
    {
      "stepNumber": 20,
      "summary": "To achieve a smooth, controlled Back Double Cork 1080, focus on driving your chin towards your back arm and dipping your upper body into the rotation. This motion should feel similar to initiating a Cab Cork 5, helping you spot and manage the spin.",
      "rawText": "over it's more your chin into your back arm and dipping your whole upper body into it this is what's going to put you on that smooth constant rotation that allows you to spot and control the spin ideally you'll be pulling into the second part of a dubac 10 just like you would a cab cork 5 and it should feel very similar when done right what really helps for training this is practicing",
      "timestamp": 508,
      "endTime": 529,
      "duration": 21
    },
    {
      "stepNumber": 21,
      "summary": "Get your chin to your back shoulder, tuck in tightly, and lean over with your upper body while keeping your core engaged in one fluent motion. This combined motion is key to the back double cork 1080.",
      "rawText": "getting your chin into your back shoulder and tucking in and over with your whole upper body keeping your whole core tight and engaged that's really crucial for this trick just snap it tighten up and lean over all in one motion because even though the DU back 10 is too separate motions to make one trick we're still trying to combine it into one fluent set of motions that goes",
      "timestamp": 531,
      "endTime": 551,
      "duration": 20
    },
    {
      "stepNumber": 22,
      "summary": "Visualize the entire Back Double Cork 1080 trick before attempting it, focusing on your windup, snap, spot, and pull. This mental preparation will make executing the trick on snow much smoother.",
      "rawText": "and lets us go and perform this trick in a smooth Safe Way another tool that's really useful for the duback 10 is visualization I've done hundreds of back tens I still go and and visualize it every time my windup my snap my spot my pull by getting comfortable with this Motion in your head you're going to be able to bring it into snow a lot easier",
      "timestamp": 554,
      "endTime": 575,
      "duration": 21
    },
    {
      "stepNumber": 23,
      "summary": "Practice and visualize a \"du back 10\" (likely a back double cork 1080) before attempting the full trick. This will help with the flips and the overall flow of the rotation.",
      "rawText": "because it's going to be a lot less sudden and surprising for these flips so before doing a du back 10 practice and visualizing it it's really going to help but du back 10 isn't a super technical trick and it's really forgiving for AIS and rotation because you have so much room to speed up and change the trick in the air but it's really important to not skip these fundamental steps St because",
      "timestamp": 577,
      "endTime": 598,
      "duration": 21
    },
    {
      "stepNumber": 24,
      "summary": "Focus on mastering the foundational tricks (Cab Cork, etc.) before attempting the Backside Double Cork 1080. Perfecting these prior steps will significantly increase your chances of landing the more complex trick.",
      "rawText": "if you go and mess up your takeoff or you don't have a proper cab cork Vibe it's going to make the trick really hard to land so take time build the prior steps because once you can do those steps perfectly the backside 1080 is going to come pretty naturally to you it's still a double and a legendary trick so there's a lot of work but by putting in these steps it's going to make it a lot more approachable and a",
      "timestamp": 600,
      "endTime": 620,
      "duration": 20
    },
    {
      "stepNumber": 25,
      "summary": "To land a Back Double Cork 1080, find a great jump and maintain a smooth takeoff with a straight edge and tall upper body. As you spin, grab around 270 degrees, tuck your head into your shoulder to spot the landing, and pull into your spin.",
      "rawText": "lot easier to break down recap find a great jump with amazing conditions get a smooth takeoff with a straight great Edge line and a tall upper body growing down over your tail grabbing around 270 tucking your head into your shoulder and spotting the knuckle pulling into your spin Landing stacked and riding away I'm Tavis from snowboard addiction and I",
      "timestamp": 622,
      "endTime": 644,
      "duration": 22
    }
  ]
}