{
  "trickId": "backside-540",
  "trickName": "Backside 540",
  "aliases": [
    "bs 540",
    "back 540",
    "backside five forty"
  ],
  "videoId": "tCoQ3sSYT2A",
  "videoTitle": "How To Backside 540 On A Snowboard",
  "totalDuration": 627,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To learn a Backside 540, you should first master Backside 360s and Backside 180s. Then, practice maintaining a constant visual focus on the jump's takeoff point (\"knuckle\") as your body rotates.",
      "rawText": "good in order to learn a backside 540 you're going need to be able to do backside 360 and backside 180 after that the main challenge of this trick comes from learning how to spot the knuckle and letting your body rotate around that point this is what we call a constant spot the best way to practice any 540 is on trampoline and ideally with one of our snowboard addiction boards the",
      "timestamp": 22,
      "endTime": 43,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "When practicing a backside 540, spot the knuckle around the 270-degree point and lock your eyes on it as your body rotates. This helps maintain consistent rotation and minimize head movement.",
      "rawText": "skills you're trying to lock in on trampoline is the constant spot with the consistent rotation to do this you need to lock your eyes on a point of a trampoline and let your body rotate around that point trying to get as little head movement as possible but ideal backside 540 as you spotting the knuckle around 270 and locking your eyes on the knuckle as your body rotates",
      "timestamp": 45,
      "endTime": 66,
      "duration": 21
    },
    {
      "stepNumber": 3,
      "summary": "Keep your arms slightly away from your body throughout the rotation to maintain balance and avoid getting caught up in the spin. This helps prepare for a blind landing.",
      "rawText": "around that point finishing you off in that blind landing position the form you will be using is the back free from your take off with the blind landing spot from the back one it's important to make sure you're not getting caught up on your arms by letting them come in to the center of your torso your arm should always be slightly away from your body not spread out but just slightly away so",
      "timestamp": 68,
      "endTime": 88,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "Keep your knees stacked – meaning, straight over your toes and not caving inwards – and keep your arms out to maintain a constant, stable rotation during the Backside 540.",
      "rawText": "you're not getting caught up on your arms it's also important to make sure your knees are in a strong stack position this means you're not letting your knees cave in towards each other keeping your knees out knees straight over your toes stacked these two things are going to really do a lot to help you get a constant rotation and feel stable in the air having your arms out will let you leave the rotation with your upper",
      "timestamp": 90,
      "endTime": 111,
      "duration": 21
    },
    {
      "stepNumber": 5,
      "summary": "Keep your spot (the landing) under your arm to connect your upper and lower body and spot the landing sooner. Avoid spotting over your shoulder.",
      "rawText": "body as well as keeping your spot underneath your arm it will let you spot the knuckle much sooner let's talk a bit more about the spotting under the arm because this is a super crucial often overlooked aspect of spinning if you try to spot over your shoulder what it's going to do is disconnect your upper body from lower body making you too tall in the Torso it'll also make it so you need to look around to spot the landing",
      "timestamp": 112,
      "endTime": 133,
      "duration": 21
    },
    {
      "stepNumber": 6,
      "summary": "To keep your rotation smooth in a Backside 540, spot the landing by looking under your armpit as soon as you snap. Hold that spot throughout the rotation.",
      "rawText": "where if you shift your spot to under your arm you'll be able to go and keep your body stacked in a tight position snap look under your arm spot the knuckle right away and then hold the spot the whole time with slight change is spotting under your shoulder versus over your shoulder is one of the most crucial parts of getting a constant smooth rotation and it's one of the things that will help your riding the",
      "timestamp": 136,
      "endTime": 157,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "To maintain constant vision for your backside 540, shift your gaze under your arm instead of over your shoulder. This will help you spot the landing throughout the entire spin.",
      "rawText": "most spotting over the shoulder also causes something called a double spot a double spot is when you go spot for landing and then flick your head around again to try Spot It Again giving you a moment of blindness where our goal on a backside 540 is having a constant spot for the whole spin so by shifting your view to under your arm you'll be able to go and spot the knuckle all the way at",
      "timestamp": 158,
      "endTime": 179,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "Focus on holding a strong form with minimal head movement while you rotate a 180. This visual positioning from the 180 will give you a powerful start for your backside 540.",
      "rawText": "180 and hold that spot the whole time making sure you're not blind for any point of a rotation and you're holding a strong form the whole time with as little head movement as possible and it's visal position that will give you really powerful backside 540s it's always best to do your tricks off the smallest jump possible when learning there's two reasons for this first of",
      "timestamp": 182,
      "endTime": 202,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "Focus on learning your Backside 540 on a small jump to ensure your takeoff and landing are precise, as this prevents you from compensating for poor form.",
      "rawText": "all it eliminates a lot of risk of hitting a bigger jump second the most crucial part is it makes it so you can't cheat your form the more air you have the more you'll be able to get away with but on a small jump you'll need to make sure your takeoff spot and Landing are absolutely dialed in in order to fully do the trick this is why it's best to learn your tricks on small jumps because",
      "timestamp": 204,
      "endTime": 224,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "Warm up with a few backside 360s, focusing on landing in your stacked position on the jump's sweet spot. Once you're comfortable with that, you're ready to try the backside 540.",
      "rawText": "then later you'll be able to transfer them to bigger jumps and bigger tricks without the same issues You' have if you started off on bigger jumps the back five is really just building off the backside 360 so warm up with a few backside 360s making sure that you're Landing in your stack position in The Sweet Spot of the jump once you do that you're ready to try a 540 use the exact",
      "timestamp": 226,
      "endTime": 246,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "Use a similar approach as your backside 360, but with slightly more power. You can \"cheat\" the spin by using counter-rotation at the end to whip your body around for the extra 180 degrees.",
      "rawText": "same approach you use on your bside 360 you'll only need to use slightly more power this is because the bside 540 are what we call a cheat spin a cheat spin means you can finish the trick with counter rotation allowing you to whip around your body an extra 180 right at the last moment your first few back FES will be like this similar to a backside",
      "timestamp": 249,
      "endTime": 270,
      "duration": 21
    },
    {
      "stepNumber": 12,
      "summary": "When learning a backside 540, expect to be blind until you've rotated about 270 degrees. Once you see a landmark like the knuckle of the jump, focus your vision on it to maintain control through the rest of the spin.",
      "rawText": "360 but smashing a quick counter rotated back one onto the end of a trick as you improve you'll start you have a constant rotation through the whole spin what will make your back fives more stylish and controlled backside 540s have you blind for the initial start of the spin so expect to not see a knuckle until around 270 once you see a knuckle hold your vision on it as you continue to",
      "timestamp": 272,
      "endTime": 294,
      "duration": 22
    },
    {
      "stepNumber": 13,
      "summary": "When approaching the landing, focus on tilting your chin down while keeping your eyes looking past your back foot to control your rotation and maintain your stacked position.",
      "rawText": "rotate around your spot if you go deep you will lose track of the knuckle this is completely okay just keep your spot uphill trying to keep your eyes looking past your back foot this will help you kill your rotation and keep your stacked position when coming into your blind Landing you want to make sure you're not leaning into your spot instead make sure you're just tilting your chin down while",
      "timestamp": 296,
      "endTime": 317,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "Keep your body stacked and tall as you approach the landing. This position will help you absorb the impact and maintain control after the blind landing.",
      "rawText": "keeping your body stacked and Tall this will help you fully absorb the impact while going and holding that blind landing position it's only a chin tilt so you don't need to get your body up and over into your spot the more stacked you are hitting the landing the easier it will be to absorb the impact and stop yourself from spinning out the more stacked you are on the landing the better so really go and focus in on",
      "timestamp": 319,
      "endTime": 340,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Focus on keeping your chin tilted down towards the snow while rotating, as this will help you track your landing. Consistent spotting at the knuckle during your rotation will improve your ability to see the landing.",
      "rawText": "figuring out how to tilt your chin down towards the snow without having your body follow the first few backside 540s you do you'll probably have a really hard time tracking the landing and knowing where you are in the air this is completely normal and it's something that will fade with time as long as your spot is set at the knuckle and you're training that constant spot rotation eventually you'll be able to see it more",
      "timestamp": 342,
      "endTime": 363,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "To stomp your backside 540, focus on a \"blind landing\": as you go over the jump, look back uphill and track the knuckle with your gaze to guide your landing. This natural body position helps you orient yourself in the air.",
      "rawText": "and more until eventually you'll know exactly where you are in the air at all times there are two things that will help you stomp your backside 540s the first is your blind Landing a blind Landing refers to looking back uphill as you land this happens naturally as you go over the knuckle and continue to track the knuckle with your spot the reason why this works is because it",
      "timestamp": 364,
      "endTime": 385,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "To help land your Backside 540, pre-rotate your upper body towards the jump. This gives you time to manage the rotation on landing.",
      "rawText": "makes it so your upper body is rotated to towards the jump so when you land you have time to disperse that rotation without needing to generate that Force into your heel Edge the next tool you can use is counter rotation counter rotation lets you use your lower body to rotate the last 180 on a back five using counter rotation also slows down your overall rotation speed so any part of",
      "timestamp": 387,
      "endTime": 408,
      "duration": 21
    },
    {
      "stepNumber": 18,
      "summary": "To control your backside 540, use counter-rotation to slow your spin, making it easier to hold the landing. Keep spotting your landing to help your head catch up with your body's rotation.",
      "rawText": "your spin after you use counter rotation will be much slower this makes counter rotation a great way to not only speed up your spin but also kill your rotation making it easier to hold your blind Landing letting you stomp and ride away the thing that makes both of these work is the constant spot because it makes it so your head's leaving your rotation letting you then catchup with your lower",
      "timestamp": 410,
      "endTime": 430,
      "duration": 20
    },
    {
      "stepNumber": 19,
      "summary": "Focus on spotting the landing knuckle underneath your arm as you rotate. Lock your eyes on that spot to help your body rotate correctly.",
      "rawText": "body as well as holding the blind Landing as you pass the knuckle I talk about it a lot in this video but the constant spot is what will let you go and get a good 540 so really put a lot of focus into spotting underneath your arm and locking your eyes on that knuckle and figuring out the body motion to rotate around your spot the best ways to do this is on trampoline and through practice it's also the same principles",
      "timestamp": 432,
      "endTime": 453,
      "duration": 21
    },
    {
      "stepNumber": 20,
      "summary": "If you're struggling with the backside 540, practice the \"constant spot\" technique used in frontside 360s. This helps with the difference in spotting and gives you a strong snap for the 540.",
      "rawText": "used on a front side 360 so if you're struggling with the constant spot go back maybe do some front side freeze and translate what you learn from back into your backside 540 because this constant spot is the difference between a bside 360 and a backside 540 recap you want to have a smooth setup car slightly stronger snap than 4 360 spotting",
      "timestamp": 455,
      "endTime": 476,
      "duration": 21
    },
    {
      "stepNumber": 21,
      "summary": "Focus on your landing: Dig in your toe edge on the landing, hold the blind landing position until you've fully stopped spinning, then look up and ride away.",
      "rawText": "underneath your shoulder locking your eyes on the knuckle rotating around your spot digging in your toe Edge on the landing holding the blind landing position until you've fully killed your spin then look up and ride away backside 540s are super difficult if you don't have your backside 360s perfect it can be really hard to tell if your 360s are dialed in and perfect because there's so",
      "timestamp": 478,
      "endTime": 499,
      "duration": 21
    },
    {
      "stepNumber": 22,
      "summary": "Practice your backside 540s on small jumps without grabs to build consistency. Once comfortable, move to bigger jumps and incorporate a grab like the stalefish to help initiate and control your spin.",
      "rawText": "your riding once you've landed your first backside 540 it's time to start grinding them out do a bunch of them on little jums with no grabs and once you're feeling comfortable you can start bringing them to bigger jumps and adding grabs my personal favorite grab for the backside 540 is the stalefish because it makes it so my back arms leading the rotation helping me get the spin around and it just feels right there as a war",
      "timestamp": 546,
      "endTime": 567,
      "duration": 21
    },
    {
      "stepNumber": 23,
      "summary": "Focus on building a solid backside 360 first, ensuring a strong, stacked takeoff with no drifting and a powerful tail snap. This will provide the foundation for a proper backside 540 and prevent the development of bad habits.",
      "rawText": "warning back fives are where a lot of people Max up for snowboarding tricks this is because there's a lot of way to cheat a backs side 540 and make it work but it won't then translate to bigger tricks like backside 720s so if you really want to get a proper backside 540 don't neglect your backside 360s be truthful of yourself and make sure you're getting that strong stack takeoff no drift and Powerful snap of a tail",
      "timestamp": 569,
      "endTime": 590,
      "duration": 21
    },
    {
      "stepNumber": 24,
      "summary": "Focus on mastering backside 360s first. A solid backside 360 foundation is key to learning backside 540s, making the 540 much easier to learn once you have it down.",
      "rawText": "because it's that strong backside 360 Foundation that's going to be crucial for back f and back sevens so if you are honestly trying to improve as a rider spend most of your time on backside 360s and then once you do you'll be able to Backside five much easier after that it's time to start grinding your back FES and grinding your back freeze getting those super powerful takeoff that let you",
      "timestamp": 594,
      "endTime": 614,
      "duration": 20
    }
  ]
}