{
  "trickId": "frontside-360",
  "trickName": "Frontside 360",
  "aliases": [
    "fs 360",
    "front 360",
    "frontside three sixty"
  ],
  "videoId": "dLZwlLgohFw",
  "videoTitle": "How To Frontside 360 On A Snowboard",
  "totalDuration": 585,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To land a frontside 360, you'll need a good setup carve, a consistent spot to look at, and the ability to ride blind. Practice these three essential skills to master the trick.",
      "rawText": "hey snow addiction Tavis here and in this video I'm going to teach you how to front side [Music] [Applause] [Music] [Applause] [Music] [Applause] 360 for a front side 360 you will need three essential skills your setup carve your constant spot and your blind",
      "timestamp": 0,
      "endTime": 22,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "When approaching the jump for a frontside 360, keep your body \"closed off\" by keeping your shoulders facing towards the jump. This will set you up for a stronger rotation.",
      "rawText": "Landing it's combining these free skills that will give you a powerful strong front free to build off of in this video I'll be showing you what these free techniques are and how to train them starting with your setup carve there is two things you're trying to dial in on every setup carve first you're trying to keep your body closed off to the jump this means when you're approaching the jump you want you have your shoulder",
      "timestamp": 25,
      "endTime": 46,
      "duration": 21
    },
    {
      "stepNumber": 3,
      "summary": "To generate rotation for a frontside 360, wind up by turning your hips slightly towards your snowboard's tail before the takeoff. Avoid opening your body towards the takeoff, as this limits rotation and shifts your weight to your heels.",
      "rawText": "rotated behind you and have your hips slightly turned towards your tail this is what's called wind up and it's how you generate rotation on a front side spin a common mistake on front spins is opening your body towards the takeoff this opened hip position limits your range of motion making it harder to generate your spins it also shifts your weight onto your heels making it harder",
      "timestamp": 48,
      "endTime": 69,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "To land a frontside 360, stay stacked and aligned over your board, focusing on keeping your shoulders closed rather than opening your hips towards the jump. This will help you maintain balance and generate the necessary power.",
      "rawText": "to keep centered over your board a front side 360 doesn't take much power so you don't need to make this motion super exaggerated instead just focus on keeping stacked and aligned you want to avoid having your hips open towards the jump so by consciously going and shifting your shoulders closed and keeping stacked over your board you'll be in the ideal position to generate power on your front side free second you",
      "timestamp": 71,
      "endTime": 91,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "Minimize scrubbing (rotating your board before leaving the jump) as you approach the takeoff. Aim for a straighter line to maximize your power and airtime for a better frontside 360.",
      "rawText": "are trying to leave off a takeoff in as straight of a line as possible you can do a little bit of scrub but you don't want too much scrubbing is when you preent rotate off a jump having your board rotate the way you're spinning while leaving off the lip a little bit of this is okay but too much is going to go and limit the amount of power you can get off the board making you get less air and less rotation wear a straighter",
      "timestamp": 94,
      "endTime": 114,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "When taking off for your frontside 360, focus on snapping off your tail to gain height and set the correct arc. Keep light on your heels to aid in this.",
      "rawText": "takeoff where you're really snapping off your tail is going to give you way more height and set you on the proper Arc of a jump making the whole trick come together so a little bit of scrub is okay but you're trying to limit it as much as physically possible and the better you get at this the better your front freeze and front side takeoffs will be overall a good way to help with this is by keeping light on your heel",
      "timestamp": 117,
      "endTime": 137,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "To prepare for a frontside 360, maintain heel edge pressure on the approach to the jump, but avoid overdoing it, which can cause unwanted rotation. Instead, hold toe pressure until you reach the bottom of your carve.",
      "rawText": "Edge you want a little bit of heel Edge pressure the whole time you're going up the takeoff of a jump but too much heel pressure will make you start digging in and turning off a jump causing drift and making your board rotate before you're snapping your spin this lessens the amount of power and height you get off a jump making your rotation harder to control on an Ideal setup carve you hold tow pressure until you reach the bottom",
      "timestamp": 139,
      "endTime": 160,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "As you approach the takeoff, swap to your heel edge, keep your body closed off, and begin your spin. Finish the snap as your tail leaves the lip of the slope.",
      "rawText": "of a takeoff then you swap to your heel Edge keeping your body closed off start to frill your spin as you reach around halfway up the takeoff finishing your snap as your tail leaves the lip you don't need to be hitting jumps in order to train your setup card just going down a mellow pit slope if you go in practice switching from your toe Edge to your heel Edge winding up and snapping off of",
      "timestamp": 162,
      "endTime": 182,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "Focus on a \"closed off\" takeoff with light heel pressure and a snap that centers you over your tail. This helps with timing and edge pressure for a controlled spin.",
      "rawText": "the imaginary takeoff would do a lot to help you figure out your timing and Edge pressure what you're trying to achieve with this is that closed off takeoff that light heel pressure and a snap that has you centered over your tail making it so you'd leave off in a stack position once you have your setup carve it's time to learn how to control your spin in the air the most crucial step",
      "timestamp": 185,
      "endTime": 205,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "Focus on a constant spot: lock your eyes on the knuckle of the jump as soon as possible and maintain your gaze as you rotate. This constant focus will help guide your rotation.",
      "rawText": "for this is figuring out your spot spotting refers to spotting your Landing for a front side 360 you want to do what's called a constant spot this is when you lock your eyes on a point in the snow and your body rotates around as you keep your eyes locked on that point to do this you want to spot the knuckle of the jump as soon as possible the best way to go about this is spotting under",
      "timestamp": 208,
      "endTime": 229,
      "duration": 21
    },
    {
      "stepNumber": 11,
      "summary": "Your summarized tip here: Keep your vision focused downwards, spotting the knuckle of the jump under your arm throughout the rotation to maintain control and visualize your landing.",
      "rawText": "your arm spotting under your arm keeps your vision pointed downwards letting you go and spot the knuckle of the jump what's going to be really crucial for knowing where you are in the air and controlling your rotation and seeing your Landing versus when you try to spot over your shoulder you need to spot and try look around throwing your body out of whack and not letting you go and get",
      "timestamp": 232,
      "endTime": 252,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "Focus on a spot on the snow ahead of you and rotate a frontside 360 while keeping your eyes locked on that spot for as long as possible. This will help you learn the proper spotting technique and initiate the spin smoothly.",
      "rawText": "that constant one motion spot that is really crucial for smooth front side 360s the best way to practice this is just on the snow pick a point on the snow ahead of you and rotate a front side 360 as you hold your vision on that point you're trying to see this point as long as possible without needing to move your head this teaches you how to spot downwards as well as training the",
      "timestamp": 254,
      "endTime": 274,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "When landing a frontside 360, finish your spin with your back facing the landing. This \"blind landing\" requires you to prepare for landing without seeing the landing spot.",
      "rawText": "ability to rotate around your spot as well as having the added advantage of setting up perfect for a blind landing on front side 360s you go and finish your spin with your back to the landing of the jump this is what we call Landing blind and whenever you land blind you want to utilize What's called the blind Landing blind Landings are when you land",
      "timestamp": 276,
      "endTime": 296,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "Look uphill towards the landing spot as you spin. This allows you to slow your rotation and land in a stable position, preventing a heel edge slip.",
      "rawText": "looking uphill to towards the knuckle this helps you stop your Rotation by letting you slow down your rotational energy through the landing if you land looking forward on a front side 360 and haven't fully stopped your rotation in the air you are likely to slide to your heel Edge slipping out from your spin your constant spot will actually set you up perfect in that blind landing position because your eyes will be",
      "timestamp": 298,
      "endTime": 319,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "As you pass the knuckle during your frontside 360, shift your vision uphill to prepare for a blind landing. To stick the landing, dig in your toe edge to grip the snow and stop your rotation.",
      "rawText": "locked on the knuckle the whole time as you pass the knuckle your vision will shift uphill making you land in this blind landing position last thing you need to do to finish a blind Landing is to dig in your tow Edge digging in your Edge will make it so you grip the snow helping you stop your rotation and ride away clean there is a lot of little mistakes that can happen on front side 360 that we can't cover in this video",
      "timestamp": 321,
      "endTime": 342,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "To control your rotation at the end of a frontside 360, use counter-rotation: rotate your upper body in the opposite direction of your spin, and then center your core to stop the spin. This will help you slow down and land your trick.",
      "rawText": "counter rotation counter rotation is when you have your upper body rotate separately from your lower body and then you tighten your core bring everything back centered at the same time you stop your constant Rotation by counter rotating you slow down your constant speed of rotation and this is why using counter rotation should be saved into the end of your spins since it will be",
      "timestamp": 411,
      "endTime": 432,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "When in the air, bring your legs up towards your body to maintain balance and give yourself more room to control your rotation. This helps you stomp your spins.",
      "rawText": "very hard to keep rotating after using counter rotation using it to rotate and kill your rotation is a great way to help stomp your spins whenever you're hitting a jump on a snowboard it's really important to bring your legs up to your body this helps you go and maintain your balance in the air and gives you more room to play with for actual rotation in order to bring your legs up you need to make sure you're",
      "timestamp": 434,
      "endTime": 454,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "To get your legs up for a frontside 360, focus on getting a strong \"pop\" off the jump, which will naturally bring your legs up towards your body as you spin. Avoid actively trying to lift your legs before you've fully launched off the jump.",
      "rawText": "getting a good full pop off a jump because it's visible pop that will go and bring your legs up to your body as you set your spin you want to avoid the feeling of actually trying to lift your legs up to you before fully snapping off a takeoff when you get a good pop up a takeoff it'll naturally throw your legs up to your body helping you bring your legs up when spinning your front side",
      "timestamp": 456,
      "endTime": 476,
      "duration": 20
    },
    {
      "stepNumber": 19,
      "summary": "Keep your arms slightly away from your body and use your front arm to lead the rotation, following through with your back arm. This allows for a more fluid spin.",
      "rawText": "spins you want to watch for a few Cru body position mistakes the main one being letting your arms get caught up on your rotation this goes and restricts you and makes it so you can't use your shoulders to lead your rotation you always want to have your arms slightly away from your body letting you go and lead with your front arm and follow through with your back arm it's also",
      "timestamp": 477,
      "endTime": 497,
      "duration": 20
    },
    {
      "stepNumber": 20,
      "summary": "Keep your knees in a stacked, straight line and arms away from your body to maintain stability and control while spinning and landing a frontside 360. This position allows for better flexibility in the air.",
      "rawText": "important to make sure your knees aren't coming together you want your knees to be in your stacked straight line position because this will just give you a much more stable and balanced position to spin in and land in by making sure your knees aren't coming together and your arms are away from your body you'll have a lot more control and flexibility when in the air you can do front side 360s anywhere on the mountain or anywhere off the mountain we highly",
      "timestamp": 499,
      "endTime": 521,
      "duration": 22
    },
    {
      "stepNumber": 21,
      "summary": "Practice the frontside 360 motion on a trampoline or flat ground at home to get the feel of the rotation before attempting it on snow. This will help you understand the movement pattern.",
      "rawText": "recommend before try it on snow going to a trampoline and playing around with it the motion for a front side 360 is very similar on trampoline to snow we also make snowboard addiction trap boards what can give you a more accurate snowboard feel when on the trampolines but if you don't have access to a trampoline or one of her boards you can do front freeze just at home on flat ground and it's going to really help you",
      "timestamp": 523,
      "endTime": 545,
      "duration": 22
    },
    {
      "stepNumber": 22,
      "summary": "As you approach the jump, initiate a slight heel-edge carve, then open your upper body as you throw your spin, bringing your legs up to spot the landing as you rotate.",
      "rawText": "dial in this rotation recap a slight setup carve switching to your heel Edge as you start going up the lip a closed off upper body opening up as you throw your spin a straight edge line as you leave the lip off your tail Bing the knuckle of the jump as you bring your legs up locking in your spot and rotating around it putting down the landing in a blind landing position",
      "timestamp": 547,
      "endTime": 568,
      "duration": 21
    },
    {
      "stepNumber": 23,
      "summary": "As you land after rotating, dig in your toe edge to hold the blind landing, look up, and then ride away clean.",
      "rawText": "digging in your tow Edge as you hold the blind Landing after your rotation has stopped look up and ride away clean I'm T us from snowb addiction and our goal is to improve your riding",
      "timestamp": 571,
      "endTime": 585,
      "duration": 14
    }
  ]
}