{
  "trickId": "frontside-720",
  "trickName": "Frontside 720",
  "aliases": [
    "fs 720",
    "front 720",
    "frontside seven twenty"
  ],
  "videoId": "qDJSAetVz1k",
  "videoTitle": "How To Dial In Your Frontside 720",
  "totalDuration": 817,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To learn a Frontside 720, you need a solid frontside air and frontside 180 (frontside F) first.  Master these two tricks to build a foundation for the 720.",
      "rawText": "hey snow addiction Tavis here and today I'm going to teach you one of the most fun tricks of front side [Music] [Applause] [Music] [Applause] [Music] [Applause] 720 in order to front side 720 you're going to need your front freeze and your front F the better you have these two",
      "timestamp": 0,
      "endTime": 21,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "To learn a frontside 720, build upon your frontside 540 technique by adding a bit more snap and power. You can also utilize counter-rotation to help finish the extra 180 degrees.",
      "rawText": "tricks the easier it's going to be to go and get the front side 720 we're going to be building off what we learned on the front five and tweaking it in order to make it work on a front side 720 even though the front 7 is an extra 180 versus the front 5 it only takes slightly more snap and power this is because you can finish a front seven with counter rotation counter rotation",
      "timestamp": 23,
      "endTime": 43,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "To set up your Frontside 720, focus on a powerful pop off the tail of your board with minimal drifting off the jump. This clean takeoff will allow for smoother and more controlled rotation in the air.",
      "rawText": "allows you to speed up the trick as long as your body is in the correct position to fully utilize it in order to get set up to fully utilize counter rotation you're going to want to hit two points a good snap off your tail getting maximum pop out of a jump and little to no drift the more up with the least drift you can get will let you go and control your rotation more smoothly in the air then",
      "timestamp": 46,
      "endTime": 66,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "To initiate the Frontside 720, disconnect your upper and lower body to allow your legs to rotate. Keep your eyes locked on the landing spot to rotate your head, which helps with the counter-rotation.",
      "rawText": "then you go and disconnect your upper and lower body with that said let's talk a little bit about what is counter rotation counter rotation is when you disconnect your upper body and lower body allowing you to rotate your legs when leaving your upper body behind this will only work if you have the correct head positioning you need your eyes locked on the knuckle positioned for the blind Landing this rotates your head allowing you to use coun rotation to",
      "timestamp": 68,
      "endTime": 90,
      "duration": 22
    },
    {
      "stepNumber": 5,
      "summary": "To control your Frontside 720 landing, use counter-rotation in the final 180 degrees of the spin. This slows down your rotational momentum, helping you land stacked and reduce the chance of sliding out.",
      "rawText": "counter rotation for the last 180 of any spin this slowdown effect can actually be utilized to your advantage because using counter rotation to speed up your spin while slowing it down will kill your momentum when you're still in the air this makes it so you're going to be coming into the landing with less rotational Force resulting in an easier impact allowing you stay stacked and having a less chance of sliding out on",
      "timestamp": 113,
      "endTime": 134,
      "duration": 21
    },
    {
      "stepNumber": 6,
      "summary": "If you can consistently land a frontside 540 in a stacked position, the frontside 720 will be easier. Use counter-rotation for the final 180 degrees of the spin.",
      "rawText": "Landing this is why if you can do a front side 540 and fully finish the spin in a stack position it's easy to do a front side 720 because then you can just use counter rotation for the last 180 and absolutely lace the front seven that's why we call front 7 a cheat trick because you're putting in all the work for the front five and if you take the time to do that work the front 7 will come very naturally to you a great way",
      "timestamp": 137,
      "endTime": 158,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "To learn a frontside 720, use the same powerful takeoff position as a frontside 540. Then, lock your eyes on the knuckle and let your body rotate past it, similar to a frontside 360.",
      "rawText": "to visualize a front size 720 is imagine your front five combined with the spot of your front three because you're going to want the same takeoff the same powerful position as on a front five and then locking your eyes on the knuckle and letting your body rotate past that point just like you would on a front side 360 the hardest part of front 7 is the constant spot a constant spot is",
      "timestamp": 160,
      "endTime": 180,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "To land a frontside 720, pick a fixed point (like the jump's knuckle) and keep your eyes locked on it as you rotate. Minimize head movement and maintain a consistent rotation throughout the spin.",
      "rawText": "when you go and lock your eyes on a point for this instance it will be the knuckle of a jump and when you track that point with your eyes as your body rotates around it you're trying to have as little head movement as possible while maintaining as constant of a rotation as you can a common mistake you'll see on a front seven is the double spot a double spot is when you rotate 3E 60 spot the landing and then",
      "timestamp": 182,
      "endTime": 203,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "To successfully land a frontside 720, keep your head leading the rotation throughout the spin, just as you would for a frontside 360. This constant spotting ensures you can see your landing.",
      "rawText": "whip your head around again to go and spot The Landing this has the massive downside of making you blind for a moment during a crucial part of your spin a golden rule for snowboarding is that you can't spin without your head that's why your head should always be leading your rotation your constant spot on a front seven is using the same principles as on a front side 360 just to a larger extent the most important",
      "timestamp": 205,
      "endTime": 227,
      "duration": 22
    },
    {
      "stepNumber": 10,
      "summary": "To successfully land a Frontside 720, lock your eyes on a fixed point (like the knuckle of the jump) as you come out of the first 360, letting your body follow the rotation. This technique can be practiced on a trampoline to replicate the feeling.",
      "rawText": "part to executing it successfully is making sure that when you're coming out of the first 360 your head is leading the rotation looking locked down on that knuckle letting your body follow along the best way to train this is on trampoline on trampoline you can fully replicate the feeling of locking your eyes at one point and rotating around it we also make something called the",
      "timestamp": 229,
      "endTime": 249,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "For your first frontside 720 attempts, aim for a jump with a smooth takeoff and a moderate kick, ideally between 10 and 25 feet. This will help you generate the necessary power and rotation for the full spin.",
      "rawText": "the last 180 giving you a lot of room to add rotational speed throughout the spin I'd recommend 10 to 25 ft for your first front seven attempts because we are teaching you how to do it flat I'd also recommend that the jump doesn't have too much kick because you're going to need a very solid smooth takeoff in order to generate the power needed for front side 720 what brings us into the takeoff your",
      "timestamp": 273,
      "endTime": 293,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "To nail your Frontside 720, focus on a powerful takeoff: snap off your tail with full extension. Minimize any sideways sliding (scrubbing) off the jump to maintain your snap.",
      "rawText": "takeoff is the most important part of a front side 720 on a front 7 takeoff you need to make sure that you're getting a nice snap off your tail with full extension you can go and scrub off the takeoff a little bit I use a little bit of scrub myself but you're aiming for as little as possible because if you start sliding too much sideways off of the takeoff you're going to be missing your snap off your tail and missing a lot of",
      "timestamp": 297,
      "endTime": 318,
      "duration": 21
    },
    {
      "stepNumber": 13,
      "summary": "Be patient and strong on your frontside takeoff. This will generate the necessary power and rotation to spot the landing and complete the Frontside 720.",
      "rawText": "power and rotational force that you can generate by being a little bit more patient this is why the main thing I tell myself on any front side spin is be patient coming into a takeoff a patient strong front side takeoff is the base for every front side Spin and it will set you up to have the proper access and the proper Force allowing you to go and spot the knuckle and hold that rotation",
      "timestamp": 320,
      "endTime": 340,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "Focus on perfecting your takeoff for frontside 720s. Practice your frontside 360s, concentrating on a strong snap off the tail to generate the necessary rotation and enter the trick smoothly.",
      "rawText": "the whole way if you're struggling with your front side 72s it's probably stemming from a flaw and a takeoff so go and take the time and really get your takeoff styled in on your front freeze and front F because once you can get that strong snap off the tail you'll be able to enter the vortex and just really fully enjoy the trick from that point on there's a lot of little mistakes that",
      "timestamp": 342,
      "endTime": 362,
      "duration": 20
    },
    {
      "stepNumber": 15,
      "summary": "To initiate your frontside 720, throw your spin with the jump by extending your body for pop and rotation. Use a slight bend in your legs and hinge at your waist to generate the spin.",
      "rawText": "out if you have a time sign up for a free trial you have nothing to lose an important aspect to your front side takeoff is making sure that you're throwing with the jump throwing with the jump means that you're throwing your spin as your body extends giving you pop and rotation this is where a slight Bend of the legs and a slight hinge at the waist come into play so that when you",
      "timestamp": 429,
      "endTime": 449,
      "duration": 20
    },
    {
      "stepNumber": 16,
      "summary": "To initiate the Frontside 720, wind up your upper body, reaching 90 degrees of rotation by the jump's halfway point, then throw into the spin as your tail snaps off the jump. Focus on extending your legs and upper body for a powerful takeoff.",
      "rawText": "snap your spin you also have an extension through your legs and upper body with a perfect takeoff having you snap off your tail with your body completely extended with around 90° of rotation on your upper body in order to Tim this properly you should be finishing your wind up around halfway up the jump and starting your throw from that point finishing as your tail snaps",
      "timestamp": 451,
      "endTime": 471,
      "duration": 20
    },
    {
      "stepNumber": 17,
      "summary": "To generate power for your Frontside 720, focus on a slight wind-up and perfect timing of your body's extension off the lip. This \"pocket\" of rotation is key for maximizing spin and power.",
      "rawText": "off the lip if your body in that 90° rotation fully extended this window of rotation matched up of a timing of a takeoff is what we call hitting the pocket of the spin and this is where all power deres from on front side rotations mastering the motion of the slight wind up perfect time extension will let you front seven basically anything because it goes and generates so much power an",
      "timestamp": 473,
      "endTime": 494,
      "duration": 21
    },
    {
      "stepNumber": 18,
      "summary": "Focus on perfecting your takeoff timing for a cleaner launch, rather than winding up for more power. This will allow you to generate more power and rotation for your frontside 720.",
      "rawText": "important thing to know on a front 7 is you're not trying to wind up more for more power instead your power is coming from a cleaner takeoff with more dialed in timing so go and play around with this timing really get it channeled in because it's really going to let you go and master your takeoffs and generate so much power and snap off your tail this motion lets you get pop and rotation increasing your overall power combining",
      "timestamp": 496,
      "endTime": 517,
      "duration": 21
    },
    {
      "stepNumber": 19,
      "summary": "Focus on bringing your legs up towards your body in the air to increase stability for the Frontside 720. For the easiest grab, use a melon grab.",
      "rawText": "this with a proper head position will allow you to front seven pretty much anything the easiest grab for a front side 720 is the melon grab but a Indie grab is going to be a better grab if you're inspiring to do a front side 9 in the future the melon grab pulls your body along the spin forcing you to stay tight and keep your spot going the more more you can bring your legs up to you in the air the more stable you will be",
      "timestamp": 520,
      "endTime": 540,
      "duration": 20
    },
    {
      "stepNumber": 20,
      "summary": "Focus on a strong, fully extended takeoff to set up your frontside 720. Let your legs raise up to your body before reaching for the grab, allowing for more control over your spin.",
      "rawText": "and the more control you'll have over your spin it's important to not rush this grabbing process you want to make sure you're getting fully extended off the lip and giving your legs time to raise up to your body before reaching down for the grab if you go and get a strong takeoff your body will be set up to hit any grab you want so focus on that takeoff and the grab will come after on the front seven Landing you",
      "timestamp": 542,
      "endTime": 562,
      "duration": 20
    },
    {
      "stepNumber": 21,
      "summary": "To successfully land a frontside 720, keep your eyes looking uphill (away from the landing) for longer than you think you need to. This allows you to control your rotation and land with your upper body twisted uphill, preventing a heel-edge washout.",
      "rawText": "need to hold your eyes uphill longer than you'd think you should be landing with your upper body Twisted nearly 180 uphill this gives you more time to disperse your rotation on the landing looking up from your blind Landing too soon Landing looking at your feet or Landing looking downhill will all cause you to wash out to your heel Edge this is why we want to go and hold that blind",
      "timestamp": 564,
      "endTime": 584,
      "duration": 20
    },
    {
      "stepNumber": 22,
      "summary": "Keep your body tall with your chin pointed downwards as you come in for the landing of your frontside 720, so you can absorb the impact and land cleanly on your toe edge. This helps to distribute the rotation through the landing.",
      "rawText": "Landing long your V feels comfortable to go and fully kill the rotation and give our upper body time to disperse it through the landing allowing us to hold our tow Edge and ride away clean in order to fully absorb the impact of Landing you're going to want to keep your body tall coming into it this means you're not going to be doing the blind Landing leaned over your foot but instead keeping your body tall with your chin pointed downwards this stack",
      "timestamp": 586,
      "endTime": 607,
      "duration": 21
    },
    {
      "stepNumber": 23,
      "summary": "To absorb the takeoff and impact of a Frontside 720, use a \"blind landing position\" with your upper body rotated 180 degrees uphill. Maintain a tall body posture and dig in your toe edge for stability and to disperse the rotational force upon landing.",
      "rawText": "position is what's going to let you absorb the takeoff and fully disperse for rotation a textbook blind Ling position has your upper body rotated 180 facing uphill digging in your toe Edge and having your whole body tall by having this tow Edge pressure with a blind landing position and the tall body posture you'll be able to absorb the impact and disperse the rotational Force",
      "timestamp": 609,
      "endTime": 630,
      "duration": 21
    },
    {
      "stepNumber": 24,
      "summary": "To land a frontside 720, spot the knuckle and maintain your focus on that spot throughout the entire rotation. Ensure you hold your toe edge through the landing.",
      "rawText": "allowing you to hold your toe Edge through a full Landing if you slide your flat base or heel Edge that's a good indication that you looked up from your blind lighting too soon and you need to hold it a little bit longer next time on by ideal front side 7 it's going to feel like one constant rotation where you spot the knuckle and hold that spot through the full duration of the spin your first few attempts you might find",
      "timestamp": 633,
      "endTime": 653,
      "duration": 20
    },
    {
      "stepNumber": 25,
      "summary": "When spinning a Frontside 720, focus on keeping your eyes locked on the takeoff knuckle even as you pass the 450-degree mark. This will properly position your upper body, enabling you to complete the full rotation.",
      "rawText": "yourself getting stuck at 540 and needing to really Force around for 180 this is all going to come from not leading the rotation with your eyes it's important for when you're coming through your spin around 450 but you keep your eyes looking at the knuckle as you fly past it this will go and put your upper body in the proper position allowing you to finish a spin with counter rotation getting the seven around a few things",
      "timestamp": 654,
      "endTime": 675,
      "duration": 21
    },
    {
      "stepNumber": 26,
      "summary": "If you're learning frontside 720s, first master fully rotating your frontside 540s. Ensure you're landing your front five in a completely rotated and stacked position.",
      "rawText": "you can do to get more comfortable this motion without trying the front seven are one making sure that your front fives are completely rotated there is a massive difference between doing a front five lining on your heel Edge under rotated versus Landing your front five fully rotated in your stacked position so if you're struggling with getting the rotational power in a front seven go back to the front five and get them to",
      "timestamp": 677,
      "endTime": 698,
      "duration": 21
    },
    {
      "stepNumber": 27,
      "summary": "Practice landing consistently in the \"sweet spot\" of the jump before attempting a Frontside 720. This will build confidence and ensure you have the correct speed for the trick.",
      "rawText": "the point where you're Landing stacked two because you're going to be coming into the landing blind on a front seven you want to make sure you're very comfortable with a jump I'd recommend hitting the jump and getting super comfortable with Landing in a sweet spot so when you drop in for a front 7 there doesn't need to be any doubt in your mind that you're not going to have a correct speed when hitting it when you do a front seven your point of spot is",
      "timestamp": 700,
      "endTime": 720,
      "duration": 20
    },
    {
      "stepNumber": 28,
      "summary": "Focus on nailing the jump approach and spotting. If you're comfortable with the jump and can consistently spot your landing after a frontside 540, the frontside 720 should be achievable.",
      "rawText": "the knuckle of a jump so if you're going and coming up short or going too deep it can mess up your spotting Point making it harder to commit to the rotation so take your time get comfortable with the jump and it's going to make the front seven a lot easier the last tip is trust yourself if you can do a good five if you have a constant spot locked in on your front free you're going to be able to do the front seven there's a lot of",
      "timestamp": 723,
      "endTime": 744,
      "duration": 21
    },
    {
      "stepNumber": 29,
      "summary": "Focus on a good takeoff and head position to successfully land a Frontside 720. Believe in yourself, feel confident, and put in the work on the foundational steps.",
      "rawText": "ways to cheat a front seven by adding counter rotation speeding up the spin scruffing it around there's a bunch of possibilities so as long as you go and set yourself up with a good takeoff and good head position you'll be able to get this trick around so believe in yourself feel confident put in the work on the prior steps and you'll be able to tackle the front seven and absolutely lace it",
      "timestamp": 745,
      "endTime": 765,
      "duration": 20
    },
    {
      "stepNumber": 30,
      "summary": "Start your frontside 720 by switching from your toe edge to your heel edge as you go through the takeoff. Close your body halfway up the jump, then extend, snap your spin, finishing the snap as your tail leaves the lip.",
      "rawText": "in no time recap approach the jump on your tow Edge start switching to your heel Edge after you go through the spoon of the takeoff keep your body closed off into halfway up the takeoff with a slight bending your legs and body start extending and snapping your spin halfway up the jump finishing your snap as your tail leaves the lift of the jump with your upper body rotated 90° bring your",
      "timestamp": 767,
      "endTime": 788,
      "duration": 21
    },
    {
      "stepNumber": 31,
      "summary": "Lock your eyes on the knuckle and rotate through the jump, letting go of the grab at the 540 mark. Counter-rotate the final 180 degrees while keeping your eyes focused, and land slightly under-rotated, digging in your toe edge.",
      "rawText": "legs up to your grab around 270 lock your eyes on the knuckle and rotate around your spot let go of a grab at 540 and counter rotate 180 as you keep your eyes locked on the knuckle land slightly under rotated while digging in your tow Edge hold the landing long your V feels natural look up and ride away and that's how to front side 720 I'm Tavis from",
      "timestamp": 791,
      "endTime": 812,
      "duration": 21
    }
  ]
}