{
  "trickId": "frontside-540",
  "trickName": "Frontside 540",
  "aliases": [
    "fs 540",
    "front 540",
    "frontside five forty"
  ],
  "videoId": "MS6LSphIbRo",
  "videoTitle": "How To Frontside 540 On A Snowboard",
  "totalDuration": 502,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "For a frontside 540, use the same snap and takeoff technique as you would for a frontside 360. Focus on the familiar motions you already use for the 360 to get started.",
      "rawText": "hey snowm addiction Tavis here and in this video I'm going to teach you how to front side [Music] [Applause] [Music] [Applause] [Music] 540 for a front side 540 you'll be using the same snap and takeoff as your front side 360 the major difference for this",
      "timestamp": 0,
      "endTime": 22,
      "duration": 22
    },
    {
      "stepNumber": 2,
      "summary": "To properly execute a frontside 540, approach the jump with your hips and chest closed off, not already open. This will allow you to generate coordinated and powerful rotation by keeping your upper body connected to your board.",
      "rawText": "your front side spins starting with wind up the most common mistake on front side spins is approaching a jump with your hips and chest already open this makes it so when you go to throw your spin you're going to have to overextend your upper body disconnect in you from your board making your rotation wonky and uncoordinated power on your front side spins comes from being closed off coming",
      "timestamp": 45,
      "endTime": 65,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "To generate power for the Frontside 540, close off your upper body and hips slightly, turning them a bit more than perfectly stacked over your board. This allows you to snap and generate power with your core.",
      "rawText": "to the jump this means your body's stacked and in a neutral position over your board to add more power to this you don't want to go and throw more instead what you want to do is close off a little bit more making it so your upper body and hips are slightly more turned than perfectly stacked and squared this allows you to go and snap generating power with your core look keeping",
      "timestamp": 67,
      "endTime": 88,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "To generate maximum power for your frontside 540, keep your upper and lower body connected and maintain a relatively small, controlled range of motion; a slight, closed-off position is all you need for the spin.",
      "rawText": "everything tight with your upper and lower body connected keep in mind that even when this motion is done as exaggerated as possible it's still relatively small and you don't need to fully reach back in order to get the spin instead a slight bit of closed off is all the range of motion you will need to generate maximum power on your front side rotations because the range of",
      "timestamp": 90,
      "endTime": 110,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "When doing a frontside 540, time your snap so that you finish it as your tail leaves the takeoff. This maximizes your height and power off the jump.",
      "rawText": "motion on your snap on a front side spin is small where the power comes from is timing it's the timing that decides how much power you will have off the takeoff the perfect timing on a front side five is when you finish your snap as your tail leaves the takeoff this lets you get maximum height off the Jump and power from your board we call this snapping off the tail in order to have",
      "timestamp": 111,
      "endTime": 132,
      "duration": 21
    },
    {
      "stepNumber": 6,
      "summary": "To get the right spin for a frontside 540, keep your body closed off to the jump during the run-up. Then, snap your spin about halfway up the takeoff, adjusting the timing to control the speed of your rotation.",
      "rawText": "the right timing you're going need to have the correct position when coming into the jump you want to keep your body closed off to the jump during your whole run up only opening up as you snap your spin you generally want to start snapping your spin halfway up the takeoff but earlier you start your spin the slower your snap will have to be and the slower your snap is the less power there will be behind it you can delay",
      "timestamp": 134,
      "endTime": 155,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "To get a smooth Frontside 540, take off with your upper body slightly open, initiating the rotation from your tail. This helps maintain consistent spin throughout the trick.",
      "rawText": "and speed up your snap for more power or start early and go slower for Less power but you'll always be aiming to leave the takeoff off your tail with your upper body slightly open in order to get a constant rotation on your front fivs you won't be leaving the takeoff with your upper body very extended instead just slightly open this will help keep your",
      "timestamp": 157,
      "endTime": 177,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "Maintain a strong, upright, and slightly open position on takeoff, holding your form throughout the entire 540 rotation. Focus on keeping your core tight and arms and legs in a solid, uncompromised position.",
      "rawText": "core tight keeping your rotation smoooth this stack strong position off the takeoff is the base for all front side spins you want to be only slightly open and Tall leaving the takeoff keeping your legs and arms in a strong uncompromised position just like on a front side 360 your goal is to hold your spot through the full duration of your spin this is only possible with the",
      "timestamp": 179,
      "endTime": 199,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "Keep your vision underneath your front arm to spot the landing. This helps you rotate correctly and avoids overextending, leading to a more controlled and balanced Frontside 540.",
      "rawText": "proper head positioning you want to make sure you're never spotting over your shoulder this will make you tall and overextended and also make it so you need to reach around to try spot your Landing throwing you off balance and making it so the rotation won't work that's why we keep our vision underneath our front arm because this will let us spot the knuckle sooner hold the spot and pull into a rotation so you don't",
      "timestamp": 202,
      "endTime": 223,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "When attempting your first frontside 540, after spotting the knuckle at around 270 degrees, immediately fix your gaze forward and let your body continue rotating. This will help you complete the spin.",
      "rawText": "only see the rotation for longer but you also stay more connected and tight throughout the spin what's going to be really important for getting the front side 540 around when doing your first front side 540 you'll start to see the knuckle around 270 once you see the knuckle you want you to lock your eyes forward letting your body continue to rotate as you pass the knuckle keep your",
      "timestamp": 226,
      "endTime": 246,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "Keep your legs stacked with knees pointing outwards as you approach the jump. This will help you stay balanced and pull up tighter, speeding up your spin.",
      "rawText": "your body set up for success as the knuckle comes into view this is done through your arms and legs your legs should be in a stacked position with your knees pointed outwards by keeping your knees pointed out you'll be more balanced in the air this allows you to pull up tight speeding up your spin arms are also very crucial for front thighs you need to keep your arms away from the",
      "timestamp": 315,
      "endTime": 335,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "To help complete your frontside 540, actively use your front arm to pull yourself through the spin. Maintain a balanced position and let your front shoulder assist in pulling you through the rotation.",
      "rawText": "center of your body with your front arm actively pulling your spin Along by doing these two steps you'll be in a balanced position with your upper body pulling in to finish the spin there's two options for grabbing a front side 540 when learning Indie and melon Indie is by far the best for this spin because it lets you use your front shoulder to continue pulling in into your spin this",
      "timestamp": 337,
      "endTime": 358,
      "duration": 21
    },
    {
      "stepNumber": 13,
      "summary": "To land a Frontside 540, delay your grab until after you've rotated 180 degrees. Be prepared to release your grab to regain control before landing.",
      "rawText": "helps you land in your stacked position the melon grab also works but it goes and speeds up your rotation meaning that you're going need to let go of the grab in order to get control over your Landing this makes landing on your heel Edge super common whenever you do a front five with a melon grab on both of these grabs it's important to not rush it making sure that you're not grabbing before 180 in order to grab sooner V",
      "timestamp": 360,
      "endTime": 382,
      "duration": 22
    },
    {
      "stepNumber": 14,
      "summary": "To land a clean frontside 540, pull with your front arm and whip your back arm into the landing throughout the spin. The Indie grab helps with this technique.",
      "rawText": "common to see heal Edge Landings on front side 540s in order to get a clean 2ft Landing you're going to spend the whole duration of a spin pulling with your front arm and ipping your back arm into the landing that's why the Indie grab is the best grab for front side 540s by pulling your lead arm towards the landing you'll be able to get your access rotation downwards letting you",
      "timestamp": 408,
      "endTime": 429,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Land with both feet simultaneously in a stacked position, keeping your body engaged throughout the spin to ensure a clean landing. Consistent practice is crucial for mastering the frontside 540.",
      "rawText": "land in a stack position with both feet at the same time this is all set up with the previous steps but it's important to know that you need to keep your body engaged during the whole duration of the spin in order to successfully land with both feet at the same time in your stack position front fighs take a long a lot of repetition and a lot of practice to get dialed in because of these variables but by getting a strong front side 540",
      "timestamp": 432,
      "endTime": 454,
      "duration": 22
    },
    {
      "stepNumber": 16,
      "summary": "Keep your upper body closed off until you switch to your heel edge, then snap your spin halfway up the takeoff while keeping your board straight. This will help you learn the Frontside 540.",
      "rawText": "it's going to make it way easier to get a front seven in the future that's why I highly recommend going and putting the time in here because it's going to really help you out with every future front side spin recap keep a closed off upper body until after you switch to your heel Edge start snapping your spin halfway up the takeoff keeping your board as straight as possible as your",
      "timestamp": 457,
      "endTime": 478,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "Initiate the spin by snapping the tail off the lip, opening your upper body slightly. Spot the knuckle at 270 degrees and pull your arm around to complete the spin, aiming for a clean landing in a stacked position.",
      "rawText": "tail snaps off the lip with your upper body slightly opened spot underneath your arm as you pull your arm around for the spin grab your snowboard around 180 spot the knuckle at 270 and keep pulling into your spin Hit The Landing in The Sweet Spot with a stack position absorb the impact and ride away clean I'm Tavis from snowbo addiction and our goal is to",
      "timestamp": 480,
      "endTime": 500,
      "duration": 20
    }
  ]
}