{
  "trickId": "frontside-1080",
  "trickName": "Frontside 1080",
  "aliases": [
    "fs 1080",
    "front 1080",
    "frontside thousand eighty",
    "1080",
    "ten eighty"
  ],
  "videoId": "0luOaDmSTW4",
  "videoTitle": "The Key For Frontside 1080's",
  "totalDuration": 554,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "Focus on mastering frontside 720s and 900s, as the same fundamental skills, power, and control are crucial for landing a frontside 1080. Practice these rotations until your form is solid before attempting the 1080.",
      "rawText": "fundamental skills for our front side 1080 but what we do need is very strong fundamentals on the front sevens and front 9 this is because we're going to be using the same skills and just carrying them over adding more power adding more control and that's what's going to let us do the 1080 so that's what I'm going to talk about in this video I'm going to show you how we can go and make sure that our form is locked in so when you try the front 10 you'll",
      "timestamp": 23,
      "endTime": 44,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "To land a Frontside 1080, extend fully off the takeoff to maintain a flat rotation. Avoid dipping or cheating your takeoff, as this will disrupt your axis of rotation.",
      "rawText": "be able to lace it hopefully first try there's a few points we need to hit on every front 10 attempt and we're going to start with our takeoffs on a fride 1080 we need to keep our rotation very flat this means you need to make sure that you're getting fully extended off the takeoff because if you start dipping up and and over your shoulder or cheating your takeoff it's going to be harder to keep that strong flow that'll let you contain the same axis of",
      "timestamp": 46,
      "endTime": 67,
      "duration": 21
    },
    {
      "stepNumber": 3,
      "summary": "To make a Frontside 1080 easier, narrow your approach and delay your setup carve. This reduces the time spent on your heels, allowing for more extension off the tail of your board for the rotation.",
      "rawText": "rotation throughout the full spin there's three things that make this easier to do first off is approach by narrowing in our setup carve we'll be able to spend less time on our heels this makes it so you have the less chance to scrub meaning that you're going to get more extension off the tail of your snowboard in order to do this delay your setup carve make sure you're not going and switching to your heel Edge and shot after you fully have gone",
      "timestamp": 69,
      "endTime": 90,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "Focus on extending fully as you leave the lip of the jump, rather than winding up, to generate power for the frontside spin. This maximizes your rotation.",
      "rawText": "through the spoon of a jump because it's crucial to make sure you're leaving as much off your tail as possible because that's going to put you up with the jump and it's going to really initiate your rotation second is your wind up you don't want to wind up any extra for a front T because that's not where power comes on front side spins instead power comes from staying closed off and getting that full extension as you leave the lip so I want you when you're doing",
      "timestamp": 92,
      "endTime": 114,
      "duration": 22
    },
    {
      "stepNumber": 5,
      "summary": "To maintain power and control for your Frontside 1080, keep your front arm closed, hips squared (or even slightly closed) towards the takeoff, and time your snap so it finishes as your tail snaps.",
      "rawText": "your front T to just make sure that you're not letting your chest or hip open towards the takeoff instead making sure that your front arms closed off and your hips are squared if not even a little bit closed this is all the range of motion from a windup you're going to need to generate power but you need to pair that with the third step and that's your timing the ideal timing has you finishing your snap as your tail snaps",
      "timestamp": 116,
      "endTime": 136,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "Focus on keeping your upper body closed until the moment you snap into the rotation off the takeoff to maximize your range of motion. This will help you maintain a consistent and powerful rotation.",
      "rawText": "off the takeoff this will put you in the proper Arc of a jump while putting you in what we call the vortex and that is when you're in a consistent powerful rotation where you don't need to worry about correting your balance there is two main issues of timing first of all is letting your upper body open up to a jump before you start your snap this will just limit the range of motion you can utilize because if you're opened up",
      "timestamp": 139,
      "endTime": 159,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "To avoid over-rotating on your frontside 1080, avoid opening your chest too much on the takeoff. This prevents you from needing to hyper-extend your body for power, which can throw off your rotation.",
      "rawText": "like this your range of motion will be a lot smaller versus closed off to full what brings us into the second problem and that is over exaggerating your takeoff this happens a lot when you're coming into a jump with your chest open because it makes it in order to get your full power off a takeoff you need to go and hyper extend your body making it so your legs can fall behind your upper",
      "timestamp": 161,
      "endTime": 182,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "Focus on three key elements for power: 1) Maximize core extension as you snap off the tail. 2) Keep everything tight. 3) Pull your legs in together to grab around 270 degrees.",
      "rawText": "body what isn't ideal because we want it so our snap goes snaps us off a tail with a max amount of extension in our core but we can still keep everything tight and pull our legs in together allowing us to grab around 270 those are the three things that give you power on your front side spins and they're going to be really crucial to lock in before trying a front 10 the best way to train this is just by doing front sevens and",
      "timestamp": 184,
      "endTime": 205,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "Practice and master frontside 7s off small jumps, utilizing the same timing and \"spotting\" technique (eyes on the jump's knuckle) you'll use for a frontside 1080.",
      "rawText": "front 9es off of small jumps you you should be able to comfortably do front sevens off of 15t jumps before even thinking about trying a front 10 because you're going to be using that same timing that same spot that same Vortex on a small front 7even as you will be for the front 10 the next thing we need to go over is spotting just like every other front side spin your goal is to lock your eyes on the knuckle and rotate",
      "timestamp": 207,
      "endTime": 228,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "To complete the frontside 1080, actively lead the rotation with your upper body. This allows for proper counter-rotation and a stacked position over your board.",
      "rawText": "around it using the constant spot by Leading the rotation of your upper body you'll be able to finish your front T utilizing counter rotation as well as being more stacked over your board this is one of the challenges of your first time trying a front 10 because you'll have a very clear moment going from 7 to 10 where you can spot the knuckle and decide I'm going to pull out so it's going to take you a little bit to get",
      "timestamp": 230,
      "endTime": 250,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "To land a frontside 1080, ensure a clean takeoff by going straight with the jump and avoiding any drifting. This helps you maintain a consistent visual spot, which increases your confidence and aids in a successful landing.",
      "rawText": "comfortable with the motion of rotating to seven and then continuing your constant spot what really helps with a constant spot is making sure you aren't drifting when you drift on a jump it becomes a lot harder to track the same point on the knuckle and feel confidence that you're going to make it into the landing but by going getting a clean snap making sure that you're going with the jump and not drifting across you'll",
      "timestamp": 252,
      "endTime": 272,
      "duration": 20
    },
    {
      "stepNumber": 12,
      "summary": "Eliminate any drifting from your frontside spins to prepare for a Frontside 1080. Focusing on clean rotations will make the final 360 of the 1080 feel more natural.",
      "rawText": "be a to lock your eyes on and it's going to feel a lot more natural going and pulling in into that last 360 that you need for the 10 so if you're drifting on your front side spins take a step back and get that drift out of your riding because it's going to really be necessary when moving on to a 1080 the last thing you need for easy front 10 is getting comfortable Mak can't you have a sweet spot of a jump if you start coming",
      "timestamp": 274,
      "endTime": 294,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "Ensure consistent landings on the jump's \"sweet spot\" to confidently commit to the final rotation of a Frontside 1080. Avoid stopping at the front nine, which often leads to a heelside landing and a fall.",
      "rawText": "up short or going too big it's going to be really hard to commit to that last Blind part of a rotation so getting really comfortable with the jump being consistent Landing that sweet spot will let you fully commit to getting the spin around the most common fall you'll see on a front 10 is deciding you don't have enough air time and pulling out at front nine this usually results in a heelside landing where you then slap to your back",
      "timestamp": 296,
      "endTime": 317,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "To safely learn a Frontside 1080, master the Frontside 900 first. This builds the muscle memory necessary to adjust mid-air and land safely if you under-rotate the 1080.",
      "rawText": "this is one of the biggest Falls I make on my front pen attempts and this is because I'm not comfortable with my front nine so if I'm under rotating a front 10 I don't have a muscle memory to go and walk in and get over to my toes and land at that front nine that is one of the reasons it's so crucial to get a solid front nine to make front 10 way safer because then if you miss the snap you can adjust and land at 900 as well",
      "timestamp": 320,
      "endTime": 341,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "If you want to learn a Frontside 1080, master Frontside 900s first. Practice the melon grab, as it aids in rotation and allows you to continue spinning.",
      "rawText": "as doing the front N9 will give you all the fundamental skills you need for the front 10 so if you're scared of a front 10 go get your front nines it's going to be hard but it will really pay off depending on the grab you do your access rotation will be different on the front 10 that's why I recommend the melon grab the melon grab has two perks the first one being it goes and lets you continue rotation because it's leading with your",
      "timestamp": 344,
      "endTime": 366,
      "duration": 22
    },
    {
      "stepNumber": 16,
      "summary": "Use a melon grab (grabbing the heel edge with your front hand) to initiate and control your frontside 1080. This grab helps keep your rotation flat and consistent, while your back arm can be used to adjust the speed of your spin.",
      "rawText": "front arm grab down letting you go and pull into a spin as well as having your back arm free to adjust your access of rotation or slow down the spin the other bonus of the melon grab is it helps keep your rotation flat because you're able to go and keep your spot consistant at the same point and you don't really need to reach out of your way to get the grab so I'd say melon grab is is the easiest",
      "timestamp": 367,
      "endTime": 388,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "To land a frontside 1080, delay your grab until after you've rotated at least 270 degrees. This ensures you're getting full extension off the lip of the jump and maximizes your rotation.",
      "rawText": "grab for flat front tents for any grab you choose to do it's really important to make sure you're not grabbing before 270 if you manage to grab before 270 it's a great indication that you cut your snap short in order to break and reach for that grab a front 10 takes full extension off the lip so it should be almost physically impossible to get that full extension and then grab the 4",
      "timestamp": 390,
      "endTime": 410,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "Focus on a full, powerful snap off the jump, and let the grab come naturally. Also, choose a jump that's 35-50 feet with minimal kick to keep your rotation flat.",
      "rawText": "to70 so aim to get your full snap and then let the grab come to you naturally because the rushing this process is one of the things you can do to really lessen the amount of power you're getting off the lip and the last ingredient for a successful front 10 is picking the right jump you want to find a perfect 35 to 50t jump without too much kick this is because we're trying to keep our rotation flat and we want",
      "timestamp": 412,
      "endTime": 433,
      "duration": 21
    },
    {
      "stepNumber": 19,
      "summary": "To improve your chances of landing a frontside 1080, find a jump that's at least 35-50 feet long for a smoother, more controlled rotation. A well-built jump will significantly aid in the execution of the trick.",
      "rawText": "that nice long takeoff in order to generate rotation you can rotate front ends really fast I've done going on 20ft jumps but they feel way better on 35 to 50t jumps so if you don't have a proper jump in your Resort it might be worth venturing out over to Whistler some other Resort that makes better jumps because a really good jump will really help you with your front TS I wouldn't",
      "timestamp": 435,
      "endTime": 456,
      "duration": 21
    },
    {
      "stepNumber": 20,
      "summary": "Make sure you're comfortable with the jump you're using for your frontside 1080. Choose a jump that's not too kicky to set yourself up for success.",
      "rawText": "be able to just pull up at my local Resort and do a front 10 knowing the kind of Groom quality that's to bear so make sure that you have a jump that you're really comfortable with and is ideally not too kicky and will really put you on the right path to success it can be insanely hard to go and figure out what you're doing wrong especially once you start getting to tricks as complex as a 10",
      "timestamp": 458,
      "endTime": 478,
      "duration": 20
    },
    {
      "stepNumber": 21,
      "summary": "To learn a Frontside 1080, find a medium-sized jump and build speed. Focus on a late setup, switching edges after the lip, staying closed off, snapping your spin off the tail, and extending at the end of the rotation.",
      "rawText": "dial in your writing and get you to a point where you can do the frontend and if you're at that point we can give you that little extra confidence to go and try it cap find a good 35 to 50t jump get your speed locked in have a late setup carb switching edges after the spoon of the jump stay closed off when riding up the lifp snap and spin leaving off your tail finishing your extension",
      "timestamp": 501,
      "endTime": 522,
      "duration": 21
    },
    {
      "stepNumber": 22,
      "summary": "Focus on the knuckle as you rotate, leading the spin with your head and keeping your eyes locked on the landing spot as you pass the knuckle, then dig your toe edge to stop and ride away cleanly.",
      "rawText": "as your tail snaps off grab at 270 while locking your eyes on the knuckle continue leading the rotation of your head hold your spot on the knuckle as you pass it locking your eyes in that blind landing position digging your toe wedge Stop and Ride Away clean and that is how your front side 1080 the last video in the learn to jump front side series I hope you watch the whole thing",
      "timestamp": 525,
      "endTime": 546,
      "duration": 21
    }
  ]
}