{
  "trickId": "frontside-900-like-a-pro",
  "trickName": "Frontside 900 Like A Pro",
  "aliases": [],
  "videoId": "Tdj5eI7SLC4",
  "videoTitle": "How To Frontside 900 Like A Pro",
  "totalDuration": 549,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "Don't rush the rotation when attempting a frontside 900. Avoid overextending your upper body, as this is a common mistake that can disrupt the trick.",
      "rawText": "attached onto it this is a good way to actually think about spinning these tricks because it can help you visualize the second half of the motion the big issue of visualizing your front N9 like this is it can make you want to rush into the access of rotation you're feeling comfortable with what is my biggest issue on the front nine you can see it a lot where I'll go and overextend my upper body trying to get",
      "timestamp": 67,
      "endTime": 87,
      "duration": 20
    },
    {
      "stepNumber": 2,
      "summary": "To generate the necessary rotational force for a frontside 900 without disconnecting your spin, focus on overextending your upper body during the rotation. This will allow for the power needed for the front nine.",
      "rawText": "more power more snap and that's going to make my legs drag behind making a disconnect in my rotation the main reason this is happening is because I'm opening my upper body making it so I don't have as much range of motion to play with but I still need that power because a front nine takes a lot of rotational Force so what do I do I go and overextend my upper body pushing the rotation causing a disconnect this is",
      "timestamp": 89,
      "endTime": 111,
      "duration": 22
    },
    {
      "stepNumber": 3,
      "summary": "To ensure a consistent frontside 900, generate enough rotational force on takeoff to complete the spin without getting disconnected in the air. This will allow for the most stable and controlled spin.",
      "rawText": "the biggest thing you want to avoid on your front nines because it's going to make it so your spins are inconsist consistent and not one solid motion what's really important for a strong front nine the ideal takeoff on a front nine has you leaving with enough rotational Force to get the front nine around but not so much that you get disconnected in the air a great way to tell if you had enough snap is if you're",
      "timestamp": 114,
      "endTime": 134,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "To improve your frontside 900, focus on snapping your legs behind you for more power, rather than letting your upper body lead the rotation and over-exaggerating your takeoff. This will allow for a better takeoff and control through the rotation.",
      "rawText": "getting the full rotation but can still grab at 270 if you can't grab into around 450 that's a good indication that you're going and snapping too much off the takeoff letting your upper body lead the rotation Mak it into your legs leg behind in order to generate more snap and power without overexaggerating your takeoff the only thing you can do is speeding up your snap this means you",
      "timestamp": 137,
      "endTime": 158,
      "duration": 21
    },
    {
      "stepNumber": 5,
      "summary": "To generate the power for a frontside 900, stay closed off longer on the approach and then quickly snap your body into the rotation just before takeoff. This quick snapping motion is key, even though it makes the trick harder to execute.",
      "rawText": "need to be even more patient coming to a take off staying closed off a little bit longer so that way you can go and snap faster without overextending it's this quick snap motion that's necessary to generate the power needed for a front nine the quicker you do your snap the more power will be behind it the only hard part is the quicker you do it the easier it is to mess it up so this is",
      "timestamp": 160,
      "endTime": 180,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "Practice frontside 7s and 5s off small jumps to master fully popping and rotating without overextending your upper body, focusing on a strong, quick snap off your tail.",
      "rawText": "where the skill cap really comes in on front side 900s in order to train this do a bunch of front sevens and a bunch of front fivs off really small jumps getting really comfortable with fully popping and fully generating your rotation without overextending your upper body you want to be leaving off the lip feeling the strong power off the quick snap leaving off your tail with having your whole core and body",
      "timestamp": 182,
      "endTime": 203,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "To land a frontside 900, shorten your setup carve and delay your edge change. This will help you stay closed off and prevent your upper body from opening up too early, allowing for a stronger snap.",
      "rawText": "connected together the best way to go and do this is by shortening your setup car making sure that you're waiting and delaying when you get in your heel Edge will make it so you can go and stay closed off more naturally because the biggest problem you'll see on bigger front side spins is people getting antsy and letting their upper body open up before it's time to generate the snap and that's going to result in you need",
      "timestamp": 205,
      "endTime": 226,
      "duration": 21
    },
    {
      "stepNumber": 8,
      "summary": "Maintain patience and avoid opening your upper body too early. Also, delay engaging your heel edge and ensure you're lifting off the tail of the board for maximum rotation.",
      "rawText": "to overextend your upper body causing that disconnect every time that's why I always tell myself when dropping in for front nine front 10 to be patient making sure that I'm not letting my upper body open up and I'm making sure if I'm not getting on my heel Edge too soon because the next part to getting a good front nine is leaving off your tail the more you scrub the less you're going to get",
      "timestamp": 227,
      "endTime": 249,
      "duration": 22
    },
    {
      "stepNumber": 9,
      "summary": "Delay your setup carve to create a natural arc off the jump. This will make it easier to commit to the rotation and land smoothly for a Frontside 900.",
      "rawText": "the Arc of the jump this is why delaying your setup carf will let you snap off your tail putting more on a natural Arc of the jump making it easier to go and commit for rotation and get into a landing because front lines used that switch front side Landing that's really hard to commit to if you don't have the proper Arc going into the landing another way to increase power off a",
      "timestamp": 250,
      "endTime": 270,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "To generate more power for your Frontside 900, delay the start of your snap off the takeoff. This means you'll need to rotate faster to complete the spin.",
      "rawText": "takeoff is increasing the speed of your snap when doing a lofty like front three your snap is going to start around halfway off the takeoff and you're going to have a slow rotation as you leave the lip but in order to get more power we can actually make this motion quicker by going and delaying when we start our snap we'll have to do it faster and the faster we do it the more rotational",
      "timestamp": 272,
      "endTime": 292,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "Practice a quick, powerful snap on smaller jumps to get comfortable with the motion before attempting a Frontside 900 on a larger jump. This will help you manage the harsher angles and any takeoff imperfections.",
      "rawText": "power we're going to have coming off a lifp of a jump the issue with a faster snap is it makes it so your angles are more harsh so if you have a little bit of Jank in your takeoff it's going to be more exaggerated because you're going into it with more power in a quicker motion that just means you want to get really comfortable with a quicker faster snap on smaller jumps before moving on to a bigger jump and trying a bigger",
      "timestamp": 295,
      "endTime": 316,
      "duration": 21
    },
    {
      "stepNumber": 12,
      "summary": "Once you've rotated 450 degrees, actively pull with your back arm to initiate the backside rotation needed for the rest of the 900. Focus on this arm pull to complete the spin.",
      "rawText": "trick like a front nine I have a really hard time grabbing before 450 but this really highlights the second part of the spin and that is because it's really like a backside rotation once you get through about first 450 what I mean by that is you want to be grabbing and been pulling with your back arm into a spin if you don't let yourself pull into the",
      "timestamp": 318,
      "endTime": 338,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "Focus on actively engaging your muscles throughout the frontside 900 rotation. Use the same \"spawning\" technique as you do for front sevens and fives, spotting the knuckle and then looking forward.",
      "rawText": "rotation you're not going to be able to get into that Landing that two footed stomp what brings us to the in the air part of the front nine it's going to be using the same spawning principles as you use for front sevens and front fives where you're going and constantly spaw the knuckle and then as you pass it you let your gaze continue on forward it's really important to be active activ L engaging your muscles the whole time",
      "timestamp": 339,
      "endTime": 360,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "Engage your glutes, core, hips, and shoulders to initiate the frontside rotation, pulling into the spin. This active engagement is crucial for controlling the rotation and making adjustments mid-air.",
      "rawText": "you're in the jump on the front nine this means you're pulling in with your glutes your core your hips your shoulders every part of your body is pulling and leading into that rotation so much so that sometimes you'll feel like you're even flexing your eyes to get that little bit of the extra rotation because it's a lot easier to slow down a front nine than it is to speed it up this makes for two parts",
      "timestamp": 361,
      "endTime": 381,
      "duration": 20
    },
    {
      "stepNumber": 15,
      "summary": "Focus on a powerful takeoff with good extension, grab at a 270 spin point, and then pull your whole body into the rotation while locking your eyes on the landing, ensuring a full feet landing.",
      "rawText": "that make a front nine being that takeoff where you're going getting a good extension that lets you go and grab at two 70 and then pulling into the spin locking your eyes on the knuckle as you pull with your whole body into that rotation flexing and pulling it around until you go and see the landing and can land on full feet at the same time this requires a Bel as much power as a front",
      "timestamp": 383,
      "endTime": 404,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "After grabbing the board during your Frontside 900, let your upper body rotate an extra 90 degrees past your legs. This allows you to \"pull back\" the spin and utilize counter-rotation to complete the rotation.",
      "rawText": "side 10 because we can't really utilize counter rotation but what you can do to make it a little bit easier to rotate is let your body leave the rotation after you get the grab what I mean by this is when you grab you can actually go and pull with your upper body having your upper body rotated around 90 more de than your legs are this makes it so you can go and pull back the spin with counter rotation anytime you see",
      "timestamp": 406,
      "endTime": 426,
      "duration": 20
    },
    {
      "stepNumber": 17,
      "summary": "Pull with your upper body throughout the spin, then use counter-rotation with your arm to accelerate your rotation at the last second, allowing you to spot the landing and complete the 900.",
      "rawText": "someone's arm come back in front of them like this that means you're utilizing counter rotation to pull in between back a line and this can help go and speed up your rotation at that last second and that's why it's so crucial to be pulling with your upper body the whole way through the spin because then you can be at 7 see the landing and finish off that spin if needed this is one of the best",
      "timestamp": 428,
      "endTime": 448,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "To prepare for a frontside 900, carve into your heels after the jump's \"spoon\" and keep your shoulders and hips closed off to the jump until the moment you initiate the spin.",
      "rawText": "break it down and if you're not ready to front nine we'll tell you but not only that we'll also tell you how to get ready because our goal and addiction plus is to improve as many people's riding as possible sign up now and let us improve your riding recap be patient with your setup carve swap into your heels after the spoon of the jump keep your shoulder and hips closed off to the jump until it's time to snap time your",
      "timestamp": 474,
      "endTime": 495,
      "duration": 21
    },
    {
      "stepNumber": 19,
      "summary": "As you leave the jump's lip, reach for the grab around 270 degrees, keep your eyes on the landing, and use your upper body to lead the rotation. Pull yourself into the landing, ensuring you land over your toes with both feet down.",
      "rawText": "snap so you finish extending as your tail leaves the lip of a jump bring your body back aligned and reach the grab around 270 lock your eyes on the knuckle and pull the rotation around using every part of your body pull more than you think letting your upper body lead for rotation by a little bit then pull yourself into the landing making sure that you're getting over your toes and getting both feet down to the ground",
      "timestamp": 498,
      "endTime": 519,
      "duration": 21
    },
    {
      "stepNumber": 20,
      "summary": "Land with both feet stacked and look up to ride away. Mastering the frontside 900 requires the same power and split landing challenge as a frontside 1080, so take your time to learn it well.",
      "rawText": "land both feet stacked look up and ride away front nines are one of the most tet tricks in snowboarding if you do one in front of people that know what's up they're going to lose their mind and get absolutely stoked this is because it has just as much power needed as the front tent with that really challenging split front side Landing so if you want to be a beast take your time learn the front 9es because after that front 10 will be",
      "timestamp": 521,
      "endTime": 541,
      "duration": 20
    }
  ]
}