{
  "trickId": "frontside-180",
  "trickName": "Frontside 180",
  "aliases": [
    "fs 180",
    "front 180",
    "frontside one eighty",
    "frontside 1",
    "fs one eighty"
  ],
  "videoId": "sBbL8FsRvXc",
  "videoTitle": "Master The Frontside 180 On Your Snowboard",
  "totalDuration": 516,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "Focus on practicing your frontside 180s off your heel edge to build a strong foundation for your future spins. This will help you dial in the fundamentals of frontside spins.",
      "rawText": "hey snow addiction cavis here and in this video I'm going to teach you how to do a profer front side 180 off your heel Edge you can do front runes off your toe Edge but we're going to use this as a base for getting all of our front side spin fundamentals going so that's why we'll be training it off our heel Edge so we can really get it dialed in and lock the future spins to [Music]",
      "timestamp": 0,
      "endTime": 21,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "To prepare for a frontside 180, get into a \"stacked\" position: square your body to the board, bend your knees slightly, keep weight over the balls of your feet, and keep both your upper and lower body closed off. This stance provides the power you'll need for the spin.",
      "rawText": "come there are a few fundamental skills you're going to need for every front side spin but first off being finding your stacked position a stacked position refers to having your body squared off with your snowboard a slight Bend in your legs having your weight set over the balls of your feet and keeping your upper and lower body closed off to the jump this is a powerful position that",
      "timestamp": 28,
      "endTime": 48,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "When approaching the jump for a frontside 180, carve on your toe edge then switch to your heel edge *after* you've gone through the \"spoon\" of the jump while maintaining your stacked body position.",
      "rawText": "you'll be using for every front side spin with only slight variations the second skill you need for your front side spins is your setup carve a setup carve refers to switching from your tow Edge to your heel Edge When approaching the jump with a textbook setup carve being coming to the jump on your toe Edge switching to your heel Edge after you go through the spoon of a jump while holding your stack position keeping your",
      "timestamp": 50,
      "endTime": 71,
      "duration": 21
    },
    {
      "stepNumber": 4,
      "summary": "Focus your eyes on where you want to land and snap off the tail of your board in a straight line for a clean 180. Hold a straight line as you approach the takeoff, making sure your tail is the last part of your board to leave the snow.",
      "rawText": "eyes at the end and snapping off the end in a straight line with as little pre- rotation as possible getting a clean snap off your tail your approach for a setup carve can be super flexible but the goal is to hold a straight line off a takeoff making sure that the last thing to leave leaf and jump is the tail of your snowboard giving you a little bit of extra snap and power the next",
      "timestamp": 73,
      "endTime": 93,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "To prepare for a frontside 180, square up to the jump, close your front shoulder, and bend your legs. This creates a strong base for generating a smooth spin.",
      "rawText": "skill you need to get in place is your windup a proper wind up for a front side spin has you square it off to a jump closing your front shoulder and adding a little bit of Bend to your legs this will give you a powerful platforms to generate snth off of you don't need much rotational power for front side 180 but it's going to be a form that you use for future spins so we're still going to",
      "timestamp": 95,
      "endTime": 115,
      "duration": 20
    },
    {
      "stepNumber": 6,
      "summary": "Focus on landing with both feet at the same time, in a stacked position, and with a flat base or slight toe pressure. This will help you achieve a stable switch frontside 180 landing.",
      "rawText": "focus in on getting it dialed in in this video after that you're going to have to deal with the landing and the switch front side Landing is one of the hardest Landings in snowboarding a perfect front side 1880 Landing as you taking off and Landing with both feet at the same time in your stacked position with a flat base or a slight bit of toe pressure the most common Landing you'll see",
      "timestamp": 117,
      "endTime": 137,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "To land a clean frontside 180, ensure you fully rotate in the air. This will allow you to land with both feet and absorb the impact for a clean exit.",
      "rawText": "especially when learning the front one has you Landing a little bit on your heels this is happening because of under rotation or mistake in your AIS rotation but once you fully learn how to do your front side 180 you'll be able to pop up and get that clean two-footed Landing consistently what will profly help you absorb the impact of the landing and kill your rotation allowing you to ride away clean with both skills in place",
      "timestamp": 139,
      "endTime": 159,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "Focus on your heel edge and practice frontside 180s without your snowboard on, landing \"stacked\" (balanced). Then, repeat the motion with your board, popping up and landing balanced.",
      "rawText": "it's time to go and learn the front side 180 to start this set your weight onto your heel arge and just practice doing some front side 180s offing off Landing completely stacked this is the first step to learning most spins and it's really crucial for just getting used to the motion next do the same step but with your snowboard on trying to pop up and land stacked if your board tries to",
      "timestamp": 161,
      "endTime": 181,
      "duration": 20
    },
    {
      "stepNumber": 9,
      "summary": "Focus on your heel edge as you approach the slope. Shift your weight and \"scuff\" your board around to initiate the frontside 180 rotation.",
      "rawText": "keep rotating after you hit those snow that means he has too much power do a step until you can pop up and stomp your Landings now it's time to add speed into the equation get on your heel Edge and as you're going down the slope shift your weight scuffing around a front side 180 to do this you need to make sure you have pressure in your heel Edge and you want to keep doing it and you can go and",
      "timestamp": 183,
      "endTime": 203,
      "duration": 20
    },
    {
      "stepNumber": 10,
      "summary": "To improve your Frontside 180, focus on a smooth, flowing motion to rotate. Once you're comfortable, add height by extending your legs and jumping forward as you rotate, using a bump or small feature for extra air.",
      "rawText": "eliminate the amount of scuff making the motion as smooth as possible resulting in a fluent 180 into your stacked position after that start adding some height into your 180s do the same motion but with extending your legs jumping forward into the 180 this is easier if there a little bump or Nook that you can go and catch a little bit of extra air off going down the slope what's",
      "timestamp": 205,
      "endTime": 226,
      "duration": 21
    },
    {
      "stepNumber": 11,
      "summary": "Focus on maintaining heel edge pressure as you pop, and make sure your tail is the last part of your board to leave the takeoff to generate power and height for your frontside 180.",
      "rawText": "important here is making sure you're maintaining your heel pressure while popping up and rotating after that in order to elevate your front side 180s to the next level go and put an emphasis on having your tail being the last part of your board to leave the takeoff this will go and help you get a naap fully utilizing your snowboard to generate power and height it's not too noticeable on flat ground but once you do it off a",
      "timestamp": 227,
      "endTime": 248,
      "duration": 21
    },
    {
      "stepNumber": 12,
      "summary": "Find a side hit where you can approach on your heels to practice the frontside 180. This approach will help with control and rotation.",
      "rawText": "jump it will be a massive Game Changer that will give you more control in the air and more control over your rotation the end result of hitting all these steps is a completed 180 Landing fully stacked with good flat based pressure letting you ride away switch clean once you have these steps in place your next stage is a side hit try to find a side hit that lets you approach on your heel",
      "timestamp": 250,
      "endTime": 270,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "As you ride off the jump, keep your shoulders closed off until the moment of takeoff, then open your upper body to face the jump as your tail leaves the edge. Focus on timing the opening of your upper body with your jump.",
      "rawText": "Edge the only thing you're going to need to change for this is your timing now since you're riding off a jump you need to make sure your timing is in line with your takeoff When approaching the side hit keep your shoulder squared and closed off to the jump and as you ride off the Jump open your upper body having your upper body forward facing the jump as your tail snaps off the Ed keep doing",
      "timestamp": 272,
      "endTime": 292,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "If you're ready to learn a frontside 180 and have the fundamentals down, the only adjustment you need to make when hitting a jump is adding a setup carve. Match the carve to the rotation.",
      "rawText": "but are almost impossible to notice in yourself so come sign up for snow addiction you can get a one Monon free trial and we can give you the coaching you need to improve your riding today if you're feeling good and have all the previous steps for a front side 180 in place it's time to take it to a park jump when hitting a jump the only thing you need to change is adding in a setup C when doing your setup carve you want to make sure that you're matching the",
      "timestamp": 340,
      "endTime": 361,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "When approaching the takeoff, stay centered on your board to maintain balance. Time your rotation so you initiate the throw just as your tail leaves the lip.",
      "rawText": "angle of the takeoff making sure you're not leaning forward or back instead staying stack in the center of your snowboards when riding up the lip this centered Position will help you maintain balance giving you a lot more control when in the air next is timing you want to finish your throw as your tail leaves the takeoff front side 180s don't require much rotation this means you want to limit the range of motion of",
      "timestamp": 362,
      "endTime": 383,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "Focus on an upward motion as you release your wind-up. This centers your weight over the balls of your feet, helping you stay light on your edge and delaying the snap for better control during the frontside 180.",
      "rawText": "your snap a good way to do this is by making your momentum go up while releasing your wind up you've been doing this subconsciously during the other steps by putting emphasis on this motion you'll achieve two things your weight will be more centered over the balls of your feet helping you stay lighter on your Edge it will also delay your snap helping you make sure your board is in",
      "timestamp": 385,
      "endTime": 405,
      "duration": 20
    },
    {
      "stepNumber": 17,
      "summary": "To get a controlled Frontside 180, add upward momentum to your rotation as your tail leaves the lip of the jump. This will help you maintain control in the air and land smoothly on both feet.",
      "rawText": "contact with the jump up until your tail leaves the lip of a takeoff plus by adding upward momentum to your rotation you'll have more control in the air allowing you to get more steezy and even add a grab if you want a proper takeoff will set you up perfectly for that two footed stomped Landing what is going to be really crucial in feeling confident with your front side 180s there are a",
      "timestamp": 406,
      "endTime": 426,
      "duration": 20
    },
    {
      "stepNumber": 18,
      "summary": "To improve your Frontside 180 landings, actively finish the rotation of your upper body throughout the spin. This helps ensure a complete 180, preventing you from landing on your heel edge.",
      "rawText": "few things you can do outside of Pop to improve your Landings first upper body positioning by making sure you finish rotation of your upper body you'll be able to increase the chance of Landing in a complete 180 when you under rotate a front side 180 you'll have to do what's called a heal Edge Landing this means you're landing on your heel edge meaning you won't be able to catch your toe Edge on the Landing the downside to",
      "timestamp": 428,
      "endTime": 448,
      "duration": 20
    },
    {
      "stepNumber": 19,
      "summary": "Focus on landing in a two-footed, stacked position after your frontside 180 to control the impact. This will help you land more cleanly.",
      "rawText": "landing on your heel Edge is it makes it so you can't control the impact of the landing nearly as cleanly so your goal should always be to fully rotate your spin Landing in your two-footed stacked position this will help you go and disperse the impact of a jump really cleaning up your Landings easier said been done but that is what you're aiming for on every front side 180 for recap do a setup carve switching to your heel",
      "timestamp": 451,
      "endTime": 473,
      "duration": 22
    },
    {
      "stepNumber": 20,
      "summary": "As you take off, stay centered over your board with edge pressure. Rotate your frontside 180 as your tail leaves the takeoff, land flat-based, and look up to ride away.",
      "rawText": "Edge as you start to go up the takeoff stay centered over your board with a bit of edge pressure finishing your snap as your tail leaves for take off rotate your front side 180 land flat-based fully rotated look up and ride away I hope this video gave you a better understanding of how to front side 180 because we will be using this as a building block to handle every future front side trick starting with 360 540",
      "timestamp": 475,
      "endTime": 496,
      "duration": 21
    }
  ]
}