{
  "trickId": "jump",
  "trickName": "Jump",
  "aliases": [
    "jump",
    "hitting a jump",
    "air",
    "taking flight"
  ],
  "videoId": "sf3_cVRWatQ",
  "videoTitle": "How To Hit Your Jumps Snowboarding",
  "totalDuration": 441,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To maximize air time, match the arc of the jump by taking off with a good, consistent pop. Aim to land with both feet simultaneously.",
      "rawText": "to spend less time on the ground and more time in the air when hitting a jump you have two main goals the first being matching The Arc of the jump this is done for your takeoff with a good takeoff you can pop off a lip and it will naturally sink you up to go up Arc over and come into a landing hitting both feet at the same time this is the ideal flight path you want to be trying to hit on every jump second is hitting",
      "timestamp": 21,
      "endTime": 42,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "Focus your landing on the \"sweet spot\" of the jump. This is the area about 30% of the way down the landing hill, where the impact will be the softest.",
      "rawText": "The Sweet Spot of a landing all jumps have something called the knuckle the knuckle is the flat section after the lip of the takeoff it goes takeoff knuckle then landing and The Sweet Spot refers to the part of the landing that has the least amount of impact this is generally around 30% of the way down the jump past halfway down the landing you start getting into what we call going",
      "timestamp": 45,
      "endTime": 65,
      "duration": 20
    },
    {
      "stepNumber": 3,
      "summary": "Aim to land in the \"sweet spot\" of the jump to create a cushion and avoid landing on the knuckle (the most impactful part) or overshooting. This increases safety when hitting any jump.",
      "rawText": "aim to land in The Sweet Spot because it gives that little bit of cushion of going too small and too big making sure we don't land on the knuckle what is the most impactful part of the jump and making sure we don't overshoot the jump Landing down in the lower spoon by aiming for The Sweet Spot you will drastically increase the safety of hitting any jump everyone always says Alles are needed to learn how to jump",
      "timestamp": 89,
      "endTime": 109,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "When jumping, shift your weight from your front foot to your back foot. This keeps the board in contact with the snow longer, allowing you to fully utilize the board's tail for the jump.",
      "rawText": "but why is this this is because when we're jumping we want to shift our weight from our front foot to our back foot in order to keep our board in contact with the snow as long as possible allowing us to go and snap off our tail fully utiliz it in the shape of your snowboard and all the potential energy it can generate when we're jumping we're going to eliminate that big movement and just keep the weight",
      "timestamp": 111,
      "endTime": 131,
      "duration": 20
    },
    {
      "stepNumber": 5,
      "summary": "To practice the weight shift needed for jumps, do \"micro ollies\": slightly bend your knees and shift your weight to your back foot, then pop off the board. This small movement helps train the technique for taking off jumps.",
      "rawText": "transfer of shifting from a stack position to our back foot this will let us go and fly off a jump while maintaining board pressure for Lift as long as possible to train this weight shifting technique practice micro allies micro allies are when you go into a slight Bend in your legs and just shift your weight to your back foot and pop off it's a very small motion but this is very accurate to what we want to be",
      "timestamp": 133,
      "endTime": 155,
      "duration": 22
    },
    {
      "stepNumber": 6,
      "summary": "To practice for jumps, shift your weight from your front foot to your back foot with a slight extension. This helps maintain board contact with the snow.",
      "rawText": "doing off an actual jump you can train this going down the hill or just on flat just try to get used to the feeling of Shifting your weight from your front foot to your back foot with slight extension that'll help keep your board in contact with the snow as long as possible the other way to generate height on a snowboard is jumping a lot of people think to generate height on a snowboard while jumping you need to",
      "timestamp": 157,
      "endTime": 177,
      "duration": 20
    },
    {
      "stepNumber": 7,
      "summary": "When approaching the jump, slightly bend your legs, putting pressure on the balls of your feet. Maintain this \"coasting\" position throughout the jump.",
      "rawText": "squat all the way down and try Push Up full extension the actual motion you want to be using is much smaller than this take a slight bend your legs that puts pressure onto the balls of your feet this is the exact position you want to be in when going off the jumps you can actually hold this position the whole time you're hitting the jump we call this coasting when you go and Coast",
      "timestamp": 178,
      "endTime": 198,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "Keep your body stacked over the center of your snowboard when going off a jump, avoiding any extending with your legs to control your airtime. This stable position helps with a safer and easier first jump experience.",
      "rawText": "off a jump you're not going into extending so you're not getting extra height out of your legs what this does is it makes it so the first time you hit a jump you have less air making it safer and more easy to navigate the most important thing for this is that you're holding this position and not getting thrown forward or backwards going off the lifp or getting pushed down you want to be stacked over the center of your snowboard with your slight athletic",
      "timestamp": 201,
      "endTime": 222,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "Square your body over the center of your board, facing the end of the takeoff, with your shoulders stacked and knees slightly bent. Maintain contact with the ground as long as possible on the approach.",
      "rawText": "stance riding up and getting off the end maintaining contact with your board on the ground as long as possible there is a lot of positions you can have when snowboarding but when jumping there is only one position you want and that is completely squared over the center of your snowboard head turned facing the end of the takeoff shoulders stacked with your slight bend your knees pting",
      "timestamp": 224,
      "endTime": 245,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "Keep your weight balanced on the balls of your feet in a \"power position\" when approaching and launching off the jump. Avoid shifting your hips forward or compromising your body position to maximize power and control.",
      "rawText": "the weight on your balls of your feet this is our power position that we want to be using every time we hit a jump if you go and start opening your hip shifting forward or compromising your body in any way it's going to drastically limit the power you can get off the lip while also adding a bunch of unforeseen Funk and the possibilities for Funk are endless as soon as you start dipping forward or back so make",
      "timestamp": 247,
      "endTime": 267,
      "duration": 20
    },
    {
      "stepNumber": 11,
      "summary": "When approaching a jump, maintain a strong, stable riding position (stacked). Your goal is to ride straight off the jump, from the bottom to the top, without adjusting your stance.",
      "rawText": "sure to practice and train riding in this strong stable position I'd recommend trying to ride down the mountain just holding this position for as long as you can seeing if you can go and do a straight line well stay in this position stack because that's what you'll be doing when going off of a jump When approaching a jump your goal is to ride off straight all the way from the bottom of the jump to the top of the",
      "timestamp": 269,
      "endTime": 290,
      "duration": 21
    },
    {
      "stepNumber": 12,
      "summary": "To prepare for a jump, maintain slight pressure on the balls of your feet to grip the snow and stay in control. Avoid any last-second speed checks right before the jump.",
      "rawText": "jump you want to have slight pressure on the balls of your feet not enough that you start getting on your Edge and turning into the jump but just enough that you're not going flat base this will just help you grip the snow and keep control a big thing that messes this up is last second speed checks if you're going and doing a speed check right before the bottom for jump when you come into the jump you're going to have to reshift your weight making it",
      "timestamp": 292,
      "endTime": 312,
      "duration": 20
    },
    {
      "stepNumber": 13,
      "summary": "Watch experienced riders hit the jump and pay attention to their speed, the number of turns they take before the jump, and where they perform their speed checks. This will help you gauge the correct speed and timing for your own jump.",
      "rawText": "harder to go and hold your stack position and lock it in the main cause to last minute speed checks is being unsure about the speed of a jump in order to remedy this what you want to do is a few things first of all watch people hit see how many turns we taking inch of a jump where we're doing your speed checks try to watch for the person who looks most confident going in and is",
      "timestamp": 314,
      "endTime": 334,
      "duration": 20
    },
    {
      "stepNumber": 14,
      "summary": "Watch experienced riders hitting the jump, paying attention to how they manage their speed and where they land. Then, imitate the person who takes the fewest speed checks to ensure you have the right speed for the jump.",
      "rawText": "the most still in the air next you can go up to the knuckle the jump from here you'll be able to watch people's in runs and then also watch River Landing watch a bunch of people hit the jump this way and keep in mind how many speed checks we're taking where we're taking those speed checks and where we're landing on the landing you want to be trying to imitate the person who's taking the least amount of speed checks looks in",
      "timestamp": 336,
      "endTime": 357,
      "duration": 21
    },
    {
      "stepNumber": 15,
      "summary": "Focus on maintaining a strong, stacked body position, and build confidence by starting with small, \"micro\" jumps that don't overextend your body.",
      "rawText": "sure you're ready to be hitting a jump or you want help getting your body ready to perform bigger jumps or just hit your first ever jump come join addiction plus first month is free and it's going to really help you get to the next level of riding jumping is all about keeping this strong long simple stacked body position and getting really confident with doing these micro jumps that don't overextend",
      "timestamp": 404,
      "endTime": 424,
      "duration": 20
    }
  ]
}