{
  "trickId": "pop",
  "trickName": "Pop",
  "aliases": [
    "popping",
    "olliing",
    "ollie"
  ],
  "videoId": "-bCYIDG_2wg",
  "videoTitle": "The Secrets Of Popping On A Snowboard",
  "totalDuration": 773,
  "steps": [
    {
      "stepNumber": 1,
      "summary": "To prepare for a pop, get into your \"stack position\": slightly bend your legs, put your weight on the balls of your feet, and keep your knees and shoulders square, avoiding any inward or outward knee movement or hip opening.",
      "rawText": "you what is popping how to pop and the different ways you can use that pop to maximize your air time and increase your plug on the mountain the first step to doing any pop is finding your stack position a stack position is a slight bending of the legs putting the weight onto the balls of your feet having squared knees and shoulders making sure that your knees aren't coming in or out and you're not opening your hips just a",
      "timestamp": 23,
      "endTime": 44,
      "duration": 21
    },
    {
      "stepNumber": 2,
      "summary": "When you squat down to pop, keep your back straight to maintain a stacked position. This allows for a powerful and full extension when you launch, preventing loss of power.",
      "rawText": "straight line stacked making sure your back is straight when you hold this position and you squat down your back will maintain a straight line making it so when you pop up everything will fully extend without losing any any power whenever you lose the stack position be it too much Edge pressure bending forward we call this breaking at the waist and breaking up the waist is the",
      "timestamp": 46,
      "endTime": 67,
      "duration": 21
    },
    {
      "stepNumber": 3,
      "summary": "To \"pop\" on your snowboard, start with a two-foot jump. Squat down and then jump upwards off both feet as you leave the feature.",
      "rawText": "or pop for short we'll start with the two foot a jump a two foot a jump is when you squat down and jump off off both feet off the feature this is a very entrylevel way of generating height on a snowboard and one of the most common mistakes you'll see on the mountain if you ever see anyone out of control or looking like they don't know how to hit a jump it's probably because we're using",
      "timestamp": 92,
      "endTime": 112,
      "duration": 20
    },
    {
      "stepNumber": 4,
      "summary": "To get the best \"pop,\" utilize your snowboard fully by letting your tail leave the takeoff before you jump. This maximizes the board's potential and the feature's kick.",
      "rawText": "the two-footed jump there's two main reasons it's so damaging to your airs first of all it doesn't fully utilize your snowboard allowing you to go and pop off before having your board fully leave the takeoff that also brings us to a second reason it doesn't fully utilize the feature jumps have something called Kick and your board has a tail when you do a two foot a jump you're not",
      "timestamp": 114,
      "endTime": 135,
      "duration": 21
    },
    {
      "stepNumber": 5,
      "summary": "To maximize your \"Pop\" on side hits, avoid putting too much pressure on your toes, as this can negatively impact your technique. Focus on proper technique to achieve maximum height and distance, especially on smaller takeoffs.",
      "rawText": "maximizing the use of either of those things limiting the amount of air you can get overall this is even more true on side hits because on side hits the takeoff is way smaller so that extra board length of distance will go in really the amount of maximum height and distance traveled you can achieve on your snowboard two- footed jumping also messes up your Technique this can be by putting too much pressure on your toes",
      "timestamp": 136,
      "endTime": 158,
      "duration": 22
    },
    {
      "stepNumber": 6,
      "summary": "Focus on shifting your weight from your nose to generate the most height when attempting a jump (ollie). This utilizes the biggest portion of your snowboard for maximum lift.",
      "rawText": "breaking out the waist just a whole bunch of things that can Co and get messed up when trying to perform a two-footed jump and that's why we really want to avoid it in our snowboarding let's break down the Allie allies are how you generate the most height off your snowboard this is because it's the biggest motion that utilizes the biggest portion of your snowboard going over from your nose shifting your weight over",
      "timestamp": 159,
      "endTime": 180,
      "duration": 21
    },
    {
      "stepNumber": 7,
      "summary": "Combine a small, quick two-foot jump motion with the weight shift of an Ollie to generate \"pop.\" This technique is a fundamental element of professional snowboarding.",
      "rawText": "that is why we don't generally use the Alli in park riding unless it's for a style Factor this is why the best thing to do is to combine the two fo of jump and the OE taking the quick small motion of a two- footer jump and combining it with the weight shift of the OE resulting in what we're calling popping this is something that all pro snowboarders will be doing",
      "timestamp": 228,
      "endTime": 248,
      "duration": 20
    },
    {
      "stepNumber": 8,
      "summary": "Instead of lifting off the jump, focus on pushing down on the tail of your board as you leave the jump. This will utilize the board's flex and the jump's kick for more air and control.",
      "rawText": "subconsciously if you ever heard of a term snapping off a tail it's referring to this by making sure you snap off your tail when leaving the jump you'll be fully utilizing the flex of your snowboard and the kick of the jump helping you get more control and air now let's break down how to do the most effective paw the best way to visual realze this is instead of trying to lift your jumps to you think about pushing",
      "timestamp": 250,
      "endTime": 271,
      "duration": 21
    },
    {
      "stepNumber": 9,
      "summary": "To get \"Pop\" off the jump, drive your legs down onto the takeoff, keeping your board at a constant angle to the jump's lip, and maintain your weight centered over the board. This maximizes contact and prepares you for lift-off.",
      "rawText": "your legs down onto the jump so that way you're trying to make contact with your board and the lip of a takeoff as long as possible when doing this you want to try to keep your board keeping the constant angle of the jump not letting your the front of your board dip down or dip up maintaining that strong straight angle as you go and push over and make sure you're getting your weight set over",
      "timestamp": 273,
      "endTime": 294,
      "duration": 21
    },
    {
      "stepNumber": 10,
      "summary": "As you approach the takeoff, fully extend your body. Aim to jump off the lip of the takeoff with your body fully extended to set yourself up to bring your legs up and control your air.",
      "rawText": "your tail snapping off the end so even though what you're doing is is jumping what it feels like is pushing off the Jump the ideal timing for this has you going and leaving off the lip of a takeoff as your body is fully extended setting you up to bring up your legs and fully control your air something that I can't overstate is you don't want your jump should be flattening out while going off the takeoff you should be",
      "timestamp": 296,
      "endTime": 317,
      "duration": 21
    },
    {
      "stepNumber": 11,
      "summary": "Shift your weight slightly over your back foot just before the lip of the jump. This subtle shift allows your board's tail to snap off the end of the jump for maximum \"pop.\"",
      "rawText": "holding the line of the takeoff until your tail snaps off the end this is where the highest skill cap of popping comes into play because the goal is to have your weight going from stacked and the center your board just shifted slightly over your back foot allowing you to make contact with the lip as long as possible this motion is very subtle and complex so it's not something that",
      "timestamp": 318,
      "endTime": 339,
      "duration": 21
    },
    {
      "stepNumber": 12,
      "summary": "Maintain board pressure on the lip of the jump takeoff as long as possible while keeping your board aligned with the angle of the takeoff. Focus on a smooth motion.",
      "rawText": "you're going to master in one day instead it's something to always be aiming for and working on every time you pop off a jump to recap that what you're trying to achieve is maintaining board pressure on the lip of a takeoff as long as possible well having your board match the angle of the takeoff for as long as possible and another really important step to this is the smoothness of your paw you don't want to be going and",
      "timestamp": 341,
      "endTime": 362,
      "duration": 21
    },
    {
      "stepNumber": 13,
      "summary": "When popping off a jump, generate a smooth, constant power throughout the entire motion. Avoid sudden changes in your extension or power to maintain control and a clean takeoff.",
      "rawText": "extending up and then rushing the last little bit the smoother you can make this motion the more consistent and fluent it will be so whenever you're popping off a jump make sure that you're going up and just one constant set of power to leave the takeoff as soon as you start trying to lessen this power or increase the power you'll be adding Jank to your takeoff increasing the chances of you going wild and losing control so",
      "timestamp": 365,
      "endTime": 386,
      "duration": 21
    },
    {
      "stepNumber": 14,
      "summary": "After fully extending for your jump, bring your legs up towards your body in the air to maintain control. Avoid bringing your legs up too early, as this can negatively affect your jump.",
      "rawText": "really focus in on these three steps the pressure off the Jump the angle of your board and the smoothness of your paw now that you're in the air you need to control it and the best way to control any air is by bringing your legs up to your body this should only be done after the full extension if you go and cut your extension short you'll be at risk of doing the two footed jump this is a",
      "timestamp": 389,
      "endTime": 409,
      "duration": 20
    },
    {
      "stepNumber": 15,
      "summary": "Focus on popping off your tail for the jump to initiate the lift and bring your legs up to you naturally, which will allow you to grab the board more easily.",
      "rawText": "super common mistake especially when people start grabbing because we'll go in instead of focusing on pushing off a jump focus on on bringing your legs up to her body so we can reach that grab but when you go and perform a successful pop the momentum of your pop up and the snap off your tail will actually bring your legs up to you as well as setting up on the natural Arc of the jump allowing you to hit any grab you want",
      "timestamp": 412,
      "endTime": 433,
      "duration": 21
    },
    {
      "stepNumber": 16,
      "summary": "Don't lock your legs straight or bend them too much when approaching a jump lip. Find a balanced leg position that allows you to absorb the g-force of the jump.",
      "rawText": "with much greater ease than trying to rush and reach for a grab when hitting and jump you don't want to have your legs too straight because Val make it so you can't absorb the gForce going up the lip and if there's any bumps in the snow you'll get thrown off balance you also don't want your legs too bent because it will also make it so you don't have the platform to go and absorb the gForce of going up the lip and then",
      "timestamp": 435,
      "endTime": 456,
      "duration": 21
    },
    {
      "stepNumber": 17,
      "summary": "Maintain a slight bend in your legs in your stack position to generate the power needed for your pop. This subtle weight shift, utilizing your snowboard, is key, rather than a big jumping motion.",
      "rawText": "you'll need more energy to pop up and extend the power zone is in your stack position maintaining that slight Bend in your legs this is all the bend you need to generate power off your snowboard because power of your snowboard doesn't come from this big over exaggerated jump motion instead it comes from that subtle shift of weight making sure you're fully utilizing the feature and and your snowboard a good way to tell if you have",
      "timestamp": 458,
      "endTime": 479,
      "duration": 21
    },
    {
      "stepNumber": 18,
      "summary": "Keep your weight over the balls of your feet when you squat down. If you're hinging forward or feeling weight on your heels, adjust your leg bend.",
      "rawText": "the right amount of Bend in your legs is if your weight is set over the balls of your feet if your squat down has you starting to hinge forward or break at the waist that means you're adding too much Bend in your legs and you need to straighten it out you can tell if your legs are too straight if you don't feel the weight on the balls of your feet and you start to feel it more centered around your heels or the soles of your foot you also need to make sure you're",
      "timestamp": 481,
      "endTime": 502,
      "duration": 21
    },
    {
      "stepNumber": 19,
      "summary": "Keep your body aligned and avoid opening your hips as you approach the takeoff. This will help you maintain control in the air.",
      "rawText": "not opening your hips to the takeoff opening your hips will go and throw off your Center C balance making it much harder to control your airs so you need to make sure you're staying stacked and keeping your body aligned next up is practicing keeping your board stable when riding off the features I like to practice this when riding off of a box going on the box and trying to keep my",
      "timestamp": 504,
      "endTime": 524,
      "duration": 20
    },
    {
      "stepNumber": 20,
      "summary": "To pop off a feature, keep your board flat and shift your weight from your front foot to your back foot at the last moment. This subtle motion helps you generate lift without leaning back too much.",
      "rawText": "board completely flat from the time on the box to leaving the feature Landing with a two-footed stack position remember this is a small subtle motion you don't want to be leaning back like you would for a tail press if your nose starts dipping up that's too much your goal is to suddenly shift your weight from your front foot to your back foot allowing your board to stay completely",
      "timestamp": 526,
      "endTime": 546,
      "duration": 20
    },
    {
      "stepNumber": 21,
      "summary": "Your summarized tip here:\nTo successfully \"Pop\", ensure your board remains completely flat and level as you ride off any feature. If your board lifts up or dips down, adjust your weight transfer to maintain a flat board.",
      "rawText": "flat as you ride off a feature resulting in landing at both feet at the same time if your board starts to lift up or dip down you know you aren't successfully transing your weight in a way that keeps your board completely flat and level this is a great skill to get in place because it's the same fundamental body principles that you'll be using off of the jumps when hitting a jump you will",
      "timestamp": 547,
      "endTime": 567,
      "duration": 20
    },
    {
      "stepNumber": 22,
      "summary": "Maintain a stacked, balanced position while shifting your weight slightly to your back foot as you approach the jump. Avoid leaning too far forward or back, and make small, subtle adjustments to your technique based on the jump's specific characteristics.",
      "rawText": "need to adjust this form slightly to match the angle of the takeoff you're still trying to hold that stacked position while shifting your weight to your back foot but you need to make sure you're not going in leaning forward or leaning back to overcompensate for the take off of the jump the motion you want to be using off the Jump is very small and subtle and every jump rides slightly differently with more kick or less kick",
      "timestamp": 569,
      "endTime": 589,
      "duration": 20
    },
    {
      "stepNumber": 23,
      "summary": "Start by adding a small pop to your jumps, gradually increasing the extension. Aim for a pop where you can perform the motion without needing to make adjustments in the air.",
      "rawText": "so it's going to be down to you to figure out the ideal body position to fully pop off that specific jump start to add a small small pop into your jumps slowly building your way up into you're getting the maximum extension you feel comfortable with as a rider you know you hit it right with the right amount of Pop if you can do this motion without making any adjustments in the air",
      "timestamp": 591,
      "endTime": 611,
      "duration": 20
    },
    {
      "stepNumber": 24,
      "summary": "As you pop off the jump, bring your legs up towards you naturally. Maintain a stacked, neutral position in the air to ensure a smooth landing.",
      "rawText": "adjustments in the air refer to arm flails shifting of the hips counterbalancing basically you want to pop off a jump and as soon as you pop off your legs want to come to you naturally and then you can just hold that stacked neutral position throating through the air coasting all the way to the landing Landing both feet the more still you can do this motion the better",
      "timestamp": 613,
      "endTime": 633,
      "duration": 20
    },
    {
      "stepNumber": 25,
      "summary": "Focus on relaxing and \"chilling\" in your straight airs off the jump to build confidence, which will then improve your \"pop\" and overall trick progression.",
      "rawText": "your pop was off the take off by getting your straight airs to this point of just relax chilling you'll really build your confidence on the jump allowing you to then go and add more tricks and add more technicality to your riding in a natural line and progression the base to every trick is this good foundation of a pop so by doing this not only will you become better at doing straight airs but",
      "timestamp": 635,
      "endTime": 655,
      "duration": 20
    },
    {
      "stepNumber": 26,
      "summary": "Bend your legs slightly and get into a stacked position, then apply pressure to the board for a good pop. This will help you get air and land smoothly.",
      "rawText": "you'll become a better more confident Rider overall so I highly recommend going out working on your pops and getting to a point where you can pop up get big air and just chill resulting in a smooth two-footed Landing that will feel absolutely amazing and that's how you pop a snowboard to recap you want to slight bending your legs a completely stacked position applying the pressure",
      "timestamp": 657,
      "endTime": 678,
      "duration": 21
    },
    {
      "stepNumber": 27,
      "summary": "As you hit the lip of a jump, fully extend and snap your tail upwards, letting your legs naturally come up to you as you match the jump's arc. Land with a two-footed stomp.",
      "rawText": "of your snowboard on the lip of a takeoff all the way into your tail snaps up with your full extension lining up with that moment having your legs naturally come up to you chilling in the air matching The Arc of the jump Landing with that two-footed stomp once you can do that you'll know that you fully have your pops locked in and you're ready to move on to bigger features and bigger",
      "timestamp": 680,
      "endTime": 700,
      "duration": 20
    }
  ]
}